{
  "timestamp": "2025-03-18T23:00:33.696Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1742338800000,
          "temp": 50,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 50. South wind around 9 mph, with gusts as high as 20 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1742378400000,
          "temp": 68,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 68. South wind 7 to 17 mph, with gusts as high as 31 mph."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1742421600000,
          "temp": 42,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Slight Chance Showers And Thunderstorms then Showers And Thunderstorms",
          "detailedForecast": "A slight chance of showers and thunderstorms between 8pm and 9pm, then showers and thunderstorms. Mostly cloudy. Low around 42, with temperatures rising to around 51 overnight. South southwest wind 10 to 16 mph, with gusts as high as 31 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1742464800000,
          "temp": 44,
          "snowfall": 70,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely then Chance Rain And Snow Showers",
          "detailedForecast": "Rain showers likely before 1pm, then a chance of rain and snow showers. Mostly cloudy, with a high near 44. West wind 12 to 15 mph, with gusts as high as 26 mph. Chance of precipitation is 70%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1742335200000,
          "temp": 35,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Rain",
          "detailedForecast": "A slight chance of rain after 2am. Mostly cloudy, with a low around 35. Northeast wind 5 to 10 mph. Chance of precipitation is 20%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1742378400000,
          "temp": 40,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain. Cloudy. High near 40, with temperatures falling to around 38 in the afternoon. Northeast wind 10 to 15 mph. Chance of precipitation is 90%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1742421600000,
          "temp": 27,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Sleet",
          "detailedForecast": "Rain and snow before 10pm, then rain and a slight chance of sleet between 10pm and 11pm, then sleet and rain and snow. Cloudy. Low around 27, with temperatures rising to around 30 overnight. Northeast wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1742464800000,
          "temp": 31,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Chance Light Snow And Patchy Blowing Snow",
          "detailedForecast": "Snow before 8am, then a chance of snow and patchy blowing snow between 8am and 4pm. Partly sunny, with a high near 31. Northwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1742335200000,
          "temp": 35,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Rain",
          "detailedForecast": "A slight chance of rain after 2am. Mostly cloudy, with a low around 35. East wind 5 to 10 mph. Chance of precipitation is 20%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1742378400000,
          "temp": 44,
          "snowfall": 70,
          "snowAmount": "",
          "shortForecast": "Light Rain Likely",
          "detailedForecast": "Rain likely. Cloudy. High near 44, with temperatures falling to around 42 in the afternoon. Northeast wind around 10 mph. Chance of precipitation is 70%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1742421600000,
          "temp": 26,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain then Slight Chance Sleet",
          "detailedForecast": "Rain before midnight, then sleet and rain between midnight and 2am, then a slight chance of sleet and a slight chance of freezing rain and rain and snow. Mostly cloudy. Low around 26, with temperatures rising to around 30 overnight. Northeast wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1742464800000,
          "temp": 32,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Light Snow And Patchy Blowing Snow",
          "detailedForecast": "Snow before 11am, then a chance of snow and patchy blowing snow between 11am and 5pm. Mostly cloudy, with a high near 32. Northwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 17",
      "conditions": "It’s still great! New groom this morning over a strong base with fresh snow . The upper loops have great coverage : both the skate and classic are premium ."
    }
  },
  "nubsNob": {
    "date": "3/18/25",
    "liftsOpen": "5 Lifts",
    "xcTrails": "The upper trails were power-tilled and tracked on Monday. Expect soft snow today. The upper red is holding snow better compared to the rest of the trails.",
    "nightSkiing": "Done for the season.",
    "comments": "It's a spring ski day with the temperature above freezing all day. The snow surface is transformed loose granular snow with plenty of moisture. Pintail Peak Lodge is open with food and an espresso bar. The Tune Center is now selling the demo skis from this season and we have some amazing deals in the General Store. The lifts will spin from 9 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 2\"",
      "sevenDays": "7 days: 2\"",
      "ytd": "YTD: 137\""
    }
  }
}