{
  "timestamp": "2025-03-10T10:00:46.994Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1741600800000,
          "temp": 62,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Sunny",
          "detailedForecast": "Sunny, with a high near 62. Southwest wind 3 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1741644000000,
          "temp": 43,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear. Low around 43, with temperatures rising to around 45 overnight. South southwest wind 7 to 13 mph, with gusts as high as 23 mph."
        },
        {
          "name": "Tuesday",
          "timestamp": 1741687200000,
          "temp": 53,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 53, with temperatures falling to around 48 in the afternoon. West wind around 13 mph, with gusts as high as 22 mph."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1741730400000,
          "temp": 27,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 27. North northeast wind 5 to 9 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1741600800000,
          "temp": 55,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 55. Southwest wind 0 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1741644000000,
          "temp": 27,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 27, with temperatures rising to around 39 overnight. Southwest wind 10 to 15 mph, with gusts as high as 35 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1741687200000,
          "temp": 30,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A slight chance of snow showers between 8am and 11am. Partly sunny. High near 30, with temperatures falling to around 26 in the afternoon. Northwest wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1741730400000,
          "temp": 19,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 19. Northeast wind 0 to 10 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1741600800000,
          "temp": 61,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Sunny",
          "detailedForecast": "Sunny. High near 61, with temperatures falling to around 59 in the afternoon. Southwest wind 0 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1741644000000,
          "temp": 29,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 29, with temperatures rising to around 43 overnight. Southwest wind 10 to 15 mph, with gusts as high as 35 mph."
        },
        {
          "name": "Tuesday",
          "timestamp": 1741687200000,
          "temp": 32,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers between 8am and 2pm. Partly sunny. High near 32, with temperatures falling to around 28 in the afternoon. Northwest wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1741730400000,
          "temp": 17,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 17. Northeast wind 0 to 10 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run ski trail was groomed today, March 9, 2025. Grass has started to show and the north loop of the trail is completely unusable at this time.  The current trail is approximately .5 km.  There is an additional $5 daily trail fee for the use of Bucks Run. Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours. Buck’s Run last day is Sunday, March 9, 2025."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sun, Mar 9",
      "conditions": "Nubs upper red and blue loops have good depth, coverage and grooming . The afternoon temperatures cause some minor sucking : but overall , still great skiing .  LF 8 with rill."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Mar 8",
      "conditions": "Skated Bucks today 10:30 AM - 1:45 PM. Lots of fun. Fast and controllable. The connector was groomed but hard and icy under the groom.  Still very usable. Very little forest debris.  Much less than up north last weekend. No dirt spots even when a few turns started to soften in the sun around 12:30.  Soft turns later in the morning were not that slow. Watch out for some small ice balls that sometimes end up in the skate lanes.  Very avoidable. The hills and turn through the pines in the back is still part of the trail.  Very nice!  Used A skis. Should be great tomorrow morning after the groom.  Thank you Huron Meadows crew. Great job!  Came over from Lansing today thanks to your efforts.Check out XC Ski Headquarters up north at Higgins Lake tomorrow.  You don’t have to be on the official team to participate in the Michigan cup relays. And the trails up there have been very good the last couple mornings. Thanks for 50 years of family service and winter fun XC HQ team!"
    }
  },
  "nubsNob": {
    "date": "3/9/25",
    "liftsOpen": "At least 6 lifts, Rope Tow and Space Worm",
    "xcTrails": "Trails were groomed and tracked on Saturday. Conditions are good.",
    "nightSkiing": "Done for the season.",
    "comments": "Spring skiing has arrived with the time change today. Expect loose granular snow this morning that will transition to a wetter snow this afternoon as the temperature climbs above freezing. The Bartlett Cup Super G race is on Sno Pro this morning. The Bahnhof Slopestlye Jam takes place in the Terrain Park at 11:00 AM. NASTAR racing from 12:30 to 2:00 PM on Birch Run. Pintail Peak Lodge is open with a deli and espresso bar. The lifts will spin from 9:00 AM to 4:30 PM.  Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 5\"",
      "ytd": "YTD: 135\""
    }
  }
}