{
  "timestamp": "2025-12-14T07:00:43.344Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1765695600000,
          "temp": 4,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 4. Wind chill values as low as -11. West wind around 12 mph, with gusts as high as 23 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1765710000000,
          "temp": 21,
          "snowfall": 12,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 21, with temperatures falling to around 18 in the afternoon. Wind chill values as low as -11. West northwest wind 10 to 15 mph, with gusts as high as 28 mph."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1765753200000,
          "temp": 11,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 11, with temperatures rising to around 15 overnight. West wind 5 to 9 mph."
        },
        {
          "name": "Monday",
          "timestamp": 1765796400000,
          "temp": 20,
          "snowfall": 37,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow between 7am and 1pm. Mostly cloudy, with a high near 20. Southwest wind 7 to 15 mph, with gusts as high as 28 mph. Chance of precipitation is 40%."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1765695600000,
          "temp": 6,
          "snowfall": 71,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 6, with temperatures rising to around 8 overnight. Wind chill values as low as -6. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1765710000000,
          "temp": 23,
          "snowfall": 65,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. High near 23, with temperatures falling to around 21 in the afternoon. Wind chill values as low as -6. North wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1765753200000,
          "temp": 17,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 17, with temperatures rising to around 19 overnight. West wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1765796400000,
          "temp": 23,
          "snowfall": 88,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely before 7am, then snow showers and patchy blowing snow. Mostly cloudy, with a high near 23. West wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1765695600000,
          "temp": 2,
          "snowfall": 76,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 2, with temperatures rising to around 5 overnight. Wind chill values as low as -9. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1765710000000,
          "temp": 20,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. High near 20, with temperatures falling to around 18 in the afternoon. Wind chill values as low as -9. Northwest wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1765753200000,
          "temp": 12,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 12, with temperatures rising to around 14 overnight. Wind chill values as low as -1. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1765796400000,
          "temp": 20,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 20. Wind chill values as low as -1. Southwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 13",
      "conditions": "Good news. Bucks run is up and running with excellent skate and classic. The golf course was also regroomed, but still no classic tracks there. Very windy so there is lots of debris in the tracks. Skaters reported excellent conditions. Note that on Monday and Tuesday Bucks will not be open until 2:00 so more snow can be spread. Please respect this closure so that we do not create conflict with the park staff. There’s still lots of other areas at the park to ski."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "[ ] groomed[ ] golf course is about as good as it gets[ ] Sheldon trails - fair to  good littered with tree parts, though the usual being trod upon[ ] icy patches under trees where not enough snow made it to the groun)d as it got colder and the rain - wet snow turned to ( oops - repost -- rain >>> snow"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "Lots of snow ! Yesterday’s big groomer provided a firm flat skate deck . Today nature provided about 2 inches of fluff . Has to push a little bit , but it was very nice - and the sun came out . LF 7"
    }
  },
  "nubsNob": {
    "date": "12/13/25",
    "liftsOpen": "6 lifts, Rope Tow and Conveyor",
    "xcTrails": "All XC trails will be power-tilled and tracked today. Conditions are very good.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "It is a cold and snowy Saturday at Nub's Nob. Conditions feel like the middle of winter. All of the Front and South Side runs are open today with the exception of the big terrain park. NASTAR racing begins today at 12:30 p.m. on Birch Run. The XC trails are being groomed this morning. The soup of the day is corn beef cabbage and there is a meatball sub special. Pintail Peak will open before next weekend! Bundle up and make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 10\"",
      "sevenDays": "7 days: 10\"",
      "ytd": "YTD: 37\""
    }
  }
}