{
  "timestamp": "2025-03-15T08:00:33.273Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742025600000,
          "temp": 52,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain and a slight chance of thunderstorms after 5am. Mostly cloudy. Low around 52, with temperatures rising to around 54 overnight. South southeast wind around 12 mph, with gusts as high as 22 mph. Chance of precipitation is 90%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742032800000,
          "temp": 70,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain and a slight chance of thunderstorms before 5pm, then a chance of thunderstorms and a chance of rain. Mostly cloudy, with a high near 70. South wind 13 to 21 mph, with gusts as high as 46 mph. Chance of precipitation is 90%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742076000000,
          "temp": 48,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Chance T-storms then Rain",
          "detailedForecast": "A chance of thunderstorms and a chance of rain before 8pm, then rain and a slight chance of thunderstorms. Cloudy. Low around 48, with temperatures rising to around 54 overnight. South wind 9 to 18 mph, with gusts as high as 36 mph. Chance of precipitation is 90%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1742119200000,
          "temp": 55,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain. Mostly cloudy, with a high near 55. West southwest wind 8 to 14 mph, with gusts as high as 23 mph. Chance of precipitation is 90%. New rainfall amounts between a tenth and quarter of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742025600000,
          "temp": 56,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Scattered Showers And Thunderstorms",
          "detailedForecast": "Scattered showers and thunderstorms after 5am. Mostly cloudy, with a low around 56. Southeast wind around 15 mph. Chance of precipitation is 40%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742032800000,
          "temp": 66,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms then Partly Sunny",
          "detailedForecast": "Showers and thunderstorms before 9am. Partly sunny. High near 66, with temperatures falling to around 63 in the afternoon. South wind 15 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742076000000,
          "temp": 30,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Scattered Rain Showers",
          "detailedForecast": "Scattered rain showers after 11pm. Mostly cloudy. Low around 30, with temperatures rising to around 36 overnight. Southwest wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 50%."
        },
        {
          "name": "Sunday",
          "timestamp": 1742119200000,
          "temp": 32,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Sleet then Snow Showers Likely",
          "detailedForecast": "Scattered rain showers before 7am, then a chance of sleet and scattered snow showers between 7am and 8am, then snow showers likely and sleet likely. Cloudy, with a high near 32. Northwest wind 10 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742025600000,
          "temp": 54,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Scattered Showers And Thunderstorms",
          "detailedForecast": "Scattered showers and thunderstorms after 5am. Mostly cloudy. Low around 54, with temperatures rising to around 56 overnight. South wind around 15 mph. Chance of precipitation is 40%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742032800000,
          "temp": 68,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms then Mostly Cloudy",
          "detailedForecast": "Showers and thunderstorms before 8am, then isolated showers and thunderstorms between 8am and 9am. Mostly cloudy. High near 68, with temperatures falling to around 64 in the afternoon. South wind 15 to 25 mph, with gusts as high as 50 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742076000000,
          "temp": 32,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Scattered Rain Showers",
          "detailedForecast": "Scattered rain showers after 8pm. Mostly cloudy. Low around 32, with temperatures rising to around 37 overnight. Southwest wind 5 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 50%."
        },
        {
          "name": "Sunday",
          "timestamp": 1742119200000,
          "temp": 33,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Sleet",
          "detailedForecast": "Scattered rain showers before 7am, then a chance of sleet and scattered rain showers between 7am and 8am, then sleet and rain and snow showers. Cloudy, with a high near 33. Northwest wind 5 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run ski trail was groomed today, March 9, 2025. Grass has started to show and the north loop of the trail is completely unusable at this time.  The current trail is approximately .5 km.  There is an additional $5 daily trail fee for the use of Bucks Run. Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours. Buck’s Run last day is Sunday, March 9, 2025."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 10",
      "conditions": "Nubs has plenty of coverage , depth , and groom on the upper loops. The sweet spot between hard and soft was 10:30 to 1:00. A little bit of wind debris , but not an issue . LF 8 rilled"
    }
  },
  "nubsNob": {
    "date": "3/14/25",
    "liftsOpen": "5 Lifts, Rope Tow and Space Worm",
    "xcTrails": "Trails were groomed and tracked on Wednesday. Conditions will be very good this morning and too soft in the afternoon.",
    "nightSkiing": "Done for the season.",
    "comments": "A spring warm up is forecast today. The snow is machine groomed this morning and will quickly transition to wet spring snow by the late morning. The temperature is forecast to hit 60 degrees today. If you have ever had a goal to ski in the morning and bike in the afternoon, today is your day. Pintail Peak lodge is open with food and an espresso bar. The lifts will spin from 9 AM to 4:30 PM today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 1\"",
      "ytd": "YTD: 135\""
    }
  }
}