{
  "timestamp": "2025-04-02T15:00:40.899Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1743606000000,
          "temp": 61,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "T-storms",
          "detailedForecast": "Thunderstorms and rain before 2pm, then rain and thunderstorms likely. Cloudy. High near 61, with temperatures falling to around 47 in the afternoon. Southeast wind around 16 mph, with gusts as high as 28 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1743631200000,
          "temp": 51,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain then Showers And Thunderstorms",
          "detailedForecast": "Rain and thunderstorms likely before 8pm, then showers and thunderstorms. Cloudy. Low around 51, with temperatures rising to around 61 overnight. South southwest wind 10 to 14 mph, with gusts as high as 26 mph. Chance of precipitation is 100%. New rainfall amounts between 1 and 2 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1743674400000,
          "temp": 65,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Rain Showers then Partly Sunny",
          "detailedForecast": "A slight chance of rain showers before 7am. Partly sunny. High near 65, with temperatures falling to around 61 in the afternoon. West southwest wind 9 to 18 mph, with gusts as high as 31 mph. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1743717600000,
          "temp": 39,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 39. Northwest wind 3 to 13 mph, with gusts as high as 24 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1743606000000,
          "temp": 40,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before noon, then snow and a slight chance of sleet between noon and 2pm, then rain and snow between 2pm and 3pm, then a slight chance of sleet and rain and snow between 3pm and 5pm, then rain and isolated thunderstorms. Cloudy. High near 40, with temperatures falling to around 35 in the afternoon. East wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 100%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1743631200000,
          "temp": 38,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain and scattered thunderstorms. Mostly cloudy. Low around 38, with temperatures rising to around 45 overnight. South wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1743674400000,
          "temp": 40,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain then Partly Sunny",
          "detailedForecast": "A slight chance of rain before 8am. Partly sunny, with a high near 40. Southwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1743717600000,
          "temp": 26,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 26. West wind 5 to 15 mph, with gusts as high as 30 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1743606000000,
          "temp": 42,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 2pm, then a slight chance of sleet and rain and snow between 2pm and 5pm, then rain and isolated thunderstorms. Cloudy. High near 42, with temperatures falling to around 35 in the afternoon. Southeast wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1743631200000,
          "temp": 38,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain and scattered thunderstorms. Mostly cloudy. Low around 38, with temperatures rising to around 46 overnight. South wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1743674400000,
          "temp": 41,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain then Partly Sunny",
          "detailedForecast": "A slight chance of rain before 8am. Partly sunny, with a high near 41. West wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1743717600000,
          "temp": 25,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 25. West wind 0 to 15 mph, with gusts as high as 30 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "4/02/25- Closed due to a major ice storm.",
    "liftsOpen": "0",
    "xcTrails": "Closed for the season due to many down trees.",
    "nightSkiing": "Done for the season.",
    "comments": "The area surrounding Nub's Nob has experienced a massive ice storm that has left much destruction in its wake. Power has recently been restored to the lodge and our Crew is beginning the clean-up effort that includes thousands of down tree branches on our slopes and the road leading to Nub's Nob.  The lodge and locker room are open from 9:00 AM to 5:00 PM if you need to stop out to grab your skis. There is a small chance we could open on very limited terrain on Saturday and Sunday. We will make that decision tomorrow by noon. We hope to see you on the slopes real soon",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 150\""
    }
  }
}