{
  "timestamp": "2025-03-15T16:00:31.025Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1742050800000,
          "temp": 70,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain",
          "detailedForecast": "A slight chance of rain before 2pm, then a chance of rain and a slight chance of thunderstorms between 2pm and 5pm, then a chance of thunderstorms and a chance of rain. Mostly cloudy, with a high near 70. South wind 13 to 21 mph, with gusts as high as 46 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1742076000000,
          "temp": 48,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain and a chance of thunderstorms. Cloudy. Low around 48, with temperatures rising to around 54 overnight. South wind 10 to 18 mph, with gusts as high as 38 mph. Chance of precipitation is 90%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1742119200000,
          "temp": 55,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain. Mostly cloudy. High near 55, with temperatures falling to around 43 in the afternoon. Southwest wind 13 to 16 mph, with gusts as high as 29 mph. Chance of precipitation is 90%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1742162400000,
          "temp": 27,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain then Mostly Cloudy",
          "detailedForecast": "A chance of rain before 8pm. Mostly cloudy, with a low around 27. West northwest wind 8 to 14 mph, with gusts as high as 26 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1742054400000,
          "temp": 66,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Haze",
          "detailedForecast": "Haze before 5pm. Mostly sunny. High near 66, with temperatures falling to around 63 in the afternoon. South wind 15 to 25 mph, with gusts as high as 45 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1742076000000,
          "temp": 30,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Scattered Rain Showers",
          "detailedForecast": "Scattered rain showers after 11pm. Mostly cloudy. Low around 30, with temperatures rising to around 36 overnight. Southwest wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 50%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1742119200000,
          "temp": 32,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Sleet then Snow Showers Likely",
          "detailedForecast": "Scattered rain showers before 7am, then a chance of sleet and scattered snow showers between 7am and 8am, then snow showers likely and sleet likely. Cloudy. High near 32, with temperatures falling to around 26 in the afternoon. Northwest wind 10 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1742162400000,
          "temp": 21,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 8pm. Mostly cloudy, with a low around 21. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1742054400000,
          "temp": 68,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Haze",
          "detailedForecast": "Haze before 5pm. Partly sunny. High near 68, with temperatures falling to around 64 in the afternoon. South wind 15 to 25 mph, with gusts as high as 50 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1742076000000,
          "temp": 32,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Scattered Rain Showers",
          "detailedForecast": "Scattered rain showers after 8pm. Mostly cloudy. Low around 32, with temperatures rising to around 37 overnight. Southwest wind 5 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 50%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1742119200000,
          "temp": 33,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Sleet",
          "detailedForecast": "Scattered rain showers before 7am, then a chance of sleet and scattered rain showers between 7am and 8am, then sleet and rain and snow showers. Cloudy. High near 33, with temperatures falling to around 25 in the afternoon. Northwest wind 5 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1742162400000,
          "temp": 18,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 8pm. Mostly cloudy, with a low around 18. Northwest wind 5 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run ski trail was groomed today, March 9, 2025. Grass has started to show and the north loop of the trail is completely unusable at this time.  The current trail is approximately .5 km.  There is an additional $5 daily trail fee for the use of Bucks Run. Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours. Buck’s Run last day is Sunday, March 9, 2025."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 10",
      "conditions": "Nubs has plenty of coverage , depth , and groom on the upper loops. The sweet spot between hard and soft was 10:30 to 1:00. A little bit of wind debris , but not an issue . LF 8 rilled"
    }
  },
  "nubsNob": {
    "date": "3/15/25- MARDI GRAS",
    "liftsOpen": "At least 7 Lifts, Rope Tow and Space Worm",
    "xcTrails": "Trails are soft today. Expect bare spots especially on the lower trails.",
    "nightSkiing": "Done for the season.",
    "comments": "Happy Mardi Gras! It's a warm and windy day for the Mardi Gras celebration. The lifts will spin from 9 AM to 4:30 PM today. Expect to find soft spring snow on the slopes. Coverage and snow depth on the majority of the terrain is still very good. A few highlights today will be the Steel Drum band at noon, The Soaker Cup at 2:30 PM, and Pete Kehoe with Michelle Chenard in the Winter Garden at 3:30 PM. Pintail Peak Lodge is open today. Come celebrate spring on slopes with all of the WILD ANIMALS here at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 0\"",
      "ytd": "YTD: 135\""
    }
  }
}