{
  "timestamp": "2025-02-21T02:23:01.015Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740103200000,
          "temp": 13,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 13. Northwest wind around 8 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1740135600000,
          "temp": 28,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 28, with temperatures falling to around 26 in the afternoon. West northwest wind around 8 mph."
        },
        {
          "name": "Friday Night",
          "timestamp": 1740178800000,
          "temp": 13,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 13. West southwest wind around 7 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1740222000000,
          "temp": 29,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 29. Southwest wind 7 to 10 mph, with gusts as high as 20 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740103200000,
          "temp": 11,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 10pm. Mostly cloudy. Low around 11, with temperatures rising to around 16 overnight. Northwest wind 0 to 10 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Friday",
          "timestamp": 1740135600000,
          "temp": 26,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 26, with temperatures falling to around 24 in the afternoon. West wind 0 to 10 mph."
        },
        {
          "name": "Friday Night",
          "timestamp": 1740178800000,
          "temp": 16,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 16, with temperatures rising to around 18 overnight. Southwest wind 10 to 15 mph, with gusts as high as 35 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1740222000000,
          "temp": 25,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 7am. Cloudy, with a high near 25. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740103200000,
          "temp": 10,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 10, with temperatures rising to around 14 overnight. Northwest wind 5 to 10 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Friday",
          "timestamp": 1740135600000,
          "temp": 25,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Sunny",
          "detailedForecast": "A slight chance of snow showers before 7am. Mostly sunny, with a high near 25. West wind 5 to 10 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Friday Night",
          "timestamp": 1740178800000,
          "temp": 13,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 13, with temperatures rising to around 15 overnight. Wind chill values as low as 0. Southwest wind 10 to 15 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1740222000000,
          "temp": 24,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 1pm. Mostly cloudy, with a high near 24. Wind chill values as low as 0. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 20, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  For today, February 20, 2025 grooming for classic ski and skate ski will take place on Coyote Run and Hawks Hill while Cedar Trace will be groomed for classic skiing."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be open on 2/22 and 2/23.  Golf course and Shelden Trails are currently groomed.  Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Feb 20",
      "conditions": "World class conditions persist. Entire system was powertilled and tracked again this AM. Huge thanks to the crew at Nubs!"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Feb 20",
      "conditions": "Skated on Coyote Run this afternoon. I stayed on the loop behind Buck’s Run, which was near perfect and, unlike the golf course, the trails were not wind blown because it’s in the woods. Classic tracks looked great also. OK to use A skis. Big thanks to the HM staff for keeping us skiing!"
    }
  },
  "nubsNob": {
    "date": "2/20/25",
    "liftsOpen": "At least 5 lifts, Rope Tow, and the Space Worm",
    "xcTrails": "Trails are open and in great shape. Trails will be power-tilled with a track set again this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It is a perfect mid-winter ski day with over an inch of fresh snow this morning. The snow continues to fall lightly and is sitting on top of the corduroy. Conditions continue to be extremely good. The temperature will also make its way into the 20's today which should feel warm after the cold snap we have been experiencing. The lifts will spin from 9 AM to 9 PM today with an hour break at 4:30 PM to prepare for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 13\"",
      "ytd": "YTD: 127\""
    }
  }
}