{
  "timestamp": "2025-01-18T16:00:46.428Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737212400000,
          "temp": 36,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A chance of snow before noon. Mostly cloudy. High near 36, with temperatures falling to around 26 in the afternoon. North northwest wind 13 to 16 mph, with gusts as high as 26 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737241200000,
          "temp": 13,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 13, with temperatures rising to around 15 overnight. North northwest wind 6 to 12 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1737284400000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 7am. Mostly cloudy. High near 18, with temperatures falling to around 16 in the afternoon. Northwest wind around 8 mph."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1737327600000,
          "temp": 4,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow before 8pm. Mostly cloudy, with a low around 4. Wind chill values as low as -7. West northwest wind around 8 mph."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737216000000,
          "temp": 25,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Cloudy. High near 25, with temperatures falling to around 20 in the afternoon. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737241200000,
          "temp": 10,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 10, with temperatures rising to around 13 overnight. Wind chill values as low as 0. Northwest wind 10 to 15 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737284400000,
          "temp": 15,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. High near 15, with temperatures falling to around 13 in the afternoon. Wind chill values as low as -2. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1737327600000,
          "temp": 3,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 3. Wind chill values as low as -11. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail was groomed for skate and classic skiing yesterday, January 17, 2025.  Due to wet snow conditions no additional grooming will be taking place today, January 18, 2025.  The trail is still open and skiable.  There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Jan 16",
      "conditions": "Perfect conditions for skating and classic on Bucks Run. Golf course is not groomed and no info on whether it will be before the weekend."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Fri, Jan 17",
      "conditions": "Friday am groomed upper and lower trails.   Plans are to groom Saturday and Sunday.  Hero snow, everybody smiling ."
    }
  },
  "nubsNob": {
    "date": "1/18/25",
    "liftsOpen": "All 8 Lifts, Space Worm and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be groomed and tracked again this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM. Extra night session Sunday, January 19 from 5:30 to 9:00 PM as well.",
    "comments": "It should be a great ski day at Nub's Nob. The wind is up this morning but is forecast to lay down as the day goes on. Last night we received a little rain that froze on the snow. The dedicated Grooming Crew power-tilled the slopes two times last night to get the best possible surface for skiing and riding. NASTAR racing is open to the public today from 12:30 to 2:30 PM on Birch Run, please sign-up at the Front Desk. Pete Kehoe will be playing at 3:30 PM. The lifts spin from 9:00 AM to 9:00 PM today with an hour break beginning at 4:30 to prepare for the night session. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 73\""
    }
  }
}