{
  "timestamp": "2026-01-18T06:00:33.968Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768705200000,
          "temp": 14,
          "snowfall": 19,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers before 1am, then a slight chance of snow and a slight chance of snow showers. Mostly cloudy, with a low around 14. Southwest wind around 12 mph, with gusts as high as 24 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Sunday",
          "timestamp": 1768734000000,
          "temp": 24,
          "snowfall": 7,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers. Mostly cloudy. High near 24, with temperatures falling to around 21 in the afternoon. Southwest wind 8 to 12 mph, with gusts as high as 22 mph."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1768777200000,
          "temp": 15,
          "snowfall": 79,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 15, with temperatures rising to around 18 overnight. Southwest wind around 9 mph, with gusts as high as 21 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 20,
          "snowfall": 79,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 20. Wind chill values as low as 0. West southwest wind 9 to 15 mph, with gusts as high as 29 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768712400000,
          "temp": 13,
          "snowfall": 36,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 13, with temperatures rising to around 16 overnight. Northwest wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1768734000000,
          "temp": 22,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Chance Snow Showers then Snow",
          "detailedForecast": "A chance of snow showers before 7am, then snow. Cloudy. High near 22, with temperatures falling to around 20 in the afternoon. South wind 0 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1768777200000,
          "temp": 10,
          "snowfall": 95,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 10, with temperatures rising to around 13 overnight. Wind chill values as low as 0. Southwest wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 15,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow Likely And Areas Of Blowing Snow",
          "detailedForecast": "Snow before 7am, then snow likely and areas of blowing snow. Mostly cloudy, with a high near 15. Wind chill values as low as -10. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768712400000,
          "temp": 12,
          "snowfall": 44,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 12, with temperatures rising to around 14 overnight. West wind around 5 mph. Chance of precipitation is 40%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1768734000000,
          "temp": 22,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers then Light Snow",
          "detailedForecast": "A chance of snow showers before 7am, then snow. Cloudy. High near 22, with temperatures falling to around 19 in the afternoon. Southwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1768777200000,
          "temp": 9,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 9, with temperatures rising to around 12 overnight. Wind chill values as low as -1. Southwest wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 14,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy, with a high near 14. Wind chill values as low as -9. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Jan 17",
      "conditions": "Buck’s Run is groomed for skate and classic with great coverage. Contractor’s Loop was in OK shape with full coverage but had not been groomed today. The trails on the course were wind blown and not groomed today."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Jan 15",
      "conditions": "Skiing is awesome with a 24\" base of natural snow and daily power tilling.  All trails are open.  Save $20 on race registration by registering online at SKIREG.com by 10 pm tonight!"
    }
  },
  "nubsNob": {
    "date": "1/17/26",
    "liftsOpen": "All 8 chairlifts, conveyor and the rope tow.",
    "xcTrails": "Trails will be power-tilled and tracked this morning conditions are excellent.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m. There is a special night skiing session this Sunday from 5:30 to 9:00 p.m.",
    "comments": "It would be difficult to improve the conditions today. Over four inches of new snow fell since yesterday morning and it continued to snow last evening. The snow surface is soft corduroy this morning. All the ski runs, parks, glades, XC trails and snowshoe trails are in premium shape. Pintail Peak Lodge is open with food service and an espresso bar. The soup of the day is white chicken chili. NASTAR racing on Birch Run at 12:30 p.m. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 to groom for night skiing. Make it a great Saturday at Nub's Nob.",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 8\"",
      "sevenDays": "7 days: 15\"",
      "ytd": "YTD: 87\""
    }
  }
}