{
  "timestamp": "2025-12-30T12:00:43.760Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767096000000,
          "temp": 26,
          "snowfall": 34,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1pm, then a chance of snow. Mostly cloudy, with a high near 26. West northwest wind 12 to 15 mph, with gusts as high as 26 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767135600000,
          "temp": 22,
          "snowfall": 86,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 22. West wind 7 to 12 mph, with gusts as high as 21 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1767178800000,
          "temp": 29,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy. High near 29, with temperatures falling to around 27 in the afternoon. West wind 7 to 14 mph, with gusts as high as 28 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1767222000000,
          "temp": 11,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1am. Partly cloudy, with a low around 11. West northwest wind 7 to 15 mph, with gusts as high as 26 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767096000000,
          "temp": 21,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy, with a high near 21. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767135600000,
          "temp": 15,
          "snowfall": 74,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy. Low around 15, with temperatures rising to around 18 overnight. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1767178800000,
          "temp": 19,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. High near 19, with temperatures falling to around 15 in the afternoon. Wind chill values as low as -1. Northwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1767222000000,
          "temp": 10,
          "snowfall": 67,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 10. Wind chill values as low as -5. Northwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767096000000,
          "temp": 20,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy, with a high near 20. Wind chill values as low as -1. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767135600000,
          "temp": 15,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 15. Northwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1767178800000,
          "temp": 18,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 18, with temperatures falling to around 14 in the afternoon. Wind chill values as low as -1. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1767222000000,
          "temp": 7,
          "snowfall": 79,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 7. Wind chill values as low as -6. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run is closed due to poor conditions and wind damage.",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 27",
      "conditions": "Highly variable, but decent conditions this morning for skate and classic. If you're looking to get out and ski, do it this afternoon; the park has already decided to close for tomorrow. Given how thin the snow coverage is it's doubtful they'll be able to reopen until they spread more snow, and based on past practices, that's unlikely to happen until after New Year . But check anyways in case we get lucky."
    }
  },
  "nubsNob": {
    "date": "12/29/25",
    "liftsOpen": "At least 5 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power tilled and tracked this morning.",
    "nightSkiing": "5:30 - 9:00 p.m. tonight",
    "comments": "After a wind hold this afternoon we will open for night skiing. The lifts will spin from 5:30 p.m. to 9:00 p.m. The Grooming Crew is out preparing the slopes and grooming in the fresh snow to improve conditions for this evening. The wind is still up, but is has dropped significantly from this afternoon. Make it a great night at Nub's Nob.",
    "snowData": {
      "daily": "6\" and counting",
      "threeDays": "3 days: 6\"",
      "sevenDays": "7 days: 6\"",
      "ytd": "YTD: 54\""
    }
  }
}