{
  "timestamp": "2025-11-28T12:00:42.793Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1764331200000,
          "temp": 34,
          "snowfall": 7,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 8am. Mostly sunny. High near 34, with temperatures falling to around 32 in the afternoon. West northwest wind 12 to 15 mph, with gusts as high as 26 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1764370800000,
          "temp": 20,
          "snowfall": 7,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers then Partly Cloudy",
          "detailedForecast": "A chance of snow showers before 8pm. Partly cloudy, with a low around 20. West wind 3 to 10 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1764414000000,
          "temp": 34,
          "snowfall": 47,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Mostly Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of snow after 1pm. Mostly cloudy. High near 34, with temperatures falling to around 32 in the afternoon. South southwest wind 2 to 7 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1764457200000,
          "temp": 27,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 27. South southeast wind around 7 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1764331200000,
          "temp": 28,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 1pm, then patchy blowing snow and scattered snow showers. Mostly cloudy, with a high near 28. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764370800000,
          "temp": 21,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Mostly cloudy. Low around 21, with temperatures rising to around 23 overnight. Northwest wind 0 to 15 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1764414000000,
          "temp": 30,
          "snowfall": 47,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1pm, then a chance of snow. Cloudy, with a high near 30. Southeast wind 0 to 5 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1764457200000,
          "temp": 22,
          "snowfall": 97,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 22. East wind around 5 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1764331200000,
          "temp": 27,
          "snowfall": 75,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow. Mostly cloudy. High near 27, with temperatures falling to around 25 in the afternoon. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764370800000,
          "temp": 16,
          "snowfall": 71,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Chance Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "A chance of snow showers and areas of blowing snow. Mostly cloudy, with a low around 16. West wind 0 to 10 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1764414000000,
          "temp": 29,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1pm, then a chance of snow. Cloudy. High near 29, with temperatures falling to around 27 in the afternoon. South wind 0 to 5 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1764457200000,
          "temp": 20,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 20. East wind around 5 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "11/26/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed",
    "nightSkiing": "Begins Dec. 26",
    "comments": "We are going to open the Lodge, General Store, Tune Center, Cafeteria and Pub on Black Friday and Small Business Saturday. Doors will be open from 9:00 – 4:00 both days, with the Michigan-Ohio State game on in the pub. Early season tuning specials run through November 29. Get your skis and boards in soon! The General Store also has many great gift ideas for the skier on your list.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 0\"",
      "ytd": "YTD: 5\""
    }
  }
}