{
  "timestamp": "2025-12-12T18:00:55.464Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765562400000,
          "temp": 29,
          "snowfall": 13,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 29, with temperatures falling to around 26 in the afternoon. Southwest wind around 6 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765580400000,
          "temp": 14,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 7pm. Cloudy. Low around 14, with temperatures rising to around 22 overnight. Southwest wind 3 to 9 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1765623600000,
          "temp": 22,
          "snowfall": 17,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1pm. Mostly cloudy. High near 22, with temperatures falling to around 15 in the afternoon. West wind around 12 mph, with gusts as high as 22 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1765666800000,
          "temp": 4,
          "snowfall": 17,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Partly Cloudy",
          "detailedForecast": "A slight chance of snow before 7pm. Partly cloudy, with a low around 4. Wind chill values as low as -8. West northwest wind around 8 mph, with gusts as high as 18 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765562400000,
          "temp": 30,
          "snowfall": 55,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 2pm, then blowing snow and snow showers likely. Cloudy. High near 30, with temperatures falling to around 27 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765580400000,
          "temp": 10,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Blowing Snow then Snow Showers And Blowing Snow",
          "detailedForecast": "Blowing snow and snow showers likely before 7pm, then snow showers and blowing snow. Mostly cloudy. Low around 10, with temperatures rising to around 12 overnight. Wind chill values as low as -5. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1765623600000,
          "temp": 14,
          "snowfall": 56,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely And Areas Of Blowing Snow then Areas Of Blowing Snow",
          "detailedForecast": "Snow showers likely and areas of blowing snow before 7am, then areas of blowing snow and a chance of snow showers. Mostly cloudy. High near 14, with temperatures falling to around 12 in the afternoon. Wind chill values as low as -7. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1765666800000,
          "temp": 7,
          "snowfall": 69,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 7. Wind chill values as low as -5. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765562400000,
          "temp": 28,
          "snowfall": 37,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 28, with temperatures falling to around 25 in the afternoon. Southwest wind around 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765580400000,
          "temp": 8,
          "snowfall": 82,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Areas Of Blowing Snow then Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Areas of blowing snow and a chance of snow showers before 7pm, then snow showers and areas of blowing snow. Mostly cloudy. Low around 8, with temperatures rising to around 11 overnight. Wind chill values as low as -5. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1765623600000,
          "temp": 12,
          "snowfall": 67,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely and patchy blowing snow. Mostly cloudy. High near 12, with temperatures falling to around 10 in the afternoon. Wind chill values as low as -8. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1765666800000,
          "temp": 4,
          "snowfall": 77,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 4. Wind chill values as low as -8. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "[ ] groomed[ ] golf course is about as good as it gets[ ] Sheldon trails - fair to  good littered with tree parts, though the usual being trod upon[ ] icy patches under trees where not enough snow made it to the groun)d as it got colder and the rain - wet snow turned to ( oops - repost -- rain >>> snow"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "Good skating on Hawks, Coyote and Cedar Trace.  Hawks has  a little scrub sticking up.  But the best it has been so far.   All freshly groomed. No tracks.Thank guys."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "Lots of snow ! Yesterday’s big groomer provided a firm flat skate deck . Today nature provided about 2 inches of fluff . Has to push a little bit , but it was very nice - and the sun came out . LF 7"
    }
  },
  "nubsNob": {
    "date": "12/12/25",
    "liftsOpen": "4 Lifts & the Rope Tow",
    "xcTrails": "All XC trails will be power-tilled and tracked today. Conditions are very good.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Thanks to cold air, natural snow, a beautifully designed snowmaking system, and the diligence of the Snow Farmers we are pleased to announce that over 40 runs are now open. Pintail Peak will open before next weekend. Conditions are very good on all of our groomed terrain. The XC trails are machine groomed with a track. Two creative and fun terrain parks are open. The soup of the day is Clam Chowder. The lifts will spin from 9:00 a.m. to 4:30 p.m. Make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 6\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 33\""
    }
  }
}