{
  "timestamp": "2025-01-21T02:20:14.474Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1737424800000,
          "temp": 1,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 1. Wind chill values as low as -10. West southwest wind 6 to 10 mph, with gusts as high as 20 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1737457200000,
          "temp": 8,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 8, with temperatures falling to around 6 in the afternoon. Wind chill values as low as -10. West wind 6 to 9 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1737500400000,
          "temp": -3,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Partly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Partly cloudy. Low around -3, with temperatures rising to around -1 overnight. Wind chill values as low as -15. Southwest wind around 8 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1737543600000,
          "temp": 16,
          "snowfall": 0,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 16. Wind chill values as low as -14. South southwest wind 6 to 12 mph, with gusts as high as 22 mph. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1737424800000,
          "temp": 4,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Cloudy, with a low around 4. Wind chill values as low as -14. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1737457200000,
          "temp": 10,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Cloudy, with a high near 10. Wind chill values as low as -15. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1737500400000,
          "temp": 4,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy. Low around 4, with temperatures rising to around 10 overnight. Wind chill values as low as -11. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1737543600000,
          "temp": 22,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers before 7am, then snow showers and patchy blowing snow. Cloudy, with a high near 22. Wind chill values as low as -7. South wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail is groomed for skate and classic skiing today, January 20th, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Plenty of lake effect , combined with low 20 degree temps, plus the full big groom this morning , makes Nubs Knob red and blue trails as nice as it gets !"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Jan 20",
      "conditions": "Very nice grooming on Buck’s Run. Classic tracks were deep and firm, although the wind had blown in some debris (oak leaves, pine needles, a few twigs). Still, great gliding on VR30 and some other prior waxes. Tracks were fast despite the extreme cold temps. The skating lane looked nice, it’s wide with just a slight ridge."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    }
  },
  "nubsNob": {
    "date": "1/20/25",
    "liftsOpen": "At least 6 Lifts, Space Worm and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be groomed this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Winter is definitely here and today it's cold and snowy. The Grooming Crew finished their work early this morning and another 2 to 3 inches of light and dry snow landed on the corduroy. Most of the ski area will be covered in this beautiful snow. We sent a couple of cats back out to do a second groom on some of the beginner slopes. The XC trails and snowshoe trails continue to be in great shape. The Lifts will spin from 9 AM to 4:30 PM today. Pintail Peak lodge is open with a deli and an espresso bar. Bundle up and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "3\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 13\"",
      "ytd": "YTD: 76\""
    }
  }
}