{
  "timestamp": "2025-12-28T09:00:37.187Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766912400000,
          "temp": 30,
          "snowfall": 62,
          "snowAmount": "",
          "shortForecast": "Areas Of Fog",
          "detailedForecast": "Areas of fog and a chance of freezing rain before 5am, then rain likely and patchy fog. Cloudy. Low around 30, with temperatures rising to around 32 overnight. Southeast wind around 8 mph. Chance of precipitation is 60%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday",
          "timestamp": 1766919600000,
          "temp": 54,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain likely and patchy fog before 7am, then rain and widespread fog and a chance of thunderstorms. Cloudy. High near 54, with temperatures falling to around 44 in the afternoon. Southeast wind 3 to 8 mph. Chance of precipitation is 100%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766962800000,
          "temp": 26,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Rain then Chance Light Snow",
          "detailedForecast": "Rain and widespread fog and a chance of thunderstorms before 4am, then a chance of snow. Cloudy. Low around 26, with temperatures rising to around 33 overnight. South southwest wind 3 to 21 mph, with gusts as high as 48 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1767006000000,
          "temp": 30,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Light Snow then Snow Showers",
          "detailedForecast": "A chance of snow before 7am, then snow showers. Cloudy, with a high near 30. West wind around 28 mph, with gusts as high as 53 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766912400000,
          "temp": 28,
          "snowfall": 22,
          "snowAmount": "",
          "shortForecast": "Chance Freezing Drizzle",
          "detailedForecast": "A chance of freezing drizzle. Mostly cloudy. Low around 28, with temperatures rising to around 30 overnight. Southeast wind around 5 mph. Chance of precipitation is 20%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday",
          "timestamp": 1766919600000,
          "temp": 35,
          "snowfall": 89,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "A chance of freezing drizzle before 7am, then a chance of freezing rain between 7am and 9am, then a chance of freezing rain and patchy fog between 9am and 11am, then rain showers and a chance of freezing rain. Cloudy. High near 35, with temperatures falling to around 33 in the afternoon. East wind 5 to 10 mph. Chance of precipitation is 90%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766962800000,
          "temp": 18,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Rain showers before 11pm, then freezing rain and rain showers between 11pm and 1am, then freezing rain and a slight chance of snow showers between 1am and 2am, then snow showers and a slight chance of sleet. Cloudy. Low around 18, with temperatures rising to around 24 overnight. Northeast wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 100%. New snow accumulation of 2 to 4 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Monday",
          "timestamp": 1767006000000,
          "temp": 27,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 6 to 10 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 27. North wind 20 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 6 to 10 inches possible. Little or no ice accumulation expected."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766912400000,
          "temp": 26,
          "snowfall": 29,
          "snowAmount": "",
          "shortForecast": "Chance Freezing Drizzle",
          "detailedForecast": "A chance of freezing drizzle. Cloudy, with a low around 26. South wind around 10 mph. Chance of precipitation is 30%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday",
          "timestamp": 1766919600000,
          "temp": 36,
          "snowfall": 88,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "A chance of freezing drizzle and patchy fog before 7am, then freezing rain likely and areas of fog between 7am and 10am, then rain showers and a chance of freezing rain. Cloudy, with a high near 36. Southeast wind 5 to 10 mph. Chance of precipitation is 90%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766962800000,
          "temp": 18,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Rain Showers then Snow Showers",
          "detailedForecast": "Rain showers before 2am, then snow showers. Cloudy. Low around 18, with temperatures rising to around 24 overnight. East wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1767006000000,
          "temp": 27,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 6 to 10 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 27. Northwest wind around 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 6 to 10 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 27",
      "conditions": "Highly variable, but decent conditions this morning for skate and classic. If you're looking to get out and ski, do it this afternoon; the park has already decided to close for tomorrow. Given how thin the snow coverage is it's doubtful they'll be able to reopen until they spread more snow, and based on past practices, that's unlikely to happen until after New Year . But check anyways in case we get lucky."
    }
  },
  "nubsNob": {
    "date": "12/27/25",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails are fully open with a classic track. Snow depth is thin and some dirt spots will be encountered.",
    "nightSkiing": "5:30 - 9:00 p.m. tonight",
    "comments": "It looks like calm weather today with a light breeze. The temperature should hover around freezing. The grooming looks very good this morning. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break from 4:30 to 5:30 p.m. to groom for night skiing. The soup of the day is andouille sweet potato. Pintail Peak Lodge is open with food and an espresso bar. Myk Rise will play the Nub's Pub this afternoon. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 1\"",
      "ytd": "YTD: 48\""
    }
  }
}