{
  "timestamp": "2025-12-20T13:07:47.687Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1766235600000,
          "temp": 38,
          "snowfall": 18,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 4pm. Mostly cloudy, with a high near 38. South southwest wind 13 to 17 mph, with gusts as high as 36 mph. Chance of precipitation is 20%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1766271600000,
          "temp": 17,
          "snowfall": 18,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain then Partly Cloudy",
          "detailedForecast": "A slight chance of rain before 7pm. Partly cloudy. Low around 17, with temperatures rising to around 22 overnight. West wind 13 to 18 mph, with gusts as high as 36 mph. Chance of precipitation is 20%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1766314800000,
          "temp": 27,
          "snowfall": 3,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 27, with temperatures falling to around 25 in the afternoon. West northwest wind 7 to 15 mph, with gusts as high as 26 mph."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766358000000,
          "temp": 16,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear, with a low around 16. West southwest wind around 5 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1766235600000,
          "temp": 33,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 3pm, then a chance of snow showers and patchy blowing snow. Cloudy. High near 33, with temperatures falling to around 30 in the afternoon. Southwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1766271600000,
          "temp": 14,
          "snowfall": 28,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Patchy Blowing Snow then Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow before 7pm, then a chance of snow showers and patchy blowing snow between 7pm and 1am, then patchy blowing snow and a slight chance of snow showers. Mostly cloudy. Low around 14, with temperatures rising to around 17 overnight. Wind chill values as low as -3. West wind 20 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1766314800000,
          "temp": 23,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7am. Mostly cloudy, with a high near 23. Wind chill values as low as -1. West wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766358000000,
          "temp": 18,
          "snowfall": 11,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 18. Southwest wind around 10 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1766235600000,
          "temp": 33,
          "snowfall": 76,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 4pm. Mostly cloudy. High near 33, with temperatures falling to around 29 in the afternoon. Southwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1766271600000,
          "temp": 12,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely and patchy blowing snow after 7pm. Mostly cloudy. Low around 12, with temperatures rising to around 14 overnight. Wind chill values as low as -5. West wind 15 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1766314800000,
          "temp": 20,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1pm. Mostly cloudy, with a high near 20. Wind chill values as low as -3. West wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766358000000,
          "temp": 12,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 12. Southwest wind 5 to 10 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Dec 16",
      "conditions": "All trails power-tilled flat with a classic track and wide skate deck. Conditions are very good."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Dec 19",
      "conditions": "There was a tree down blocking most of the trail at around 3:30.  Marv, Vasili and I cleared most of it. Otherwise, the trail in the woods was great, pretty fast. No connector. Had to walk across the golf course"
    }
  },
  "nubsNob": {
    "date": "12/20/25",
    "liftsOpen": "At least 7 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power-tilled and tracked this morning.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Pintail peak and the Big Terrain Park are now open! Only the glades are closed this morning.  Conditions should be very good today the couple of inches of snow from yesterday was tilled into the base. Pintail Peak Lodge is open with food and an espresso bar. The soup of the day is navy bean and ham. NASTAR racing begins at 12:30 on Birch Run. The XC trails will be power-tilled this morning. The snowshoe trails are open. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 2\"",
      "sevenDays": "7 days: 10\"",
      "ytd": "YTD: 47\""
    }
  }
}