{
  "timestamp": "2026-01-08T19:02:01.363Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767898800000,
          "temp": 47,
          "snowfall": 5,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 47, with temperatures falling to around 43 in the afternoon. South southeast wind around 9 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1767913200000,
          "temp": 46,
          "snowfall": 95,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers after 7pm. Cloudy. Low around 46, with temperatures rising to around 54 overnight. South southeast wind 10 to 16 mph, with gusts as high as 32 mph. Chance of precipitation is 100%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1767956400000,
          "temp": 58,
          "snowfall": 95,
          "snowAmount": "",
          "shortForecast": "Rain Showers then Light Rain Likely",
          "detailedForecast": "Rain showers before 7am, then rain likely. Mostly cloudy. High near 58, with temperatures falling to around 45 in the afternoon. West southwest wind 16 to 25 mph, with gusts as high as 40 mph. Chance of precipitation is 100%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1767999600000,
          "temp": 32,
          "snowfall": 22,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain then Mostly Cloudy",
          "detailedForecast": "A slight chance of rain before 7pm. Mostly cloudy, with a low around 32. North wind 1 to 14 mph, with gusts as high as 23 mph. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767898800000,
          "temp": 43,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 43. South wind around 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1767913200000,
          "temp": 39,
          "snowfall": 98,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain between 7pm and 9pm, then rain and patchy fog between 9pm and 1am, then rain showers likely and patchy fog. Cloudy. Low around 39, with temperatures rising to around 43 overnight. Southeast wind 10 to 15 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1767956400000,
          "temp": 44,
          "snowfall": 86,
          "snowAmount": "",
          "shortForecast": "Rain And Snow Showers",
          "detailedForecast": "Rain showers and patchy fog before 11am, then rain and snow showers between 11am and 4pm. Cloudy. High near 44, with temperatures falling to around 33 in the afternoon. West wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%."
        },
        {
          "name": "Friday Night",
          "timestamp": 1767999600000,
          "temp": 24,
          "snowfall": 5,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 24. West wind 0 to 15 mph, with gusts as high as 25 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767898800000,
          "temp": 43,
          "snowfall": 11,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 43. South wind 10 to 15 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1767913200000,
          "temp": 39,
          "snowfall": 95,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain between 7pm and 9pm, then rain and patchy fog between 9pm and 1am, then rain showers likely and patchy fog. Cloudy. Low around 39, with temperatures rising to around 44 overnight. South wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1767956400000,
          "temp": 45,
          "snowfall": 78,
          "snowAmount": "",
          "shortForecast": "Rain Showers then Snow Showers",
          "detailedForecast": "Rain showers and patchy fog before noon, then snow showers between noon and 4pm. Cloudy. High near 45, with temperatures falling to around 32 in the afternoon. West wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%."
        },
        {
          "name": "Friday Night",
          "timestamp": 1767999600000,
          "temp": 22,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 22. North wind 0 to 15 mph, with gusts as high as 30 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Jan 7",
      "conditions": "Frosty Freestyle and Krazy Klassic races this coming weekend??????As David Glasgow Farragut said in the battle of 1864 Battle of Mobile Bay: \"Damn the torpedoes ... full speed ahead.\" Yes, we running our races! We fully expect the Buck's Run to survive the weather. The trail has a solid ice base and the could ground is keeping it frozen. There are also piles of man-made snow ready for action. The course WILL, however, start in the woods on Buck's Run. The loop will be one mile. The longer race will be 6 laps (I can't count any higher), and the short race will be 3 laps, both days. Are we Krazy? Of course we are! But the race must go on.Chip timing.Prizes from Hammer Nutrition and Dough Mom's for everyone. Special awards for age group and overall winners. Four Toko bags and two cooler bags/backpacks for door prizes. Lunch for everyone!Be Krazy! Talk about this weekend for years to come!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Jan 5",
      "conditions": "All loops are far better than they need to be for Wonderful Skiing !"
    }
  },
  "nubsNob": {
    "date": "1/8/26",
    "liftsOpen": "5 chairlifts and the rope tow",
    "xcTrails": "Trails are in great shape with a classic track. We will not groom today with the warm temperature.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "It looks like a comfortable day to ski at Nub's Nob with the temperature in the upper 30's. Expect a firm snow this morning, but not icy. This firm snow should become soft by the afternoon. Some rain is forecast for late this evening. Coverage on all of our runs continues to be very good. Harbor Springs High School will host a ski meet on Smokey and Valley late this afternoon. The soup of the day is beef barley. Pintail Peak Lodge is open with food and an espresso bar. The lifts will spin from 9 a.m. to 9 p.m. with an hour break starting at 4:30 p.m. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 13\"",
      "ytd": "YTD: 72\""
    }
  }
}