{
  "timestamp": "2025-12-31T11:00:49.872Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767178800000,
          "temp": 29,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy. High near 29, with temperatures falling to around 27 in the afternoon. West wind 6 to 14 mph, with gusts as high as 29 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767222000000,
          "temp": 9,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1am. Partly cloudy, with a low around 9. Wind chill values as low as -3. West northwest wind 9 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "New Year's Day",
          "timestamp": 1767265200000,
          "temp": 21,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 21. Wind chill values as low as -2. West wind 7 to 10 mph, with gusts as high as 20 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1767308400000,
          "temp": 16,
          "snowfall": 15,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow between 7pm and 1am. Mostly cloudy, with a low around 16. West southwest wind around 7 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767178800000,
          "temp": 20,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 20, with temperatures falling to around 16 in the afternoon. Wind chill values as low as 0. Northwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767222000000,
          "temp": 10,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 10. Wind chill values as low as -5. Northwest wind around 15 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "New Year's Day",
          "timestamp": 1767265200000,
          "temp": 18,
          "snowfall": 55,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. High near 18, with temperatures falling to around 16 in the afternoon. Wind chill values as low as -5. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1767308400000,
          "temp": 13,
          "snowfall": 49,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 13. Wind chill values as low as 0. West wind around 15 mph, with gusts as high as 25 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767178800000,
          "temp": 19,
          "snowfall": 95,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 19, with temperatures falling to around 14 in the afternoon. Wind chill values as low as -1. Northwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767222000000,
          "temp": 7,
          "snowfall": 94,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 7. Wind chill values as low as -7. Northwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "New Year's Day",
          "timestamp": 1767265200000,
          "temp": 16,
          "snowfall": 75,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 16. Wind chill values as low as -8. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1767308400000,
          "temp": 10,
          "snowfall": 67,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 10. Wind chill values as low as 0. West wind around 10 mph, with gusts as high as 25 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run is closed due to poor conditions and wind damage.",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 27",
      "conditions": "Highly variable, but decent conditions this morning for skate and classic. If you're looking to get out and ski, do it this afternoon; the park has already decided to close for tomorrow. Given how thin the snow coverage is it's doubtful they'll be able to reopen until they spread more snow, and based on past practices, that's unlikely to happen until after New Year . But check anyways in case we get lucky."
    }
  },
  "nubsNob": {
    "date": "12/30/25",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power tilled and tracked this morning.",
    "nightSkiing": "5:30 - 9:00 p.m. tonight",
    "comments": "The gift of yesterday's winter storm will be unwrapped by skiers and snowboarders today. The wind is calming down and about a foot of new snow is here to welcome you back to the slopes. Every run, glade, park, and XC trail are now open and in mid-winter condition. The soup of the day is polish sausage sauerkraut. Pintail Peak Lodge is open with food service and an espresso bar. The lifts will spin from 9:00 a.m. to 9:00 p.m. today with an hour break at 4:30 to allow for a groom before the night ski. Welcome back to winter and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 10\"",
      "sevenDays": "7 days: 10\"",
      "ytd": "YTD: 58\""
    }
  }
}