{
  "timestamp": "2025-11-26T17:00:41.605Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764176400000,
          "temp": 50,
          "snowfall": 55,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely after 1pm. Cloudy. High near 50, with temperatures falling to around 37 in the afternoon. Southwest wind 24 to 29 mph, with gusts as high as 46 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764198000000,
          "temp": 30,
          "snowfall": 65,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy, with a low around 30. West southwest wind 20 to 24 mph, with gusts as high as 48 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thanksgiving Day",
          "timestamp": 1764241200000,
          "temp": 36,
          "snowfall": 43,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy. High near 36, with temperatures falling to around 34 in the afternoon. West wind 18 to 22 mph, with gusts as high as 37 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1764284400000,
          "temp": 26,
          "snowfall": 43,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow before 1am. Mostly cloudy, with a low around 26. West northwest wind 13 to 17 mph, with gusts as high as 35 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764176400000,
          "temp": 41,
          "snowfall": 58,
          "snowAmount": "",
          "shortForecast": "Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers before 3pm, then a chance of rain and snow showers between 3pm and 4pm, then a chance of rain and snow showers between 4pm and 5pm, then a chance of rain and snow showers. Cloudy. High near 41, with temperatures falling to around 36 in the afternoon. South wind 10 to 15 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764198000000,
          "temp": 28,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Rain and snow showers before 8pm, then rain and snow showers between 8pm and 9pm, then patchy blowing snow and rain and snow showers between 9pm and 10pm, then blowing snow and rain and snow showers. Cloudy, with a low around 28. Northwest wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thanksgiving Day",
          "timestamp": 1764241200000,
          "temp": 32,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers and blowing snow. Cloudy. High near 32, with temperatures falling to around 30 in the afternoon. Northwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1764284400000,
          "temp": 24,
          "snowfall": 97,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow. Cloudy, with a low around 24. Northwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764176400000,
          "temp": 40,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1pm, then a chance of rain and snow showers. Cloudy. High near 40, with temperatures falling to around 34 in the afternoon. Southwest wind around 10 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764198000000,
          "temp": 26,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers before 9pm, then rain and snow showers between 9pm and 10pm, then snow showers and blowing snow. Cloudy, with a low around 26. West wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Thanksgiving Day",
          "timestamp": 1764241200000,
          "temp": 31,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 5 to 9 inches possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers and blowing snow. Cloudy. High near 31, with temperatures falling to around 28 in the afternoon. Northwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 5 to 9 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1764284400000,
          "temp": 22,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 22. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "11/19/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The Snow Crew turned the guns on last night. Despite some cold temperatures in the area the conditions at Nub's Nob allowed for only a few hours of quality snowmaking. The team is here around the clock, ready for the next opportunity. At this point it looks like there is a turn toward colder weather right around Thanksgiving. We will continue to update the blog to keep you up to date. Think COLD and SNOW.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 5\"",
      "ytd": "YTD: 5\""
    }
  }
}