{
  "timestamp": "2025-04-02T06:00:33.858Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1743573600000,
          "temp": 33,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a low around 33. East wind around 10 mph, with gusts as high as 23 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1743588000000,
          "temp": 64,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely then Showers And Thunderstorms",
          "detailedForecast": "Snow showers likely between 7am and 10am, then rain showers between 10am and 11am, then showers and thunderstorms. Cloudy. High near 64, with temperatures falling to around 52 in the afternoon. East southeast wind 12 to 15 mph, with gusts as high as 26 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1743631200000,
          "temp": 53,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms. Cloudy. Low around 53, with temperatures rising to around 61 overnight. South southwest wind 10 to 14 mph, with gusts as high as 26 mph. Chance of precipitation is 100%. New rainfall amounts between 1 and 2 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1743674400000,
          "temp": 65,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely then Partly Sunny",
          "detailedForecast": "Rain showers likely before 8am. Partly sunny, with a high near 65. West southwest wind 9 to 15 mph, with gusts as high as 26 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1743573600000,
          "temp": 24,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 5am. Cloudy. Low around 24, with temperatures rising to around 27 overnight. East wind 10 to 15 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1743588000000,
          "temp": 40,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 1pm, then snow showers and freezing rain between 1pm and 5pm, then showers and thunderstorms. Cloudy. High near 40, with temperatures falling to around 32 in the afternoon. East wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1743631200000,
          "temp": 35,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms before 2am. Mostly cloudy. Low around 35, with temperatures rising to around 42 overnight. South wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday",
          "timestamp": 1743674400000,
          "temp": 41,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 41. Southwest wind 15 to 20 mph, with gusts as high as 40 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1743573600000,
          "temp": 20,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 20, with temperatures rising to around 26 overnight. Southeast wind around 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1743588000000,
          "temp": 40,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 11am, then snow showers and freezing rain and a slight chance of sleet between 11am and 4pm, then freezing rain and a slight chance of snow showers between 4pm and 5pm, then showers and thunderstorms. Cloudy. High near 40, with temperatures falling to around 32 in the afternoon. Southeast wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1743631200000,
          "temp": 35,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms before 2am. Mostly cloudy. Low around 35, with temperatures rising to around 44 overnight. South wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday",
          "timestamp": 1743674400000,
          "temp": 42,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 42. West wind 15 to 20 mph, with gusts as high as 40 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "Closed due to a widespread power outage and major ice storm.",
    "liftsOpen": "0",
    "xcTrails": "Closed for the season due to many down trees.",
    "nightSkiing": "Done for the season.",
    "comments": "We are closed due to a widespread power outage. A major ice\nstorm has brought down thousands of trees in the area. It looks like power will not return for at least a few days. Updates will be posted here. Please stay safe and do not attempt to travel to Nub's Nob until it is safe to do so.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 150\""
    }
  }
}