{
  "timestamp": "2025-01-23T08:00:42.606Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737615600000,
          "temp": 12,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Cloudy. Low around 12, with temperatures rising to around 16 overnight. South southwest wind around 9 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1737630000000,
          "temp": 26,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow before 1pm, then a slight chance of snow showers. Cloudy. High near 26, with temperatures falling to around 24 in the afternoon. West southwest wind around 9 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1737673200000,
          "temp": 9,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Partly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Partly cloudy. Low around 9, with temperatures rising to around 11 overnight. West northwest wind around 7 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1737716400000,
          "temp": 23,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 23. West southwest wind 2 to 6 mph."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737615600000,
          "temp": 17,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 17, with temperatures rising to around 21 overnight. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1737630000000,
          "temp": 23,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Partly sunny. High near 23, with temperatures falling to around 20 in the afternoon. North wind 10 to 15 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1737673200000,
          "temp": 12,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 12, with temperatures rising to around 16 overnight. Northwest wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1737716400000,
          "temp": 23,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1pm. Mostly cloudy, with a high near 23. Southwest wind 5 to 15 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 22, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Jan 22",
      "conditions": "Excellent day out classic skiing on skins.  Tracks very good and fast most of the way around in the woods except for a few shallow spots but not down to the dirt.  Tracks blown in on connector with the wind.  Snow gun was running today also."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Plenty of lake effect , combined with low 20 degree temps, plus the full big groom this morning , makes Nubs Knob red and blue trails as nice as it gets !"
    }
  },
  "nubsNob": {
    "date": "1/22/25",
    "liftsOpen": "5 Lifts and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be packed this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a cold start to the morning, but a Southerly wind should bring the temperature up to around 20 degrees by the afternoon. The snow is in great shape today. We received 3 inches of snow yesterday and all that new snow is now groomed into the base. Expect a slower snow with exceptional grip today. The lifts will spin from 9 AM to 9 PM today with an hour break at 430 PM to prepare for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "3\"",
      "threeDays": "3 days: 10\"",
      "sevenDays": "7 days: 14\"",
      "ytd": "YTD: 83\""
    }
  }
}