{
  "timestamp": "2025-01-17T19:00:49.460Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737140400000,
          "temp": 36,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 36. South wind around 17 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1737154800000,
          "temp": 29,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow between 11pm and 2am, then rain and snow between 2am and 3am, then rain and snow between 3am and 5am, then rain and snow. Mostly cloudy. Low around 29, with temperatures rising to around 34 overnight. South southwest wind 9 to 17 mph, with gusts as high as 31 mph. Chance of precipitation is 100%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737198000000,
          "temp": 34,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain And Snow then Cloudy",
          "detailedForecast": "Rain and snow before noon. Cloudy. High near 34, with temperatures falling to around 24 in the afternoon. West wind 8 to 15 mph, with gusts as high as 23 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737241200000,
          "temp": 11,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1am. Mostly cloudy, with a low around 11. Northwest wind 5 to 13 mph, with gusts as high as 18 mph."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737140400000,
          "temp": 39,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 4pm, then a chance of rain showers between 4pm and 5pm, then a chance of snow showers. Cloudy, with a high near 39. Southwest wind around 20 mph, with gusts as high as 35 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737154800000,
          "temp": 20,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers before 10pm, then a chance of rain and snow showers. Cloudy. Low around 20, with temperatures rising to around 26 overnight. West wind around 20 mph, with gusts as high as 35 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737198000000,
          "temp": 23,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. High near 23, with temperatures falling to around 18 in the afternoon. Northwest wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737241200000,
          "temp": 8,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 8. Wind chill values as low as -1. Northwest wind around 15 mph, with gusts as high as 25 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 17, 2025.  There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Trails were unable to be groomed today, January 17, 2025 due to limited snowfall.  You are always welcome to come out and blaze your own trail."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Jan 16",
      "conditions": "Perfect conditions for skating and classic on Bucks Run. Golf course is not groomed and no info on whether it will be before the weekend."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 11",
      "conditions": "Best conditions of the year on the upper Red and Blue loops ! Thank you Mother Nature , Nubs Nob , and John Baker . It was like skiing on butter ."
    }
  },
  "nubsNob": {
    "date": "1/17/25",
    "liftsOpen": "7 Lifts, Space Worm and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be power-tilled and tracked again this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM. Extra night session Sunday, January 19 from 5:30 to 9:00 PM as well.",
    "comments": "All of the natural snow we received this week has been meticulously tilled into the base, and the result is nothing at which to shake a stick. We strongly advise gearing up and getting out for what should be a fantastic weekend on the snow. The lifts spin today from 9:00 AM to 9:00 PM today with an hour break beginning at 4:30 to prepare for the night session. Make it a grand day at Nub's Nob.",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 17\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 73\""
    }
  }
}