{
  "timestamp": "2025-12-04T05:00:42.622Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764824400000,
          "temp": 16,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Isolated Snow Showers",
          "detailedForecast": "Isolated snow showers before 1am. Mostly cloudy. Low around 16, with temperatures rising to around 20 overnight. West northwest wind around 13 mph, with gusts as high as 23 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1764846000000,
          "temp": 22,
          "snowfall": 3,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 22, with temperatures falling to around 19 in the afternoon. West northwest wind 7 to 14 mph, with gusts as high as 24 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1764889200000,
          "temp": 9,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 9. Southwest wind around 5 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1764932400000,
          "temp": 27,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 27. South southwest wind 6 to 9 mph, with gusts as high as 18 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764824400000,
          "temp": 12,
          "snowfall": 37,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Mostly cloudy, with a low around 12. Wind chill values as low as -4. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1764846000000,
          "temp": 20,
          "snowfall": 37,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 1pm. Mostly cloudy. High near 20, with temperatures falling to around 18 in the afternoon. Wind chill values as low as -5. West wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1764889200000,
          "temp": 17,
          "snowfall": 48,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 7pm. Mostly cloudy. Low around 17, with temperatures rising to around 21 overnight. Wind chill values as low as -1. Southwest wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1764932400000,
          "temp": 28,
          "snowfall": 74,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a high near 28. Southwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764824400000,
          "temp": 9,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 9. Wind chill values as low as -8. Northwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1764846000000,
          "temp": 17,
          "snowfall": 38,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1pm. Mostly cloudy. High near 17, with temperatures falling to around 14 in the afternoon. Wind chill values as low as -7. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1764889200000,
          "temp": 10,
          "snowfall": 26,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 1am. Mostly cloudy. Low around 10, with temperatures rising to around 17 overnight. Wind chill values as low as -5. Southwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1764932400000,
          "temp": 25,
          "snowfall": 58,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 25. Wind chill values as low as 0. Southwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Nubs Nob is not yet open for its down hill program : coming this weekend . But the groomers jumped the gun on the Nordic Trails . Access through Valley road to the red and blue loops are currently primo !"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 3",
      "conditions": "Classic skied cedar trace (loop behind bucks run) . Shallow tracks present more or less. Glide was fast, good grip too but I double poled mostly. Clean snow apart from some dried leaves on a stretch. I used good skis, glide wax was extra cold blue followed by red."
    }
  },
  "nubsNob": {
    "date": "12/03/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Trails are being packed today. Not open for skiing as we prepare trails.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob will open this December 6 and 7 for skiing and riding. We anticipate having 12 runs open which includes almost every run on our frontside with the exception of Scarface, Chute and Twilight Zone. We plan to have at least 3 chairlifts open along with the rope tow. The lifts will spin from 9 AM to 4:30 PM. See you on Saturday! We will be open daily for skiing and riding beginning on December 12.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 19\"",
      "ytd": "YTD: 24\""
    }
  }
}