{
  "timestamp": "2025-11-26T10:00:47.881Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764151200000,
          "temp": 41,
          "snowfall": 75,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain. Mostly cloudy. Low around 41, with temperatures rising to around 46 overnight. South southwest wind around 7 mph. Chance of precipitation is 80%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 48,
          "snowfall": 75,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Rain then Rain And Snow Likely",
          "detailedForecast": "Rain before 7am, then rain and snow likely. Mostly cloudy. High near 48, with temperatures falling to around 35 in the afternoon. Southwest wind 8 to 23 mph, with gusts as high as 41 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 30,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Rain And Snow Likely",
          "detailedForecast": "Rain and snow likely. Cloudy, with a low around 30. West southwest wind 20 to 23 mph, with gusts as high as 45 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thanksgiving Day",
          "timestamp": 1764241200000,
          "temp": 36,
          "snowfall": 43,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy, with a high near 36. West wind 18 to 22 mph, with gusts as high as 37 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764151200000,
          "temp": 40,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely and patchy fog. Cloudy. Low around 40, with temperatures rising to around 43 overnight. Southeast wind around 10 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 43,
          "snowfall": 72,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely then Rain And Snow Showers Likely",
          "detailedForecast": "Rain showers likely and patchy fog before 3pm, then rain and snow showers likely. Cloudy. High near 43, with temperatures falling to around 37 in the afternoon. South wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 27,
          "snowfall": 94,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Areas Of Blowing Snow",
          "detailedForecast": "Rain and snow showers before 8pm, then areas of blowing snow and rain and snow showers between 8pm and 9pm, then areas of blowing snow and rain and snow showers. Cloudy, with a low around 27. Northwest wind 10 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thanksgiving Day",
          "timestamp": 1764241200000,
          "temp": 32,
          "snowfall": 97,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow. Cloudy, with a high near 32. Northwest wind around 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764151200000,
          "temp": 39,
          "snowfall": 58,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely and patchy fog. Cloudy. Low around 39, with temperatures rising to around 42 overnight. South wind around 10 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 42,
          "snowfall": 78,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely then Rain And Snow Showers",
          "detailedForecast": "Rain showers likely and patchy fog before 2pm, then rain and snow showers. Cloudy. High near 42, with temperatures falling to around 35 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 25,
          "snowfall": 95,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Rain and snow showers before 9pm, then snow showers and areas of blowing snow. Cloudy. Low around 25, with temperatures rising to around 27 overnight. West wind 10 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Thanksgiving Day",
          "timestamp": 1764241200000,
          "temp": 31,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow. Cloudy, with a high near 31. Northwest wind 20 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "11/19/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The Snow Crew turned the guns on last night. Despite some cold temperatures in the area the conditions at Nub's Nob allowed for only a few hours of quality snowmaking. The team is here around the clock, ready for the next opportunity. At this point it looks like there is a turn toward colder weather right around Thanksgiving. We will continue to update the blog to keep you up to date. Think COLD and SNOW.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 5\"",
      "ytd": "YTD: 5\""
    }
  }
}