{
  "timestamp": "2025-03-28T16:00:36.720Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1743177600000,
          "temp": 63,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of rain showers before 2pm, then a chance of showers and thunderstorms between 2pm and 5pm, then a chance of showers and thunderstorms. Mostly cloudy, with a high near 63. South wind around 10 mph, with gusts as high as 20 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1743199200000,
          "temp": 56,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms then Partly Cloudy",
          "detailedForecast": "A chance of showers and thunderstorms before 8pm. Partly cloudy. Low around 56, with temperatures rising to around 58 overnight. Southwest wind 9 to 14 mph, with gusts as high as 28 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1743242400000,
          "temp": 71,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Partly Sunny then Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of rain showers between 2pm and 5pm, then a chance of showers and thunderstorms. Partly sunny. High near 71, with temperatures falling to around 67 in the afternoon. West southwest wind 12 to 16 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1743285600000,
          "temp": 46,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms then Light Rain",
          "detailedForecast": "A chance of showers and thunderstorms before 8pm, then rain. Cloudy, with a low around 46. East wind 6 to 10 mph, with gusts as high as 20 mph. Chance of precipitation is 90%. New rainfall amounts between a quarter and half of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1743177600000,
          "temp": 38,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers. Cloudy, with a high near 38. East wind around 10 mph. Chance of precipitation is 90%. Little or no ice accumulation expected."
        },
        {
          "name": "Tonight",
          "timestamp": 1743199200000,
          "temp": 30,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Rain showers before 8pm, then showers and thunderstorms. Cloudy. Low around 30, with temperatures rising to around 33 overnight. East wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. Little or no ice accumulation expected."
        },
        {
          "name": "Saturday",
          "timestamp": 1743242400000,
          "temp": 32,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Freezing rain and a slight chance of thunderstorms before 7am, then freezing rain and showers and thunderstorms. Cloudy. High near 32, with temperatures falling to around 30 in the afternoon. East wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New ice accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1743285600000,
          "temp": 29,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Freezing rain. Cloudy, with a low around 29. East wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New ice accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1743177600000,
          "temp": 42,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Rain showers before 5pm, then showers and thunderstorms. Mostly cloudy. High near 42, with temperatures falling to around 40 in the afternoon. Southeast wind around 10 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1743199200000,
          "temp": 31,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms. Cloudy. Low around 31, with temperatures rising to around 35 overnight. East wind around 10 mph. Chance of precipitation is 90%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1743242400000,
          "temp": 34,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Showers and thunderstorms before 8am, then freezing rain and rain and a chance of thunderstorms between 8am and 5pm, then freezing rain and rain and sleet likely. Cloudy. High near 34, with temperatures falling to around 31 in the afternoon. East wind 10 to 15 mph. Chance of precipitation is 90%. Little or no ice accumulation expected."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1743285600000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Freezing rain and rain and sleet likely. Cloudy, with a low around 28. East wind around 10 mph. Chance of precipitation is 90%. New ice accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 24",
      "conditions": "Nubs with over a foot of snow since Thursday. Upper loops powertilled and tracked again Monday AM. Mid-winter type conditions should continue through the weekend."
    }
  },
  "nubsNob": {
    "date": "3/28/25",
    "liftsOpen": "5 lifts, Rope Tow and Space Worm.",
    "xcTrails": "Trails were groomed on Tuesday morning. Expect firm snow in the morning that will transition to softer snow late in the day.",
    "nightSkiing": "Done for the season.",
    "comments": "The wet snow from yesterday has firmed up overnight. Expect hard snow this morning that will soften around noon. The best skiing this morning is back on Pintail Peak as that was groomed last. The wind is up from the East today. Coverage on all of our snowmaking runs continues to be very good. Pintail Peak Lodge is open with an espresso bar. The lifts will spin from 9:00 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 150\""
    }
  }
}