{
  "timestamp": "2025-02-25T13:05:36.826Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1740488400000,
          "temp": 47,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain",
          "detailedForecast": "A slight chance of rain before 1pm. Partly sunny. High near 47, with temperatures falling to around 44 in the afternoon. West northwest wind around 6 mph. Chance of precipitation is 20%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1740524400000,
          "temp": 29,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 29. West wind around 3 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1740567600000,
          "temp": 39,
          "snowfall": 70,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Rain And Snow Likely",
          "detailedForecast": "A slight chance of snow between 10am and 11am, then rain and snow likely. Cloudy, with a high near 39. South wind 2 to 7 mph. Chance of precipitation is 70%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740610800000,
          "temp": 35,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Rain Likely",
          "detailedForecast": "Rain likely. Cloudy, with a low around 35. Southwest wind around 6 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1740488400000,
          "temp": 38,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of freezing drizzle and a slight chance of drizzle before 9am, then a slight chance of snow showers between 9am and 10am. Mostly cloudy. High near 38, with temperatures falling to around 35 in the afternoon. Northwest wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1740524400000,
          "temp": 22,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 22, with temperatures rising to around 25 overnight. Southwest wind 0 to 5 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1740567600000,
          "temp": 36,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow between 7am and 11am, then a chance of rain and snow. Cloudy, with a high near 36. Southeast wind around 5 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740610800000,
          "temp": 29,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow",
          "detailedForecast": "A chance of rain and snow. Mostly cloudy, with a low around 29. North wind around 5 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1740488400000,
          "temp": 40,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 40, with temperatures falling to around 36 in the afternoon. Northwest wind 5 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1740524400000,
          "temp": 20,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 20, with temperatures rising to around 23 overnight. Southwest wind 0 to 5 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1740567600000,
          "temp": 36,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow between 7am and noon, then a chance of rain and snow. Cloudy. High near 36, with temperatures falling to around 34 in the afternoon. Southeast wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740610800000,
          "temp": 27,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow",
          "detailedForecast": "A chance of rain and snow. Mostly cloudy, with a low around 27. Northeast wind around 5 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be open on 2/22 and 2/23.  Golf course and Shelden Trails are currently groomed.  Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will have snow added and be groomed for skate and classic skiing today, February 24, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Coyote Run and Cedar Trace were last groomed February 22, 2025 for classic ski and skate ski. Due to deteriorating conditions Hawk Hills will not be groomed today."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Feb 24",
      "conditions": "Wanted to ski at Kensington because the site said they groomed the skate lanes today. I appreciate the staff doing this, but after the sun and temps today it was a slush bucket this afternoon. Ended up on Buck’s which matched the earlier comment. Still in great shape but a bit soft in spots. Enjoy it while you can!"
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Sat, Feb 22",
      "conditions": "Skied Stony Creek late in the afternoon on Friday 2/21.  The Golf Course trails to the East of the parking lot was rolled and classic tracks groomed.  They generally groom early on Saturdays for weekend visitors.  Snow was equal to the best you will see in SE lower MI.  Did not ski the trails in the woods West of the parking lot.The park closes at 8:00 PM, so it might be possible to get in some night skiing.  Warmer temps and rain are coming.  Enjoy Stony Creek NOW>"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 24",
      "conditions": "Lovely blue sky Spring skiing on the Red and Blue loops today . Surprisingly little wind debris . The trail and groom is holding well.  The skate had a bit of suck : but I had rilled and LF 8 worked well."
    }
  },
  "nubsNob": {
    "date": "2/25/25",
    "liftsOpen": "5 lifts and the Rope Tow",
    "xcTrails": "All trails were groomed and tracked on Sunday. Expect softer snow conditions today.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a very comfortable ski day at Nub's with a high temperature expected to reach near 40 degrees. The snow never froze last night so a loose softer snow is to be expected today. Conditions are still very good. Pintail Peak Lodge is open with a deli and an espresso bar until 3:30 PM. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 PM to groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 7\"",
      "ytd": "YTD: 128\""
    }
  }
}