{
  "timestamp": "2025-01-22T09:00:39.213Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737536400000,
          "temp": -4,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear, with a low around -4. Wind chill values as low as -17. South southwest wind around 7 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1737543600000,
          "temp": 15,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 4pm. Mostly cloudy. High near 15, with temperatures falling to around 13 in the afternoon. Wind chill values as low as -18. South southwest wind 7 to 14 mph, with gusts as high as 24 mph."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1737586800000,
          "temp": 12,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy. Low around 12, with temperatures rising to around 16 overnight. Wind chill values as low as -1. South southwest wind 8 to 13 mph, with gusts as high as 22 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1737630000000,
          "temp": 26,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy, with a high near 26. West southwest wind around 9 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737536400000,
          "temp": 2,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Cloudy. Low around 2, with temperatures rising to around 10 overnight. Wind chill values as low as -11. South wind around 20 mph, with gusts as high as 30 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1737543600000,
          "temp": 24,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 1pm, then snow showers and areas of blowing snow. Mostly cloudy. High near 24, with temperatures falling to around 22 in the afternoon. Wind chill values as low as -11. Southwest wind around 20 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1737586800000,
          "temp": 17,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy. Low around 17, with temperatures rising to around 20 overnight. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1737630000000,
          "temp": 22,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 22. Northwest wind around 10 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail is groomed for skate and classic skiing today, January 21, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Jan 21",
      "conditions": "Another good day out skating.  Skate lane and tracks in good condition.  A little slower due to frigid temperatures.   Sounds like skiing on styrofoam.   Tracks blown in on connector, but good in the woods."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Plenty of lake effect , combined with low 20 degree temps, plus the full big groom this morning , makes Nubs Knob red and blue trails as nice as it gets !"
    }
  },
  "nubsNob": {
    "date": "1/21/25",
    "liftsOpen": "5 Lifts and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be groomed this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Four inches of cold and dry snow fell on Nub's Nob last night and this morning. The majority of this snow was groomed, but expect an inch or two of fresh snow on top of the corduroy in some places. This type of snow is abrasive and will make your skis and snowboarders feel \"sticky\". The Tune Center can apply a hard wax in a few minutes to improve this situation. Please prepare for the cold today as the forecasted high is only a few degrees. The lifts will spin from 9 AM to 9 PM today with an hour break at 430 PM to prepare for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 80\""
    }
  }
}