{
  "timestamp": "2025-03-06T10:00:45.901Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1741255200000,
          "temp": 26,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy. Low around 26, with temperatures rising to around 29 overnight. West northwest wind around 17 mph, with gusts as high as 37 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1741258800000,
          "temp": 37,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely then Mostly Cloudy",
          "detailedForecast": "Snow showers likely before 7am, then a slight chance of snow between 7am and 10am. Mostly cloudy, with a high near 37. West northwest wind 16 to 21 mph, with gusts as high as 40 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1741302000000,
          "temp": 28,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow between 1am and 4am. Partly cloudy. Low around 28, with temperatures rising to around 30 overnight. West wind 8 to 14 mph, with gusts as high as 29 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1741345200000,
          "temp": 42,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 42. West wind 6 to 10 mph, with gusts as high as 20 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1741255200000,
          "temp": 16,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Cloudy. Low around 16, with temperatures rising to around 18 overnight. Northwest wind around 15 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1741258800000,
          "temp": 29,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 1pm. Mostly cloudy, with a high near 29. Northwest wind around 15 mph, with gusts as high as 40 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1741302000000,
          "temp": 19,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Isolated Snow Showers",
          "detailedForecast": "Isolated snow showers between 7pm and 1am. Mostly cloudy. Low around 19, with temperatures rising to around 22 overnight. West wind 10 to 15 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Friday",
          "timestamp": 1741345200000,
          "temp": 27,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny then Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 4pm. Mostly sunny, with a high near 27. Northwest wind around 15 mph. Chance of precipitation is 20%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1741255200000,
          "temp": 16,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Cloudy, with a low around 16. Northwest wind around 20 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1741258800000,
          "temp": 28,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 1pm. Mostly cloudy, with a high near 28. Northwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1741302000000,
          "temp": 18,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers between 7pm and 4am. Mostly cloudy. Low around 18, with temperatures rising to around 20 overnight. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1741345200000,
          "temp": 27,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 27. Northwest wind 10 to 15 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Due to the rainy, warm weather, the Bucks Run 2.5 km ski trail is icy and is not able to be groomed today, March 4, 2025. There is an additional $5 daily trail fee for the use of Bucks Run. Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours. Buck’s Run last day is Sunday, March 9, 2025."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Due to the warm, rainy weather, trails have deteriorated and are not suitable for skiing."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Mar 3",
      "conditions": "Some of the best skating of the season.  Hard skate deck, freshly groomed, fast but plenty of control.  Single classic track from building and into woods.  The last loop is not tracked, but there is a cutoff straight to the small hill that is tracked.  Lots of leaves with wind, especially in the tracks on the connector.Thanks HM for keeping us going this season."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sun, Mar 2",
      "conditions": "Red and Blue loops are hard packed and fast with a light skiff of new . There is some wind debris: but no more than minor agility training . LF 7"
    }
  },
  "nubsNob": {
    "date": "3/5/25",
    "liftsOpen": "4  lifts",
    "xcTrails": "Trails were groomed and tracked on Saturday. Trails will not be groomed until the temperature goes below freezing.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Some days it rains, and this is one of those days. The slopes were groomed last night. Wet soft snow should be expected today. Bahnhof Race League is cancelled for this evening due to soft snow conditions. The lifts will spin from 9 AM to 9 PM. Despite the weather, make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 1\"",
      "ytd": "YTD: 130\""
    }
  }
}