{
  "timestamp": "2026-01-21T11:02:30.645Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1768993200000,
          "temp": 32,
          "snowfall": 93,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Mostly cloudy, with a high near 32. South southwest wind 7 to 13 mph, with gusts as high as 24 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769036400000,
          "temp": 20,
          "snowfall": 29,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Chance Snow Showers",
          "detailedForecast": "A chance of snow before 7pm, then a chance of snow showers. Mostly cloudy. Low around 20, with temperatures rising to around 23 overnight. West southwest wind 9 to 13 mph, with gusts as high as 25 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1769079600000,
          "temp": 24,
          "snowfall": 26,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1pm. Partly sunny. High near 24, with temperatures falling to around 20 in the afternoon. West wind 12 to 17 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1769122800000,
          "temp": 2,
          "snowfall": 16,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers between 7pm and 1am. Mostly cloudy, with a low around 2. Wind chill values as low as -8. West wind 8 to 12 mph, with gusts as high as 22 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1768993200000,
          "temp": 21,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 21. Southwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769036400000,
          "temp": 10,
          "snowfall": 56,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 10, with temperatures rising to around 14 overnight. Wind chill values as low as -1. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1769079600000,
          "temp": 14,
          "snowfall": 39,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 14, with temperatures falling to around 11 in the afternoon. Wind chill values as low as -6. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1769122800000,
          "temp": -4,
          "snowfall": 47,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around -4. Wind chill values as low as -21. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1768993200000,
          "temp": 21,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. High near 21, with temperatures falling to around 19 in the afternoon. Wind chill values as low as -1. Southwest wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769036400000,
          "temp": 10,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 10, with temperatures rising to around 12 overnight. Wind chill values as low as -2. West wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1769079600000,
          "temp": 13,
          "snowfall": 58,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. High near 13, with temperatures falling to around 9 in the afternoon. Wind chill values as low as -7. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1769122800000,
          "temp": -4,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around -4. Wind chill values as low as -19. West wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Jan 19",
      "conditions": "Nubs Nob red and blue loop has 18” of hard packed base . Looks like we will be skiing late into the Spring!"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Jan 20",
      "conditions": "The woods south of Hammel road were very beautiful this morning.  Coverage is good, there are some fallen sticks (especially under the big pines) but easy to avoid.  Tracks are just skier made and pretty washed out, but all in all it's a nice ski with fresh light snow on top (and knock on wood, saw very little foot traffic)."
    }
  },
  "nubsNob": {
    "date": "1/20/26",
    "liftsOpen": "At least 5 chairlifts and the rope tow.",
    "xcTrails": "Trails will be power-tilled and tracked this morning.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "We are having a real winter in Northern Michigan. The landscape is frozen and beautiful. The snow surface is machine groomed, the fresh snow from yesterday now tilled into the base. On these cold days with new snow the crystals are sharp and will make your skis feel slow on the snow, it's a good day to wax your equipment or drop it off at the Tune Center. The high temperature will be around 15 degrees. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 p.m. Kielbasa sauerkraut is the soup of the day. Pintail Peak Lodge is open with food service and an espresso bar. We are proud to welcome the 70 plus ski club for their 40th annual gathering. Bundle up and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 13\"",
      "sevenDays": "7 days: 17\"",
      "ytd": "YTD: 96\""
    }
  }
}