{
  "timestamp": "2025-03-30T09:00:38.545Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1743325200000,
          "temp": 53,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain. Cloudy. Low around 53, with temperatures rising to around 55 overnight. South southeast wind around 8 mph. Chance of precipitation is 90%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1743328800000,
          "temp": 68,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Light Rain then Slight Chance Rain Showers",
          "detailedForecast": "Rain before 11am, then a slight chance of rain showers. Cloudy, with a high near 68. South wind 6 to 12 mph, with gusts as high as 24 mph. Chance of precipitation is 90%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1743372000000,
          "temp": 42,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms then Chance Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms before 11pm, then a chance of showers and thunderstorms. Mostly cloudy. Low around 42, with temperatures rising to around 53 overnight. Southwest wind 10 to 14 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1743415200000,
          "temp": 45,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers then Mostly Cloudy",
          "detailedForecast": "A chance of rain showers before 8am. Mostly cloudy, with a high near 45. West northwest wind around 15 mph, with gusts as high as 29 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1743325200000,
          "temp": 30,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Freezing rain and rain showers. Cloudy, with a low around 30. East wind around 15 mph. Chance of precipitation is 100%. New ice accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1743328800000,
          "temp": 35,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Freezing rain and rain showers. Cloudy, with a high near 35. East wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New ice accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1743372000000,
          "temp": 25,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Rain Showers then Snow Showers",
          "detailedForecast": "Rain showers before midnight, then freezing rain and rain showers between midnight and 3am, then snow showers and sleet and freezing rain. Cloudy. Low around 25, with temperatures rising to around 28 overnight. Northeast wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Monday",
          "timestamp": 1743415200000,
          "temp": 29,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers then Mostly Cloudy",
          "detailedForecast": "Snow showers before 8am, then a chance of snow between 8am and 11am. Mostly cloudy, with a high near 29. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1743325200000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Freezing rain. Cloudy. Low around 28, with temperatures rising to around 31 overnight. East wind around 10 mph. Chance of precipitation is 90%. New ice accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1743328800000,
          "temp": 39,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Freezing rain before 7am, then freezing rain and rain showers. Cloudy, with a high near 39. East wind around 10 mph. Chance of precipitation is 100%. New ice accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1743372000000,
          "temp": 24,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Showers And Thunderstorms then Snow Showers",
          "detailedForecast": "Rain showers before 8pm, then showers and thunderstorms between 8pm and 1am, then freezing rain and rain showers between 1am and 4am, then freezing rain and a slight chance of sleet between 4am and 5am, then snow showers. Cloudy. Low around 24, with temperatures rising to around 28 overnight. Northeast wind around 10 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Monday",
          "timestamp": 1743415200000,
          "temp": 29,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers then Mostly Cloudy",
          "detailedForecast": "Snow showers before 8am, then a chance of snow between 8am and 11am. Mostly cloudy, with a high near 29. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 24",
      "conditions": "Nubs with over a foot of snow since Thursday. Upper loops powertilled and tracked again Monday AM. Mid-winter type conditions should continue through the weekend."
    }
  },
  "nubsNob": {
    "date": "3/29/25-Closed due to heavy ice.",
    "liftsOpen": "0",
    "xcTrails": "Trails closed for the day. We will clean up the trails following this weather event.",
    "nightSkiing": "Done for the season.",
    "comments": "Nub's Nob is Closed today due to heavy ice on the chairlifts and slopes. \n\nWe plan to open tomorrow morning for skiing and riding at 9:00 AM if the weather allows. \n\nThe last scheduled day of the season is April 6.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 150\""
    }
  }
}