{
  "timestamp": "2025-03-20T08:00:47.758Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742457600000,
          "temp": 39,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain",
          "detailedForecast": "A chance of rain. Mostly cloudy. Low around 39, with temperatures rising to around 50 overnight. South southwest wind around 10 mph, with gusts as high as 23 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1742464800000,
          "temp": 49,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Light Rain then Rain And Snow Likely",
          "detailedForecast": "Rain before 2pm, then rain and snow likely. Mostly cloudy. High near 49, with temperatures falling to around 38 in the afternoon. West southwest wind 12 to 18 mph, with gusts as high as 33 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1742508000000,
          "temp": 28,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Partly Cloudy",
          "detailedForecast": "A slight chance of snow before 7pm. Partly cloudy, with a low around 28. West northwest wind 6 to 16 mph, with gusts as high as 26 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1742551200000,
          "temp": 53,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Sunny",
          "detailedForecast": "Sunny, with a high near 53. Southwest wind 5 to 15 mph, with gusts as high as 24 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742457600000,
          "temp": 26,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Cloudy. Low around 26, with temperatures rising to around 31 overnight. North wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1742464800000,
          "temp": 32,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow before 1pm. Partly sunny, with a high near 32. Northwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1742508000000,
          "temp": 19,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear. Low around 19, with temperatures rising to around 25 overnight. West wind 5 to 10 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1742551200000,
          "temp": 43,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 43. Southwest wind 10 to 20 mph, with gusts as high as 35 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742457600000,
          "temp": 25,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 25, with temperatures rising to around 29 overnight. North wind around 15 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1742464800000,
          "temp": 32,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow then Patchy Blowing Snow",
          "detailedForecast": "Snow showers before 8am, then snow showers likely and patchy blowing snow between 8am and 11am, then patchy blowing snow and a slight chance of snow showers between 11am and 2pm. Mostly cloudy, with a high near 32. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1742508000000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear. Low around 18, with temperatures rising to around 23 overnight. West wind 5 to 15 mph, with gusts as high as 25 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1742551200000,
          "temp": 46,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 46. Southwest wind 10 to 20 mph, with gusts as high as 35 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 17",
      "conditions": "It’s still great! New groom this morning over a strong base with fresh snow . The upper loops have great coverage : both the skate and classic are premium ."
    }
  },
  "nubsNob": {
    "date": "3/19/25",
    "liftsOpen": "4 Lifts",
    "xcTrails": "The upper trails were power-tilled and tracked on Monday. Expect soft snow today. The upper red is holding snow better compared to the rest of the trails.",
    "nightSkiing": "Done for the season.",
    "comments": "Spring skiing continues at Nub's Nob. The snow is granular in texture today and has some set to it in certain areas. The snow should loosen up quickly this morning as the temperature goes up. A rain and snow mix is expected late this afternoon and evening. The Tune Center is now selling the demo skis from this season and we have some amazing deals in the General Store. The lifts will spin from 9 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 2\"",
      "sevenDays": "7 days: 2\"",
      "ytd": "YTD: 137\""
    }
  }
}