{
  "timestamp": "2025-02-05T16:00:42.284Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1738767600000,
          "temp": 26,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 26. East wind around 7 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1738796400000,
          "temp": 23,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow likely between 7pm and 2am, then snow and sleet between 2am and 5am, then snow and sleet and freezing rain. Cloudy. Low around 23, with temperatures rising to around 25 overnight. East southeast wind around 8 mph, with gusts as high as 18 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday",
          "timestamp": 1738839600000,
          "temp": 39,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Freezing Rain then Mostly Cloudy",
          "detailedForecast": "Freezing rain before 8am, then a slight chance of freezing drizzle between 8am and 11am. Mostly cloudy. High near 39, with temperatures falling to around 37 in the afternoon. South southwest wind 5 to 16 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1738882800000,
          "temp": 19,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 19. West wind around 14 mph, with gusts as high as 30 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1738767600000,
          "temp": 22,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 22, with temperatures falling to around 20 in the afternoon. Southwest wind around 5 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1738796400000,
          "temp": 15,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely after 10pm. Mostly cloudy. Low around 15, with temperatures rising to around 20 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1738839600000,
          "temp": 30,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow Likely then Snow Showers",
          "detailedForecast": "Snow likely before 7am, then snow showers. Cloudy. High near 30, with temperatures falling to around 26 in the afternoon. Southwest wind 5 to 25 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1738882800000,
          "temp": 12,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am. Mostly cloudy, with a low around 12. Wind chill values as low as -3. West wind 15 to 25 mph, with gusts as high as 40 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1738767600000,
          "temp": 23,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 23, with temperatures falling to around 21 in the afternoon. South wind around 5 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1738796400000,
          "temp": 13,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely after 10pm. Mostly cloudy. Low around 13, with temperatures rising to around 19 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1738839600000,
          "temp": 30,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow Likely then Chance Snow Showers",
          "detailedForecast": "Snow likely before 7am, then a chance of snow showers. Mostly cloudy. High near 30, with temperatures falling to around 26 in the afternoon. Southwest wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1738882800000,
          "temp": 10,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "A chance of snow showers before 7pm, then snow showers and areas of blowing snow. Mostly cloudy, with a low around 10. Wind chill values as low as -6. West wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/1 and 2/2.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 5, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time.  When skiing the golf course trails please ski on designated marked trails only."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 3",
      "conditions": "This morning’s  snow  was the icing on the cake over a well layered and constructed base . Beautiful groom - well done Nubs crew ! LF 7"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Feb 4",
      "conditions": "Crispy cold at 1830 running fast in firm machine snow classic tracks. Toko blue gave great glide, skins did good on uphills."
    }
  },
  "nubsNob": {
    "date": "2/5/25",
    "liftsOpen": "At least 5 lifts, Space Worm and the rope tow",
    "xcTrails": "Trails were power-tilled and tracked on Monday morning, and are in great shape.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's another great day to be on skis at Nub's Nob. Thanks to continuous temperatures below freezing along with the work of our Grooming Crew the snow surface continues to be top-notch. Today the temperature should reach 25 degrees with very light wind. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 to prepare for the night session. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 104\""
    }
  }
}