{
  "timestamp": "2025-01-21T16:00:42.627Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737475200000,
          "temp": 8,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow before 5pm. Partly sunny, with a high near 8. Wind chill values as low as -7. West southwest wind around 12 mph, with gusts as high as 18 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737500400000,
          "temp": -3,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around -3. Wind chill values as low as -16. Southwest wind around 8 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1737543600000,
          "temp": 16,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 16, with temperatures falling to around 12 in the afternoon. Wind chill values as low as -16. South southwest wind 7 to 14 mph, with gusts as high as 25 mph."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1737586800000,
          "temp": 12,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow after 7pm. Cloudy, with a low around 12. Wind chill values as low as 0. South southwest wind 8 to 12 mph, with gusts as high as 24 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737475200000,
          "temp": 9,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy, with a high near 9. Wind chill values as low as -12. West wind around 15 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737500400000,
          "temp": 6,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow before 1am, then patchy blowing snow and scattered snow showers. Mostly cloudy. Low around 6, with temperatures rising to around 10 overnight. Wind chill values as low as -10. Southwest wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1737543600000,
          "temp": 22,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Patchy Blowing Snow then Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 7am, then snow showers and patchy blowing snow. Cloudy, with a high near 22. Wind chill values as low as -8. Southwest wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1737586800000,
          "temp": 12,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 12. West wind 5 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail is groomed for skate and classic skiing today, January 21th, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Jan 20",
      "conditions": "Very nice grooming on Buck’s Run. Classic tracks were deep and firm, although the wind had blown in some debris (oak leaves, pine needles, a few twigs). Still, great gliding on VR30 and some other prior waxes. Tracks were fast despite the extreme cold temps. The skating lane looked nice, it’s wide with just a slight ridge."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Plenty of lake effect , combined with low 20 degree temps, plus the full big groom this morning , makes Nubs Knob red and blue trails as nice as it gets !"
    }
  },
  "nubsNob": {
    "date": "1/21/25",
    "liftsOpen": "5 Lifts and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be groomed this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Four inches of cold and dry snow fell on Nub's Nob last night and this morning. The majority of this snow was groomed, but expect an inch or two of fresh snow on top of the corduroy in some places. This type of snow is abrasive and will make your skis and snowboarders feel \"sticky\". The Tune Center can apply a hard wax in a few minutes to improve this situation. Please prepare for the cold today as the forecasted high is only a few degrees. The lifts will spin from 9 AM to 9 PM today with an hour break at 430 PM to prepare for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 80\""
    }
  }
}