{
  "timestamp": "2026-01-19T06:01:42.527Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768798800000,
          "temp": 16,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 16, with temperatures rising to around 18 overnight. Southwest wind around 8 mph, with gusts as high as 18 mph. Chance of precipitation is 100%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 21,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 21, with temperatures falling to around 15 in the afternoon. Wind chill values as low as -1. West southwest wind 9 to 16 mph, with gusts as high as 40 mph. Chance of precipitation is 100%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1768863600000,
          "temp": 6,
          "snowfall": 26,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy, with a low around 6. Wind chill values as low as -5. West wind 7 to 14 mph, with gusts as high as 28 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 17,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Isolated Snow Showers then Mostly Cloudy",
          "detailedForecast": "Isolated snow showers before 7am. Mostly cloudy, with a high near 17. Wind chill values as low as -5. West southwest wind 5 to 12 mph, with gusts as high as 22 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768798800000,
          "temp": 14,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 14, with temperatures rising to around 16 overnight. Southwest wind around 10 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 16,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Light Snow And Patchy Blowing Snow",
          "detailedForecast": "Snow before 10am, then snow and patchy blowing snow. Cloudy. High near 16, with temperatures falling to around 8 in the afternoon. Wind chill values as low as -10. Northwest wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1768863600000,
          "temp": 3,
          "snowfall": 49,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Light Snow then Scattered Snow Showers",
          "detailedForecast": "A chance of snow before 7pm, then scattered snow showers. Cloudy, with a low around 3. Wind chill values as low as -14. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 12,
          "snowfall": 36,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers then Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow. Mostly cloudy, with a high near 12. Wind chill values as low as -14. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768798800000,
          "temp": 12,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 12. Wind chill values as low as 0. Southwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 13,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. High near 13, with temperatures falling to around 7 in the afternoon. Wind chill values as low as -10. West wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1768863600000,
          "temp": 1,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow then Snow Showers",
          "detailedForecast": "Snow before 7pm, then snow showers. Cloudy, with a low around 1. Wind chill values as low as -15. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 9,
          "snowfall": 63,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers then Chance Light Snow",
          "detailedForecast": "A chance of snow showers before 7am, then a chance of snow. Mostly cloudy, with a high near 9. Wind chill values as low as -15. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Jan 15",
      "conditions": "Skiing is awesome with a 24\" base of natural snow and daily power tilling.  All trails are open.  Save $20 on race registration by registering online at SKIREG.com by 10 pm tonight!"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Jan 18",
      "conditions": "Bucks Run was firm and fast this afternoon as there had been a lot of skiers on the course.  When I arrived around 4 pm the parking lot was jammed and there were a lot of skiers on the trail.  Conditions should remain very good with the potential snow later tonight and colder temps in the forecast.    Great job by the Huron Meadows crew!"
    }
  },
  "nubsNob": {
    "date": "1/18/26",
    "liftsOpen": "All 8 chairlifts, conveyor and the rope tow.",
    "xcTrails": "Trails will be power-tilled and tracked this morning. There is a classic race on the upper Red at 10 a.m. this morning.",
    "nightSkiing": "Special night skiing session this Sunday from 5:30 to 9:00 p.m.",
    "comments": "The skiers paradise continues at Nub's Nob. A bit of fresh snow overnight and continued snowfall today should make for excellent conditions. NASTAR racing is open to the public at 12:30 on Birch Run. Pintail Peak Lodge is open with food and an espresso bar. The soup of the day is polish sausage with sauerkraut. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 to groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 8\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 88\""
    }
  }
}