{
  "timestamp": "2025-11-29T21:00:41.709Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764450000000,
          "temp": 34,
          "snowfall": 58,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy. High near 34, with temperatures falling to around 32 in the afternoon. Southeast wind around 8 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764457200000,
          "temp": 29,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow before 5am, then rain and snow. Cloudy. Low around 29, with temperatures rising to around 34 overnight. South southeast wind around 10 mph, with gusts as high as 22 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1764500400000,
          "temp": 38,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow. Mostly cloudy. High near 38, with temperatures falling to around 36 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1764543600000,
          "temp": 17,
          "snowfall": 41,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow then Mostly Clear",
          "detailedForecast": "A chance of snow before 7pm. Mostly clear, with a low around 17. West northwest wind 3 to 13 mph, with gusts as high as 26 mph. Chance of precipitation is 40%."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764450000000,
          "temp": 31,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy. High near 31, with temperatures falling to around 28 in the afternoon. Southeast wind around 5 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764457200000,
          "temp": 23,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow. Cloudy. Low around 23, with temperatures rising to around 27 overnight. East wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1764500400000,
          "temp": 31,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Heavy Snow then Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow before 1pm, then snow showers likely and patchy blowing snow. Mostly cloudy. High near 31, with temperatures falling to around 27 in the afternoon. North wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1764543600000,
          "temp": 19,
          "snowfall": 69,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 19. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764450000000,
          "temp": 28,
          "snowfall": 77,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy. High near 28, with temperatures falling to around 25 in the afternoon. Southeast wind around 5 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764457200000,
          "temp": 22,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow. Cloudy. Low around 22, with temperatures rising to around 25 overnight. East wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1764500400000,
          "temp": 30,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow before 1pm, then snow showers. Cloudy. High near 30, with temperatures falling to around 25 in the afternoon. North wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1764543600000,
          "temp": 15,
          "snowfall": 79,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 15. West wind 5 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "11/29/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed pending more natural snow.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The Lodge, General Store, Tune Center, Cafeteria and Pub are all open from 9:00 – 4:00 today, with the Michigan-Ohio State game on in the pub. Early season tuning specials run through today. Get your skis and boards in soon! The General Store also has many great gift ideas for the skier on your list. The lodge will be closed on Sunday, November 29th. Stay tuned for an announcement on an opening day to the ski season.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 3\"",
      "ytd": "YTD: 8\""
    }
  }
}