{
  "timestamp": "2025-12-02T06:00:44.426Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764655200000,
          "temp": 21,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 21. North northeast wind around 3 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1764673200000,
          "temp": 32,
          "snowfall": 29,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow then Partly Sunny",
          "detailedForecast": "A chance of snow before 7am. Partly sunny. High near 32, with temperatures falling to around 28 in the afternoon. Northwest wind 2 to 7 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1764716400000,
          "temp": 19,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 19. West southwest wind 2 to 7 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764759600000,
          "temp": 32,
          "snowfall": 22,
          "snowAmount": "",
          "shortForecast": "Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1pm. Cloudy, with a high near 32. Southwest wind 7 to 12 mph, with gusts as high as 23 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764655200000,
          "temp": 21,
          "snowfall": 93,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 21, with temperatures rising to around 23 overnight. West wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1764673200000,
          "temp": 29,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 1pm. Mostly cloudy, with a high near 29. West wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1764716400000,
          "temp": 21,
          "snowfall": 66,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 7pm. Cloudy. Low around 21, with temperatures rising to around 26 overnight. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764759600000,
          "temp": 31,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 31. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764655200000,
          "temp": 17,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 17, with temperatures rising to around 19 overnight. Southwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1764673200000,
          "temp": 27,
          "snowfall": 43,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 10am. Mostly cloudy. High near 27, with temperatures falling to around 25 in the afternoon. Southwest wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1764716400000,
          "temp": 18,
          "snowfall": 49,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 1am. Mostly cloudy. Low around 18, with temperatures rising to around 24 overnight. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764759600000,
          "temp": 30,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 30. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Nubs Nob is not yet open for its down hill program : coming this weekend . But the groomers jumped the gun on the Nordic Trails . Access through Valley road to the red and blue loops are currently primo !"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Many of the north trails are rolled. It's a bit soft for skating but manageable. I suggest rock skis since there are sections with a \"carpet\" of twigs and tall grass. It's decent for Dec. 1 so get out and ski while the temps permit..."
    }
  },
  "nubsNob": {
    "date": "12/01/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Trails are being packed today. Not open for skiing as we prepare trails.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today as we focus on snowmaking. We will be open for skiing and riding December 6 and 7 from 9 a.m. to 4:30 p.m. for our first two days of the ski season. Thanks to the Nub's Nob Snow Farmers and some natural snow we should be in very good shape for this opening weekend. Stay tuned for more details including a run count over the next few days. See you on the slopes next weekend!",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 10\"",
      "sevenDays": "7 days: 10\"",
      "ytd": "YTD: 15\""
    }
  }
}