{
  "timestamp": "2025-03-23T11:00:35.695Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1742727600000,
          "temp": 43,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Partly Sunny then Chance Rain",
          "detailedForecast": "A chance of rain after 5pm. Partly sunny, with a high near 43. Southeast wind 5 to 16 mph, with gusts as high as 25 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1742767200000,
          "temp": 35,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain before 7pm, then rain and snow between 7pm and 2am. Mostly cloudy. Low around 35, with temperatures rising to around 38 overnight. South wind 14 to 18 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742810400000,
          "temp": 41,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers between 8am and 11am, then a chance of rain and snow showers. Mostly cloudy. High near 41, with temperatures falling to around 39 in the afternoon. West southwest wind 14 to 18 mph, with gusts as high as 36 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742853600000,
          "temp": 31,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain Showers then Mostly Cloudy",
          "detailedForecast": "A chance of rain showers before 8pm. Mostly cloudy, with a low around 31. West wind 7 to 15 mph, with gusts as high as 32 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1742727600000,
          "temp": 39,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Partly Sunny then Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 5pm. Partly sunny, with a high near 39. Southeast wind 10 to 15 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Tonight",
          "timestamp": 1742767200000,
          "temp": 28,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 28, with temperatures rising to around 30 overnight. East wind 10 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742810400000,
          "temp": 34,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. High near 34, with temperatures falling to around 32 in the afternoon. Northwest wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742853600000,
          "temp": 25,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 25. Northwest wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1742727600000,
          "temp": 40,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny then Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 5pm. Mostly sunny, with a high near 40. Southeast wind 5 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1742767200000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 28, with temperatures rising to around 30 overnight. Southeast wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742810400000,
          "temp": 34,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 34. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742853600000,
          "temp": 23,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 23. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Fri, Mar 21",
      "conditions": "6-inches of snow on Thursday and a complete powertilling of the upper loops to World Cup specs this morning. A touch soft today, but should be an amazing 7-10 day stretch starting tomorrow. Huge shoutout to Ben and the entire crew at Nubs for their commitment to Nordic skiing."
    }
  },
  "nubsNob": {
    "date": "3/22/25",
    "liftsOpen": "At least 7 lifts, Rope Tow and Space Worm.",
    "xcTrails": "Upper Trails were power-tilled and tracked yesterday morning. The lower trails were packed yesterday. Conditions on the Upper Trails are very good.",
    "nightSkiing": "Done for the season.",
    "comments": "It feels like it's back to winter at Nub's Nob. The snow is in good shape this morning thanks to the new snow this week along with a late groom this morning. The wind is up today and the temperature should stay in the mid-20's. NASTAR Racing on Birch Run from 12:30 to 2:30 PM. The Tweed Tones will play the Nub's Pub this afternoon. Pintail Peak lodge is open with a deli and espresso bar. The lifts will spin from 9:00 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 7\"",
      "ytd": "YTD: 142\""
    }
  }
}