{
  "timestamp": "2025-11-30T04:10:36.403Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1764475200000,
          "temp": 29,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow before 5am, then rain and snow. Cloudy. Low around 29, with temperatures rising to around 34 overnight. South southeast wind around 10 mph, with gusts as high as 22 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1764500400000,
          "temp": 38,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow. Mostly cloudy. High near 38, with temperatures falling to around 36 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1764543600000,
          "temp": 17,
          "snowfall": 41,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow then Mostly Clear",
          "detailedForecast": "A chance of snow before 7pm. Mostly clear, with a low around 17. West northwest wind 3 to 13 mph, with gusts as high as 26 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Monday",
          "timestamp": 1764586800000,
          "temp": 31,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 31. West southwest wind 2 to 6 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1764475200000,
          "temp": 23,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 23, with temperatures rising to around 27 overnight. East wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1764500400000,
          "temp": 31,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Light Snow And Areas Of Blowing Snow",
          "detailedForecast": "Snow before 10am, then snow and areas of blowing snow between 10am and 1pm, then areas of blowing snow and scattered snow showers. Mostly cloudy. High near 31, with temperatures falling to around 26 in the afternoon. North wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1764543600000,
          "temp": 21,
          "snowfall": 42,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Areas Of Blowing Snow",
          "detailedForecast": "Areas of blowing snow and scattered snow showers. Mostly cloudy, with a low around 21. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1764586800000,
          "temp": 28,
          "snowfall": 44,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1pm, then a chance of snow. Mostly cloudy, with a high near 28. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1764475200000,
          "temp": 22,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 22, with temperatures rising to around 25 overnight. East wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1764500400000,
          "temp": 30,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow And Patchy Blowing Snow",
          "detailedForecast": "Snow before 10am, then snow and patchy blowing snow between 10am and 1pm, then areas of blowing snow and scattered snow showers. Cloudy. High near 30, with temperatures falling to around 25 in the afternoon. North wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1764543600000,
          "temp": 16,
          "snowfall": 69,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Areas Of Blowing Snow then Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Areas of blowing snow and scattered snow showers before 10pm, then a chance of snow showers and patchy blowing snow. Mostly cloudy, with a low around 16. Northwest wind 5 to 15 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1764586800000,
          "temp": 25,
          "snowfall": 32,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers then Slight Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a slight chance of snow. Mostly cloudy, with a high near 25. Southwest wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Nov 29",
      "conditions": "Has anybody been by HM to see if they are blowing snow yet? Ski hills in the area have been making snow for a few days now."
    }
  },
  "nubsNob": {
    "date": "11/29/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed pending more natural snow.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The Lodge, General Store, Tune Center, Cafeteria and Pub are all open from 9:00 – 4:00 today, with the Michigan-Ohio State game on in the pub. Early season tuning specials run through today. Get your skis and boards in soon! The General Store also has many great gift ideas for the skier on your list. The lodge will be closed on Sunday, November 29th. Stay tuned for an announcement on an opening day to the ski season.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 3\"",
      "ytd": "YTD: 8\""
    }
  }
}