{
  "timestamp": "2025-12-06T19:00:39.307Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765047600000,
          "temp": 34,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 34, with temperatures falling to around 30 in the afternoon. West wind around 9 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765062000000,
          "temp": 22,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of snow after 4am. Mostly cloudy, with a low around 22. West southwest wind 1 to 5 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Sunday",
          "timestamp": 1765105200000,
          "temp": 30,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy. High near 30, with temperatures falling to around 27 in the afternoon. West wind 2 to 10 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1765148400000,
          "temp": 13,
          "snowfall": 9,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 13. North northwest wind 5 to 9 mph. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765047600000,
          "temp": 27,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 27, with temperatures falling to around 21 in the afternoon. Northwest wind around 10 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765062000000,
          "temp": 13,
          "snowfall": 44,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a low around 13. Southwest wind 0 to 5 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1765105200000,
          "temp": 22,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 22, with temperatures falling to around 17 in the afternoon. West wind 5 to 15 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1765148400000,
          "temp": -1,
          "snowfall": 34,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 7pm. Mostly cloudy, with a low around -1. Wind chill values as low as -9. North wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765047600000,
          "temp": 26,
          "snowfall": 97,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 26, with temperatures falling to around 19 in the afternoon. Northwest wind around 10 mph. Chance of precipitation is 100%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765062000000,
          "temp": 13,
          "snowfall": 73,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy, with a low around 13. Southwest wind 0 to 5 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1765105200000,
          "temp": 21,
          "snowfall": 73,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. High near 21, with temperatures falling to around 18 in the afternoon. West wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1765148400000,
          "temp": 2,
          "snowfall": 47,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am. Partly cloudy, with a low around 2. Wind chill values as low as -1. Northwest wind 0 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Dec 5",
      "conditions": "Still great as of this (Friday) morning. Hawk hills a little rough some dirt and vegetation showing through in parts- but skiable. Coyote run and contractors in great shape!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Nubs Nob is not yet open for its down hill program : coming this weekend . But the groomers jumped the gun on the Nordic Trails . Access through Valley road to the red and blue loops are currently primo !"
    }
  },
  "nubsNob": {
    "date": "12/06/25: Opening Day",
    "liftsOpen": "4 lifts, Rope Tow and Space Worm",
    "xcTrails": "All trails are open. Trails are being packed again this morning and a track will be set on the lower trails and the upper Red for classic skiing. Conditions are very good.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Welcome to opening day at Nub's Nob! Conditions feel like the middle of winter with a little fresh snow overnight mixed into the corduroy. Expect very good snow today. There will be soft snow on the steep runs as it has not been groomed many times yet. The lifts will spin from 9:00 a.m. to 4:30 p.m. There is a mini park at the bottom of Dories Bowl. The cross country trails are all open and in amazing condition for the start of the season. Chorizo Corn Chowder is the soup of the day. Welcome back and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "3\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 19\"",
      "ytd": "YTD: 27\""
    }
  }
}