{
  "timestamp": "2025-02-15T09:00:35.985Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739606400000,
          "temp": 18,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 18, with temperatures rising to around 22 overnight. Southeast wind around 7 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1739617200000,
          "temp": 33,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow before 1pm, then a chance of snow and a chance of sleet. Cloudy, with a high near 33. East wind around 7 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1739660400000,
          "temp": 26,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow before 8pm, then snow and a slight chance of freezing rain between 8pm and 11pm, then freezing rain and a slight chance of sleet and rain and snow between 11pm and 1am, then freezing rain and a slight chance of snow between 1am and 3am, then snow and freezing rain. Cloudy. Low around 26, with temperatures rising to around 30 overnight. Northeast wind 6 to 9 mph, with gusts as high as 20 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday",
          "timestamp": 1739703600000,
          "temp": 30,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy, with a high near 30. North northwest wind 9 to 14 mph, with gusts as high as 25 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible. Little or no ice accumulation expected."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739606400000,
          "temp": 17,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 17. Southeast wind around 5 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1739617200000,
          "temp": 27,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy, with a high near 27. East wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1739660400000,
          "temp": 17,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Likely",
          "detailedForecast": "Snow likely. Cloudy. Low around 17, with temperatures rising to around 20 overnight. Northeast wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1739703600000,
          "temp": 20,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow Likely then Snow Showers",
          "detailedForecast": "Snow likely before 7am, then snow showers. Cloudy, with a high near 20. North wind around 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739606400000,
          "temp": 14,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 14, with temperatures rising to around 16 overnight. Southeast wind around 5 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1739617200000,
          "temp": 26,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy, with a high near 26. East wind around 5 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1739660400000,
          "temp": 16,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 16, with temperatures rising to around 20 overnight. Northeast wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1739703600000,
          "temp": 19,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow then Snow Showers",
          "detailedForecast": "Snow before 7am, then snow showers. Cloudy, with a high near 19. North wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 14, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  For today, February 14, 2025 grooming for classic ski only will take place on Coyote Run while Hawks Hill will be rolled only.  Our staff will be assessing all other trails today and possibly be rolling if conditions permit."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be open on 2/15 and 2/16.  Golf course and Shelden Trails are currently groomed.  Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Feb 14",
      "conditions": "Skated the golf course this morning.  Skating was great, a little soft in spots, some grassy stubble, but no complaints!  Groomer was setting classic tracks on Coyote while I was there, they looked very grassy, so would not recommend classic (except on Buck's) unless you like skiing in the skate lane.  Cedar trace was also rolled.  Hawk's (south golf course) was pretty great for skate, but I skipped the \"grotto of tears\" which looked too hairy for me."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Feb 12",
      "conditions": "Being the very first on the groom today , I am biased : but boy oh boy it is nice at Nubs Nob ! LF 6"
    }
  },
  "nubsNob": {
    "date": "2/14/25",
    "liftsOpen": "7 lifts, Rope Tow, and the Space Worm",
    "xcTrails": "Trails are open and in great shape. All trails are groomed and tracked.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM. Special night skiing session on this Sunday from 5:30 to 9:00 PM.",
    "comments": "Happy Valentine's Day from all of us at Nub's Nob. Two inches of snow fell at Nub's Nob yesterday and conditions continue to be mid-winter excellent. All runs are open along with all of the XC and snowshoe trails. The temperature is forecast to hit the mid-20's this afternoon. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 to groom for night skiing. Make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 6\"",
      "sevenDays": "7 days: 11\"",
      "ytd": "YTD: 116\""
    }
  }
}