{
  "timestamp": "2025-02-08T03:02:12.100Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1738980000000,
          "temp": 21,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 21. Northwest wind around 3 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1739012400000,
          "temp": 30,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow after 7am. Cloudy, with a high near 30. East wind 3 to 8 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1739055600000,
          "temp": 23,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1am. Mostly cloudy, with a low around 23. North wind around 7 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1739098800000,
          "temp": 32,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 32. West northwest wind 6 to 9 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1738980000000,
          "temp": 14,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 14, with temperatures rising to around 16 overnight. Southwest wind around 5 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1739012400000,
          "temp": 26,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely after 7am. Mostly cloudy, with a high near 26. Southeast wind 0 to 5 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1739055600000,
          "temp": 15,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1am, then a slight chance of snow showers. Cloudy. Low around 15, with temperatures rising to around 18 overnight. North wind 0 to 5 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1739098800000,
          "temp": 21,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A slight chance of snow showers before 7am. Partly sunny, with a high near 21. Northwest wind 5 to 10 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1738980000000,
          "temp": 12,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 12, with temperatures rising to around 15 overnight. Southwest wind around 5 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1739012400000,
          "temp": 25,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow after 7am. Cloudy, with a high near 25. Southeast wind around 5 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1739055600000,
          "temp": 15,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1am, then a chance of snow showers. Cloudy. Low around 15, with temperatures rising to around 17 overnight. North wind 0 to 5 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1739098800000,
          "temp": 20,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 20. Northwest wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/8 and 2/9.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 7, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time.  When skiing the golf course trails please ski on designated marked trails only."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Feb 7",
      "conditions": "Bucks has been good but likely groomed close to ski hours without time to set up,  so it’s turned to deep sugar after ski traffic. On the bright side, it is more work (challenging) and a good change from the rocket fast and effortless ball bearings as is typical. Wax is still insignificant…everything is fast. Still great to be skiing close to home and there seems to be a lot of daily XC traffic at HM."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 3",
      "conditions": "This morning’s  snow  was the icing on the cake over a well layered and constructed base . Beautiful groom - well done Nubs crew ! LF 7"
    }
  },
  "nubsNob": {
    "date": "2/7/25",
    "liftsOpen": "6 lifts, Space Worm and the rope tow",
    "xcTrails": "Trails are open. We are picking up sticks on the trails today following yesterday's windstorm",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "The strong wind from last night has passed. The wind is around 15 mph this morning and will continue to drop to a light wind by the afternoon. Snow conditions are very good with no thaw in sight. The M/D/V Speed Series race is tonight on Smokey. Please register for this race by 3 p.m. today online. Pintail Peak lodge is open with a deli and an espresso bar. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 to groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 4\"",
      "ytd": "YTD: 104\""
    }
  }
}