{
  "timestamp": "2025-02-02T10:00:36.298Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738490400000,
          "temp": 17,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Cloudy",
          "detailedForecast": "Cloudy. Low around 17, with temperatures rising to around 19 overnight. East southeast wind around 8 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1738494000000,
          "temp": 34,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow between 7am and 4pm, then a slight chance of freezing rain between 4pm and 5pm, then a slight chance of rain. Cloudy, with a high near 34. South southeast wind around 7 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1738537200000,
          "temp": 30,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Freezing Rain then Cloudy",
          "detailedForecast": "A slight chance of freezing rain before 7pm. Cloudy. Low around 30, with temperatures rising to around 34 overnight. South southwest wind around 3 mph. Little or no ice accumulation expected."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 43,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain",
          "detailedForecast": "A slight chance of rain after 7am. Cloudy, with a high near 43. South southwest wind 2 to 7 mph. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738490400000,
          "temp": 12,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 12, with temperatures rising to around 18 overnight. Southeast wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1738494000000,
          "temp": 31,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. High near 31, with temperatures falling to around 29 in the afternoon. South wind 5 to 10 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1738537200000,
          "temp": 28,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Rain And Snow Likely",
          "detailedForecast": "A slight chance of snow before 7pm, then rain and snow likely. Cloudy. Low around 28, with temperatures rising to around 32 overnight. Southwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 28,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Heavy Snow Likely",
          "detailedForecast": "Snow likely before 1pm, then a chance of snow showers. Cloudy, with a high near 28. Northwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738490400000,
          "temp": 12,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 12, with temperatures rising to around 17 overnight. Southeast wind around 15 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1738494000000,
          "temp": 29,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 4pm. Cloudy, with a high near 29. South wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1738537200000,
          "temp": 27,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Cloudy then Light Snow Likely",
          "detailedForecast": "Snow likely after 1am. Cloudy. Low around 27, with temperatures rising to around 31 overnight. Southwest wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 29,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow before 1pm, then a chance of snow showers. Cloudy, with a high near 29. Northwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 7 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail has been groomed for skate and classic skiing today, February 1, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time.  When skiing the golf course trails please ski on designated marked trails only."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/1 and 2/2.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Jan 28",
      "conditions": "The red & blue trails were groomed up nicely after yesterday's snowfall. We skate skied both this morning while the current round of snow was falling which slowed things down a lot."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Feb 1",
      "conditions": "Bucks Run survived! (thank you thermodynamics) Tracks are hard and fast."
    }
  },
  "nubsNob": {
    "date": "2/1/25",
    "liftsOpen": "All 8 lifts, Space Worm and the rope tow",
    "xcTrails": "Trails are open and will be groomed this morning with a track set.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a cold, clear and beautiful morning at Nub's. We had a small warm-up the last few days, but the snow did not get wet and the ski surface remains in exceptional shape. We should see some sunshine this morning, remember to bring your shades. NASTAR racing is open to the public from 12:30 to 2:30 PM. Pintail Peak lodge is open with a deli and espresso bar. Owen James will play the Nub's Pub at 3:30 PM. The Lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 PM to groom for night skiing. Bundle up and make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 101\""
    }
  }
}