{
  "timestamp": "2025-01-25T12:00:45.108Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737806400000,
          "temp": 30,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow then Partly Sunny",
          "detailedForecast": "A chance of snow before 10am. Partly sunny, with a high near 30. South southwest wind around 12 mph, with gusts as high as 23 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tonight",
          "timestamp": 1737846000000,
          "temp": 21,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow after 7pm. Mostly cloudy, with a low around 21. West southwest wind 8 to 12 mph, with gusts as high as 22 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737889200000,
          "temp": 27,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Partly Sunny",
          "detailedForecast": "A chance of snow before 7am. Partly sunny, with a high near 27. West wind around 10 mph, with gusts as high as 21 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1737932400000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 18. West southwest wind 8 to 13 mph, with gusts as high as 25 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737806400000,
          "temp": 29,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow then Areas Of Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 10am, then areas of blowing snow and scattered snow showers. Cloudy, with a high near 29. Southwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737846000000,
          "temp": 16,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Areas Of Blowing Snow then Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Areas of blowing snow and scattered snow showers before 7pm, then a chance of snow showers and patchy blowing snow. Mostly cloudy. Low around 16, with temperatures rising to around 19 overnight. West wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737889200000,
          "temp": 25,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 7am. Mostly cloudy, with a high near 25. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1737932400000,
          "temp": 21,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "A slight chance of snow showers between 7pm and 8pm, then patchy blowing snow and a slight chance of snow showers. Mostly cloudy, with a low around 21. Southwest wind 15 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 20%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737806400000,
          "temp": 29,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Scattered snow showers before 4pm, then a chance of snow showers and areas of blowing snow. Mostly cloudy. High near 29, with temperatures falling to around 27 in the afternoon. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737846000000,
          "temp": 13,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow. Cloudy. Low around 13, with temperatures rising to around 18 overnight. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737889200000,
          "temp": 22,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow then Mostly Cloudy",
          "detailedForecast": "Snow showers and patchy blowing snow before 7am. Mostly cloudy. High near 22, with temperatures falling to around 20 in the afternoon. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1737932400000,
          "temp": 16,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Slight Chance Snow Showers then Patchy Blowing Snow",
          "detailedForecast": "A slight chance of snow showers between 7pm and midnight, then patchy blowing snow and a slight chance of snow showers. Mostly cloudy, with a low around 16. Southwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 20%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 24, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Coyote Run and Hawks Hills ski trails have been rolled. The trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Jan 24",
      "conditions": "The golf course is ROLLED, baby!! It’s thin, but it’s golf course skiing, for which I am grateful. The Metroparks did a very nice job given the lack of snowfall. I skied the gully on the south end by the entrance, but I would super definitely very much not ski it again until we get more snow. Parking lot was PACKED at 2pm on a Friday. Should be a good weekend out here."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Fri, Jan 24",
      "conditions": "The upper red and blue were groomed this morning with the Piston Bully . The wide skate lane and the firm classic tract were as good as it gets . Used LF 7 - LF6 might have been a slightly better choice ."
    }
  },
  "nubsNob": {
    "date": "1/24/25",
    "liftsOpen": "7 lifts, Rope Tow, and Space Worm",
    "xcTrails": "Trails are open and in great shape. Trails will be packed this morning. Expect snow surface to be a little soft given all the recent snowfall.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's another mid-winter ski day at Nub's Nob with beautiful conditions. We only received a dusting of natural snow last night, but more snow is in the air this morning. The ski surface is so good right now. The Marker/Dalbello/Volkl Speed Series is tonight at 7 PM. Please sign up for this rest online prior to 3 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 18\"",
      "ytd": "YTD: 91\""
    }
  }
}