{
  "timestamp": "2026-01-04T08:00:41.793Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1767513600000,
          "temp": 18,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 18, with temperatures rising to around 20 overnight. West northwest wind around 3 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1767524400000,
          "temp": 29,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 29, with temperatures falling to around 27 in the afternoon. West wind around 6 mph."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1767567600000,
          "temp": 21,
          "snowfall": 65,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely after 7pm. Mostly cloudy. Low around 21, with temperatures rising to around 25 overnight. South wind around 5 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1767610800000,
          "temp": 35,
          "snowfall": 65,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely then Mostly Cloudy",
          "detailedForecast": "Snow likely before 7am. Mostly cloudy, with a high near 35. South southwest wind around 7 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1767513600000,
          "temp": 17,
          "snowfall": 19,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow. Mostly cloudy. Low around 17, with temperatures rising to around 21 overnight. Northwest wind 5 to 10 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Sunday",
          "timestamp": 1767524400000,
          "temp": 24,
          "snowfall": 17,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow before 7am. Mostly cloudy, with a high near 24. West wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1767567600000,
          "temp": 20,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 5 to 9 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow between 7pm and 5am, then snow and patchy freezing drizzle. Cloudy. Low around 20, with temperatures rising to around 25 overnight. South wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 5 to 9 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Monday",
          "timestamp": 1767610800000,
          "temp": 32,
          "snowfall": 89,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow then Patchy Freezing Drizzle",
          "detailedForecast": "Snow and patchy freezing drizzle before 10am, then patchy freezing drizzle and a slight chance of snow between 10am and 1pm. Mostly cloudy, with a high near 32. South wind around 5 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible. Little or no ice accumulation expected."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1767513600000,
          "temp": 16,
          "snowfall": 39,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy. Low around 16, with temperatures rising to around 19 overnight. Northwest wind around 5 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Sunday",
          "timestamp": 1767524400000,
          "temp": 23,
          "snowfall": 34,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A chance of snow before 7am. Mostly cloudy, with a high near 23. West wind around 5 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1767567600000,
          "temp": 19,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow between 7pm and 3am, then snow and patchy freezing drizzle. Cloudy. Low around 19, with temperatures rising to around 24 overnight. South wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Monday",
          "timestamp": 1767610800000,
          "temp": 32,
          "snowfall": 89,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow then Patchy Freezing Drizzle",
          "detailedForecast": "Snow and patchy freezing drizzle before 10am, then patchy freezing drizzle and a slight chance of snow between 10am and 1pm. Mostly cloudy, with a high near 32. Southwest wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible. Little or no ice accumulation expected."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 31",
      "conditions": "Bucks Run will be open for skiing tomorrow but will not be groomed. The building will be open for its usual hours. The park says that the next possible groom date is January 2nd. At 3:30 today it's snowing really hard and the trail is filling in nicely. Might be a good classic day as the track is rock solid and once it's skied in a little bit it should be good. Not so sure about skating for tomorrow."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Dec 31",
      "conditions": "Lots of lake effect snow !  Firm groom this AM was covered this afternoon with 2 to 3 inches of fairly light snow resulting in a pleasant skiable skate deck . The  classic tracks look great and those skiers were moving fast . The best access is through Valley road dead end as the Lodge side is very busy with the downhill crowd ."
    }
  },
  "nubsNob": {
    "date": "1/3/26",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power tilled and tracked this morning. Conditions are excellent",
    "nightSkiing": "Tonight from 5:30 to 9:00 p.m.",
    "comments": "It's a beautiful Saturday for skiing. The snow surface is extremely good thanks to fresh snow over the last few days and the mercury staying below freezing. Pintail Peak is open with food and an espresso bar. The soup of the day is \"It's in There\" and it is not to be missed. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 to groom for night skiing. Make it a great day at Nub's.",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 17\"",
      "ytd": "YTD: 65\""
    }
  }
}