{
  "timestamp": "2025-12-29T20:00:44.153Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767038400000,
          "temp": 30,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Cloudy. High near 30, with temperatures falling to around 26 in the afternoon. West northwest wind around 24 mph, with gusts as high as 45 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767049200000,
          "temp": 20,
          "snowfall": 23,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy, with a low around 20. West northwest wind 16 to 23 mph, with gusts as high as 43 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 27,
          "snowfall": 26,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers then Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow. Mostly cloudy, with a high near 27. West wind 12 to 16 mph, with gusts as high as 29 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1767135600000,
          "temp": 22,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 22. West wind 6 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767038400000,
          "temp": 21,
          "snowfall": 71,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Blowing Snow",
          "detailedForecast": "Blowing snow and a chance of snow showers before 4pm, then a chance of snow showers and patchy blowing snow. Cloudy. High near 21, with temperatures falling to around 18 in the afternoon. Wind chill values as low as -1. Northwest wind 20 to 25 mph, with gusts as high as 50 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767049200000,
          "temp": 16,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Cloudy, with a low around 16. Wind chill values as low as 0. Northwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 21,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 21. Wind chill values as low as 0. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1767135600000,
          "temp": 15,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 15. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767038400000,
          "temp": 21,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers and blowing snow. Cloudy. High near 21, with temperatures falling to around 16 in the afternoon. Wind chill values as low as -2. Northwest wind 20 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767049200000,
          "temp": 13,
          "snowfall": 65,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow then Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 7pm, then patchy blowing snow and scattered snow showers. Mostly cloudy. Low around 13, with temperatures rising to around 15 overnight. Wind chill values as low as -2. Northwest wind 20 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 20,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 20. Wind chill values as low as -3. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1767135600000,
          "temp": 15,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 15. West wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run is closed due to poor conditions and wind damage.",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 27",
      "conditions": "Highly variable, but decent conditions this morning for skate and classic. If you're looking to get out and ski, do it this afternoon; the park has already decided to close for tomorrow. Given how thin the snow coverage is it's doubtful they'll be able to reopen until they spread more snow, and based on past practices, that's unlikely to happen until after New Year . But check anyways in case we get lucky."
    }
  },
  "nubsNob": {
    "date": "12/29/25 - Closed On Temporary Wind Hold",
    "liftsOpen": "At least 5 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power tilled and tracked this morning.",
    "nightSkiing": "5:30 - 9:00 p.m. tonight",
    "comments": "Nub's Nob terrain and chairlifts are currently closed on a temporary wind hold. We will reopen as soon as it is safe to do so. At this point we hope to resume operations for the night session, if not earlier. Please stay tuned for updates and we apologize for any inconvenience.",
    "snowData": {
      "daily": "6\" and counting",
      "threeDays": "3 days: 6\"",
      "sevenDays": "7 days: 6\"",
      "ytd": "YTD: 54\""
    }
  }
}