{
  "timestamp": "2025-12-07T12:00:43.102Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765108800000,
          "temp": 32,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy. High near 32, with temperatures falling to around 27 in the afternoon. Northwest wind 2 to 9 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765148400000,
          "temp": 14,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 14. North wind 3 to 7 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1765191600000,
          "temp": 27,
          "snowfall": 6,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 27, with temperatures falling to around 24 in the afternoon. East wind around 5 mph."
        },
        {
          "name": "Monday Night",
          "timestamp": 1765234800000,
          "temp": 16,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1am. Mostly cloudy, with a low around 16. South wind 2 to 8 mph, with gusts as high as 18 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765108800000,
          "temp": 22,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow before 1pm, then scattered snow showers. Mostly cloudy. High near 22, with temperatures falling to around 19 in the afternoon. Northwest wind 5 to 15 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765148400000,
          "temp": 3,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy, with a low around 3. Northeast wind 0 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1765191600000,
          "temp": 24,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. High near 24, with temperatures falling to around 22 in the afternoon. South wind 0 to 10 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Monday Night",
          "timestamp": 1765234800000,
          "temp": 16,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1am, then snow. Mostly cloudy, with a low around 16. South wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765108800000,
          "temp": 21,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow before 1pm, then a chance of snow showers. Mostly cloudy. High near 21, with temperatures falling to around 16 in the afternoon. Northwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765148400000,
          "temp": -5,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Partly Cloudy",
          "detailedForecast": "A chance of snow showers before 7pm. Partly cloudy, with a low around -5. Wind chill values as low as -5. Northwest wind 0 to 10 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1765191600000,
          "temp": 21,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 21. Wind chill values as low as -4. Southwest wind 0 to 10 mph."
        },
        {
          "name": "Monday Night",
          "timestamp": 1765234800000,
          "temp": 12,
          "snowfall": 88,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Isolated Snow Showers",
          "detailedForecast": "Isolated snow showers between 7pm and 1am, then snow. Mostly cloudy, with a low around 12. Wind chill values as low as -1. South wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 6",
      "conditions": "Not bad considering how early in the season it is. some grassy spots that you can get around easily. the loop behind Bucks is real nice for skating. not enough snow for tracks though. some areas do have leaves but not terrible. worth going, enjoy!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Nubs Nob is not yet open for its down hill program : coming this weekend . But the groomers jumped the gun on the Nordic Trails . Access through Valley road to the red and blue loops are currently primo !"
    }
  },
  "nubsNob": {
    "date": "12/07/25",
    "liftsOpen": "4 lifts, Rope Tow and Space Worm",
    "xcTrails": "All trails are open and in excellent condition. The upper trails were power-tilled and tracked yesterday and the lower trails will be power-tilled and tracked this morning.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "It's a beautiful day to be a skier at Nub's Nob. All of the runs on the frontside are open today with the exception of the glades. The snow is groomed corduroy with a nice dusting of natural snow on top. The temperature will remain below 25 degrees today but the wind is light and should make for comfortable skiing. The lifts will turn from 9:00 a.m. to 4:30 p.m. There is a mini park at the bottom of Dories Bowl. The soup du jour is cheddar asparagus. The cross country trails are freshly groomed. Make it a great day at Nub's Nob.\n\nWe will be open daily for skiing and riding beginning on December 12.",
    "snowData": {
      "daily": "Heavy Dusting",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 19\"",
      "ytd": "YTD: 27\""
    }
  }
}