{
  "timestamp": "2025-02-16T20:00:46.696Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1739736000000,
          "temp": 30,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 30, with temperatures falling to around 25 in the afternoon. Northwest wind around 14 mph, with gusts as high as 25 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739746800000,
          "temp": 12,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 12, with temperatures rising to around 14 overnight. West northwest wind around 13 mph, with gusts as high as 24 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Washington's Birthday",
          "timestamp": 1739790000000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Partly sunny. High near 18, with temperatures falling to around 14 in the afternoon. Wind chill values as low as -1. West wind 10 to 14 mph, with gusts as high as 25 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1739833200000,
          "temp": 2,
          "snowfall": 0,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers then Partly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Partly cloudy, with a low around 2. Wind chill values as low as -8. West northwest wind 6 to 10 mph, with gusts as high as 21 mph. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1739732400000,
          "temp": 18,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. High near 18, with temperatures falling to around 15 in the afternoon. North wind around 15 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739746800000,
          "temp": 3,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow then Chance Snow Showers",
          "detailedForecast": "Snow before 7pm, then a chance of snow showers. Cloudy. Low around 3, with temperatures rising to around 5 overnight. Wind chill values as low as -8. Northwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Washington's Birthday",
          "timestamp": 1739790000000,
          "temp": 10,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 10, with temperatures falling to around 8 in the afternoon. Wind chill values as low as -11. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1739833200000,
          "temp": 1,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Partly cloudy, with a low around 1. Wind chill values as low as -14. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1739732400000,
          "temp": 18,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. High near 18, with temperatures falling to around 15 in the afternoon. North wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739746800000,
          "temp": 2,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow then Snow Showers Likely",
          "detailedForecast": "Snow before 7pm, then snow showers likely. Cloudy. Low around 2, with temperatures rising to around 4 overnight. Wind chill values as low as -8. Northwest wind 5 to 10 mph, with gusts as high as 25 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Washington's Birthday",
          "timestamp": 1739790000000,
          "temp": 9,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. High near 9, with temperatures falling to around 7 in the afternoon. Wind chill values as low as -13. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1739833200000,
          "temp": -2,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around -2. Wind chill values as low as -16. Northwest wind 10 to 15 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 16, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  For today, February 16, 2025 grooming for classic ski and skate ski will take place on Coyote Run and Hawks Hill while Cedar Trace will be rolled only."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be open on 2/15 and 2/16.  Golf course and Shelden Trails are currently groomed.  Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Feb 14",
      "conditions": "Skated the golf course this morning.  Skating was great, a little soft in spots, some grassy stubble, but no complaints!  Groomer was setting classic tracks on Coyote while I was there, they looked very grassy, so would not recommend classic (except on Buck's) unless you like skiing in the skate lane.  Cedar trace was also rolled.  Hawk's (south golf course) was pretty great for skate, but I skipped the \"grotto of tears\" which looked too hairy for me."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Feb 12",
      "conditions": "Being the very first on the groom today , I am biased : but boy oh boy it is nice at Nubs Nob ! LF 6"
    }
  },
  "nubsNob": {
    "date": "2/16/25",
    "liftsOpen": "All 8 lifts, Rope Tow, and the Space Worm",
    "xcTrails": "Trails are open and in great shape. All trails will be groomed and tracked this morning.",
    "nightSkiing": "Special Night skiing session from 5:30 to 9:00 PM tonight!",
    "comments": "It's a great day to ski or ride at Nub's Nob. Over four inches of snow fell on the slopes yesterday and last night. The majority of that fresh snow has now been groomed into the base further improving conditions. The slopes, XC trails, and the snowshoe trail are all in mid-winter condition. Chairlifts will be spinning from 9 AM to 9 PM today with an hour break at 4:30 PM to groom for night skiing. Eric Jaqua will play the Nub's Pub at 3:30 PM. Pintail Peak Lodge is open with a deli and an espresso bar until 3:30 PM. Bundle up and make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 121\""
    }
  }
}