{
  "timestamp": "2025-02-17T10:00:48.482Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739786400000,
          "temp": 12,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 12, with temperatures rising to around 14 overnight. West wind around 10 mph, with gusts as high as 21 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Washington's Birthday",
          "timestamp": 1739790000000,
          "temp": 18,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers then Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow showers and a slight chance of snow between 7am and 11am, then a chance of snow and a chance of snow showers. Mostly cloudy. High near 18, with temperatures falling to around 14 in the afternoon. Wind chill values as low as -1. West wind 10 to 15 mph, with gusts as high as 28 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1739833200000,
          "temp": 2,
          "snowfall": 0,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Light Snow then Partly Cloudy",
          "detailedForecast": "A slight chance of snow before 7pm. Partly cloudy, with a low around 2. Wind chill values as low as -10. West northwest wind 7 to 12 mph, with gusts as high as 23 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1739876400000,
          "temp": 16,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 16. Wind chill values as low as -10. West northwest wind 7 to 10 mph, with gusts as high as 18 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739786400000,
          "temp": 1,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 1, with temperatures rising to around 6 overnight. Wind chill values as low as -6. Northwest wind around 5 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Washington's Birthday",
          "timestamp": 1739790000000,
          "temp": 11,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. High near 11, with temperatures falling to around 9 in the afternoon. Wind chill values as low as -11. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1739833200000,
          "temp": 1,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 1, with temperatures rising to around 4 overnight. Wind chill values as low as -13. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1739876400000,
          "temp": 12,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Partly sunny, with a high near 12. Wind chill values as low as -15. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739786400000,
          "temp": 1,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 1, with temperatures rising to around 6 overnight. Wind chill values as low as -6. West wind around 5 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Washington's Birthday",
          "timestamp": 1739790000000,
          "temp": 10,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. High near 10, with temperatures falling to around 8 in the afternoon. Wind chill values as low as -8. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1739833200000,
          "temp": -2,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around -2, with temperatures rising to around 1 overnight. Wind chill values as low as -14. Northwest wind around 10 mph. Chance of precipitation is 90%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1739876400000,
          "temp": 12,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 12. Wind chill values as low as -17. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be open on 2/15 and 2/16.  Golf course and Shelden Trails are currently groomed.  Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 16, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  For today, February 16, 2025 grooming for classic ski and skate ski will take place on Coyote Run and Hawks Hill while Cedar Trace will be rolled only."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Feb 12",
      "conditions": "Being the very first on the groom today , I am biased : but boy oh boy it is nice at Nubs Nob ! LF 6"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Feb 16",
      "conditions": "Good snow coverage but strong north winds making it a little cool out on the open trails. Nice in the wood protected area. Classic tracks and skating lines were in good shape where protected from the wind. Kudos to the ski centre staff for doing such a great job with rentals, snack bar and general advice on a fairly busy day. Huron Meadows deserves a lot of credit for keeping cross country skiing going in the Metro Detroit area."
    }
  },
  "nubsNob": {
    "date": "2/16/25",
    "liftsOpen": "All 8 lifts, Rope Tow, and the Space Worm",
    "xcTrails": "Trails are open and in great shape. All trails will be groomed and tracked this morning.",
    "nightSkiing": "Special Night skiing session from 5:30 to 9:00 PM tonight!",
    "comments": "It's a great day to ski or ride at Nub's Nob. Over four inches of snow fell on the slopes yesterday and last night. The majority of that fresh snow has now been groomed into the base further improving conditions. The slopes, XC trails, and the snowshoe trail are all in mid-winter condition. Chairlifts will be spinning from 9 AM to 9 PM today with an hour break at 4:30 PM to groom for night skiing. Eric Jaqua will play the Nub's Pub at 3:30 PM. Pintail Peak Lodge is open with a deli and an espresso bar until 3:30 PM. Bundle up and make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 121\""
    }
  }
}