{
  "timestamp": "2025-04-14T09:00:30.917Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1744621200000,
          "temp": 45,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Mostly cloudy. Low around 45, with temperatures rising to around 47 overnight. South southeast wind around 8 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1744624800000,
          "temp": 69,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Mostly cloudy, with a high near 69. South southwest wind 8 to 22 mph, with gusts as high as 36 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1744668000000,
          "temp": 40,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Rain Showers",
          "detailedForecast": "A slight chance of rain showers. Partly cloudy. Low around 40, with temperatures rising to around 44 overnight. West wind 14 to 21 mph, with gusts as high as 33 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1744711200000,
          "temp": 45,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Mostly cloudy, with a high near 45. West northwest wind 17 to 24 mph, with gusts as high as 37 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1744621200000,
          "temp": 45,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy. Low around 45, with temperatures rising to around 47 overnight. South wind around 10 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1744624800000,
          "temp": 53,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely before 2pm. Mostly cloudy. High near 53, with temperatures falling to around 50 in the afternoon. Southwest wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1744668000000,
          "temp": 31,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Rain Showers then Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers between 8pm and 1am, then rain and snow showers. Mostly cloudy. Low around 31, with temperatures rising to around 33 overnight. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1744711200000,
          "temp": 34,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 34. Northwest wind 15 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1744621200000,
          "temp": 42,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy. Low around 42, with temperatures rising to around 45 overnight. South wind around 5 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1744624800000,
          "temp": 57,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Mostly cloudy. High near 57, with temperatures falling to around 54 in the afternoon. Southwest wind 5 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1744668000000,
          "temp": 29,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Rain Showers then Snow Showers",
          "detailedForecast": "A chance of rain showers before 1am, then snow showers. Cloudy. Low around 29, with temperatures rising to around 31 overnight. West wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1744711200000,
          "temp": 32,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 32. Northwest wind 15 to 25 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "4/7/25: Closed for the season",
    "liftsOpen": "0",
    "xcTrails": "Closed for the season",
    "nightSkiing": "Done for the season",
    "comments": "Thank you for making 2024-25 another great season! Stay tuned for updates, we look forward to having you back next year.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 0\"",
      "ytd": "YTD: 152\""
    }
  }
}