{
  "timestamp": "2026-01-19T09:04:33.814Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768813200000,
          "temp": 16,
          "snowfall": 58,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy. Low around 16, with temperatures rising to around 21 overnight. Southwest wind around 8 mph, with gusts as high as 18 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 20,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy. High near 20, with temperatures falling to around 17 in the afternoon. West southwest wind 9 to 16 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1768863600000,
          "temp": 6,
          "snowfall": 26,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy, with a low around 6. Wind chill values as low as -6. West wind 7 to 14 mph, with gusts as high as 28 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 17,
          "snowfall": 22,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow before 1pm. Mostly cloudy, with a high near 17. Wind chill values as low as -7. West southwest wind 5 to 12 mph, with gusts as high as 21 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768813200000,
          "temp": 11,
          "snowfall": 75,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 11. Wind chill values as low as -1. West wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 15,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers before 10am, then snow showers likely and patchy blowing snow. Mostly cloudy. High near 15, with temperatures falling to around 9 in the afternoon. Wind chill values as low as -9. Northwest wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1768863600000,
          "temp": 3,
          "snowfall": 66,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 3, with temperatures rising to around 5 overnight. Wind chill values as low as -14. Northwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 13,
          "snowfall": 33,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 13. Wind chill values as low as -14. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768813200000,
          "temp": 11,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy, with a low around 11. Wind chill values as low as -3. Southwest wind around 10 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1768820400000,
          "temp": 14,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 14, with temperatures falling to around 9 in the afternoon. Wind chill values as low as -8. West wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1768863600000,
          "temp": 1,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 1, with temperatures rising to around 3 overnight. Wind chill values as low as -14. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 9,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 9. Wind chill values as low as -15. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Jan 18",
      "conditions": "Bucks Run was firm and fast this afternoon as there had been a lot of skiers on the course.  When I arrived around 4 pm the parking lot was jammed and there were a lot of skiers on the trail.  Conditions should remain very good with the potential snow later tonight and colder temps in the forecast.    Great job by the Huron Meadows crew!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Jan 15",
      "conditions": "Skiing is awesome with a 24\" base of natural snow and daily power tilling.  All trails are open.  Save $20 on race registration by registering online at SKIREG.com by 10 pm tonight!"
    }
  },
  "nubsNob": {
    "date": "1/18/26",
    "liftsOpen": "All 8 chairlifts, conveyor and the rope tow.",
    "xcTrails": "Trails will be power-tilled and tracked this morning. There is a classic race on the upper Red at 10 a.m. this morning.",
    "nightSkiing": "Special night skiing session this Sunday from 5:30 to 9:00 p.m.",
    "comments": "The skiers paradise continues at Nub's Nob. A bit of fresh snow overnight and continued snowfall today should make for excellent conditions. NASTAR racing is open to the public at 12:30 on Birch Run. Pintail Peak Lodge is open with food and an espresso bar. The soup of the day is polish sausage with sauerkraut. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 to groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 8\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 88\""
    }
  }
}