{
  "timestamp": "2025-05-17T00:00:52.245Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1747440000000,
          "temp": 58,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms then Showers And Thunderstorms Likely",
          "detailedForecast": "A chance of showers and thunderstorms between 9pm and 11pm, then showers and thunderstorms likely between 11pm and 5am, then a slight chance of showers and thunderstorms. Mostly cloudy. Low around 58, with temperatures rising to around 60 overnight. South southwest wind around 13 mph, with gusts as high as 22 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1747476000000,
          "temp": 64,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of showers and thunderstorms. Partly sunny, with a high near 64. West southwest wind 12 to 18 mph, with gusts as high as 32 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1747519200000,
          "temp": 49,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers then Mostly Cloudy",
          "detailedForecast": "A chance of rain showers before 8pm. Mostly cloudy. Low around 49, with temperatures rising to around 51 overnight. West wind 15 to 18 mph, with gusts as high as 31 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1747562400000,
          "temp": 65,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 65. Northwest wind 9 to 15 mph, with gusts as high as 25 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1747440000000,
          "temp": 50,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms. Mostly cloudy. Low around 50, with temperatures rising to around 55 overnight. South wind around 10 mph. Chance of precipitation is 80%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1747476000000,
          "temp": 56,
          "snowfall": 70,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms then Patchy Fog",
          "detailedForecast": "A chance of showers and thunderstorms before 7am, then patchy fog and a chance of showers and thunderstorms between 7am and 8am, then patchy fog and scattered rain showers. Mostly cloudy. High near 56, with temperatures falling to around 54 in the afternoon. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1747519200000,
          "temp": 43,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Mostly cloudy, with a low around 43. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%."
        },
        {
          "name": "Sunday",
          "timestamp": 1747562400000,
          "temp": 52,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Rain Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of rain showers before 8am. Mostly cloudy, with a high near 52. Northwest wind around 10 mph. Chance of precipitation is 20%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1747440000000,
          "temp": 51,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Scattered Showers And Thunderstorms then Showers And Thunderstorms",
          "detailedForecast": "Scattered showers and thunderstorms before 11pm, then showers and thunderstorms. Mostly cloudy. Low around 51, with temperatures rising to around 55 overnight. South wind 10 to 15 mph. Chance of precipitation is 80%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1747476000000,
          "temp": 57,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers and patchy fog. Mostly cloudy. High near 57, with temperatures falling to around 55 in the afternoon. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1747519200000,
          "temp": 41,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Mostly cloudy, with a low around 41. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%."
        },
        {
          "name": "Sunday",
          "timestamp": 1747562400000,
          "temp": 53,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Rain Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of rain showers before 8am. Mostly cloudy, with a high near 53. Northwest wind around 10 mph. Chance of precipitation is 20%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "4/7/25: Closed for the season",
    "liftsOpen": "0",
    "xcTrails": "Closed for the season",
    "nightSkiing": "Done for the season",
    "comments": "Thank you for making 2024-25 another great season! Stay tuned for updates, we look forward to having you back next year.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 0\"",
      "ytd": "YTD: 152\""
    }
  }
}