{
  "timestamp": "2025-01-16T21:00:41.930Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737061200000,
          "temp": 32,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow. Mostly cloudy, with a high near 32. West wind around 9 mph, with gusts as high as 21 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1737068400000,
          "temp": 21,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow before 7pm. Mostly cloudy, with a low around 21. West wind 5 to 9 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1737111600000,
          "temp": 34,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 34, with temperatures falling to around 32 in the afternoon. South southwest wind 5 to 17 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Friday Night",
          "timestamp": 1737154800000,
          "temp": 31,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Mostly Cloudy then Rain And Snow",
          "detailedForecast": "Rain and snow after 1am. Mostly cloudy, with a low around 31. South southwest wind 8 to 17 mph, with gusts as high as 32 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737061200000,
          "temp": 34,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Mostly cloudy. High near 34, with temperatures falling to around 31 in the afternoon. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737068400000,
          "temp": 25,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 1am. Mostly cloudy. Low around 25, with temperatures rising to around 27 overnight. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1737111600000,
          "temp": 38,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow between 10am and 4pm, then a chance of rain showers. Cloudy, with a high near 38. Southwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1737154800000,
          "temp": 22,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers before 7pm, then a chance of rain and snow showers. Cloudy, with a low around 22. West wind around 20 mph, with gusts as high as 35 mph. Chance of precipitation is 50%."
        }
      ]
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark": {
      "lastUpdated": "Thu, Jan 16",
      "conditions": "Perfect conditions for skating and classic on Bucks Run. Golf course is not groomed and no info on whether it will be before the weekend."
    },
    "Shelby Township": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    },
    "Nubs Nob": {
      "lastUpdated": "Sat, Jan 11",
      "conditions": "Best conditions of the year on the upper Red and Blue loops ! Thank you Mother Nature , Nubs Nob , and John Baker . It was like skiing on butter ."
    }
  },
  "nubsNob": {
    "date": "1/16/25",
    "liftsOpen": "5 Lifts and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be packed this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM",
    "comments": "It is an ideal ski day at Nub's Nob. There is a bit of fluff sitting on top of the groom. The temperature is just below freezing and conditions are exceptional. The lifts will spin from 9:00 AM to 9:00 PM today with an hour break beginning at 4:30 to prepare for the night session. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 17\"",
      "sevenDays": "7 days: 19\"",
      "ytd": "YTD: 71\""
    }
  }
}