{
  "timestamp": "2026-01-08T12:00:46.323Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767870000000,
          "temp": 48,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Widespread Fog then Mostly Cloudy",
          "detailedForecast": "Widespread fog before 8am. Mostly cloudy, with a high near 48. South southeast wind 5 to 9 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1767913200000,
          "temp": 46,
          "snowfall": 95,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers after 7pm. Cloudy. Low around 46, with temperatures rising to around 54 overnight. South southeast wind 7 to 16 mph, with gusts as high as 29 mph. Chance of precipitation is 100%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1767956400000,
          "temp": 58,
          "snowfall": 95,
          "snowAmount": "",
          "shortForecast": "Rain Showers then Light Rain Likely",
          "detailedForecast": "Rain showers before 7am, then rain likely. Mostly cloudy. High near 58, with temperatures falling to around 45 in the afternoon. West southwest wind 10 to 18 mph, with gusts as high as 32 mph. Chance of precipitation is 100%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1767999600000,
          "temp": 32,
          "snowfall": 22,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain then Mostly Cloudy",
          "detailedForecast": "A slight chance of rain before 7pm. Mostly cloudy, with a low around 32. North wind 2 to 9 mph, with gusts as high as 21 mph. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767873600000,
          "temp": 41,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 41. South wind around 5 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1767913200000,
          "temp": 39,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers after 7pm. Cloudy. Low around 39, with temperatures rising to around 44 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1767956400000,
          "temp": 42,
          "snowfall": 91,
          "snowAmount": "",
          "shortForecast": "Rain And Snow Showers Likely",
          "detailedForecast": "Rain showers before 11am, then rain and snow showers likely. Mostly cloudy. High near 42, with temperatures falling to around 33 in the afternoon. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%."
        },
        {
          "name": "Friday Night",
          "timestamp": 1767999600000,
          "temp": 21,
          "snowfall": 17,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Mostly cloudy, with a low around 21. North wind 5 to 10 mph. Chance of precipitation is 20%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1767873600000,
          "temp": 41,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Patchy Fog",
          "detailedForecast": "Patchy fog before 2pm. Partly sunny, with a high near 41. South wind around 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1767913200000,
          "temp": 39,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers after 7pm. Cloudy. Low around 39, with temperatures rising to around 45 overnight. South wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1767956400000,
          "temp": 45,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Rain And Snow Showers Likely",
          "detailedForecast": "Rain showers before 11am, then rain and snow showers likely. Mostly cloudy. High near 45, with temperatures falling to around 33 in the afternoon. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%."
        },
        {
          "name": "Friday Night",
          "timestamp": 1767999600000,
          "temp": 20,
          "snowfall": 24,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Mostly cloudy, with a low around 20. Northeast wind 5 to 10 mph. Chance of precipitation is 20%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Jan 5",
      "conditions": "All loops are far better than they need to be for Wonderful Skiing !"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Jan 7",
      "conditions": "Frosty Freestyle and Krazy Klassic races this coming weekend??????As David Glasgow Farragut said in the battle of 1864 Battle of Mobile Bay: \"Damn the torpedoes ... full speed ahead.\" Yes, we running our races! We fully expect the Buck's Run to survive the weather. The trail has a solid ice base and the could ground is keeping it frozen. There are also piles of man-made snow ready for action. The course WILL, however, start in the woods on Buck's Run. The loop will be one mile. The longer race will be 6 laps (I can't count any higher), and the short race will be 3 laps, both days. Are we Krazy? Of course we are! But the race must go on.Chip timing.Prizes from Hammer Nutrition and Dough Mom's for everyone. Special awards for age group and overall winners. Four Toko bags and two cooler bags/backpacks for door prizes. Lunch for everyone!Be Krazy! Talk about this weekend for years to come!"
    }
  },
  "nubsNob": {
    "date": "1/7/26",
    "liftsOpen": "5 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails are in great shape with a classic track. We will not groom today or tomorrow with the warm temperature.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "Despite the temperature, there is snow in the air this morning, but stranger things have happened before. All of our runs are open today and conditions and coverage are very good. The soup of the day breaks conformity by adding blue cheese to tomato bacon soup. The lifts spin 9:00 a.m. to 9:00 p.m. today. The gate to Pintail Peak Lodge is open with food and an espresso bar. Grab your best friends and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 18\"",
      "ytd": "YTD: 72\""
    }
  }
}