{
  "timestamp": "2025-12-30T03:28:19.002Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1767063600000,
          "temp": 20,
          "snowfall": 18,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy, with a low around 20. West northwest wind around 18 mph, with gusts as high as 35 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 27,
          "snowfall": 26,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers then Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow. Mostly cloudy, with a high near 27. West wind 12 to 16 mph, with gusts as high as 29 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1767135600000,
          "temp": 22,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy, with a low around 22. West wind 6 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1767178800000,
          "temp": 28,
          "snowfall": 72,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy, with a high near 28. West wind 7 to 12 mph, with gusts as high as 23 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1767063600000,
          "temp": 16,
          "snowfall": 38,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a low around 16. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 21,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 21. Wind chill values as low as 0. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1767135600000,
          "temp": 15,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 15, with temperatures rising to around 18 overnight. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1767178800000,
          "temp": 19,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 19. Wind chill values as low as -1. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1767063600000,
          "temp": 13,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely and patchy blowing snow. Cloudy. Low around 13, with temperatures rising to around 15 overnight. Wind chill values as low as -2. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 20,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 20. Wind chill values as low as -3. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1767135600000,
          "temp": 15,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 15. West wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1767178800000,
          "temp": 18,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 18. Wind chill values as low as -1. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run is closed due to poor conditions and wind damage.",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 27",
      "conditions": "Highly variable, but decent conditions this morning for skate and classic. If you're looking to get out and ski, do it this afternoon; the park has already decided to close for tomorrow. Given how thin the snow coverage is it's doubtful they'll be able to reopen until they spread more snow, and based on past practices, that's unlikely to happen until after New Year . But check anyways in case we get lucky."
    }
  },
  "nubsNob": {
    "date": "12/29/25",
    "liftsOpen": "At least 5 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power tilled and tracked this morning.",
    "nightSkiing": "5:30 - 9:00 p.m. tonight",
    "comments": "After a wind hold this afternoon we will open for night skiing. The lifts will spin from 5:30 p.m. to 9:00 p.m. The Grooming Crew is out preparing the slopes and grooming in the fresh snow to improve conditions for this evening. The wind is still up, but is has dropped significantly from this afternoon. Make it a great night at Nub's Nob.",
    "snowData": {
      "daily": "6\" and counting",
      "threeDays": "3 days: 6\"",
      "sevenDays": "7 days: 6\"",
      "ytd": "YTD: 54\""
    }
  }
}