{
  "timestamp": "2025-01-29T05:00:40.311Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738126800000,
          "temp": 29,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 29, with temperatures rising to around 33 overnight. West wind 14 to 17 mph, with gusts as high as 38 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 32,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Partly sunny. High near 32, with temperatures falling to around 30 in the afternoon. West northwest wind 14 to 20 mph, with gusts as high as 38 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1738191600000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Isolated Snow Showers then Mostly Cloudy",
          "detailedForecast": "Isolated snow showers before 7pm. Mostly cloudy. Low around 18, with temperatures rising to around 20 overnight. West southwest wind 2 to 10 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Thursday",
          "timestamp": 1738234800000,
          "temp": 40,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 40. South southwest wind 3 to 10 mph, with gusts as high as 21 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1738123200000,
          "temp": 17,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Cloudy. Low around 17, with temperatures rising to around 23 overnight. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 20,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. High near 20, with temperatures falling to around 17 in the afternoon. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1738191600000,
          "temp": 12,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 12, with temperatures rising to around 18 overnight. West wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1738234800000,
          "temp": 37,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers then Mostly Sunny",
          "detailedForecast": "A slight chance of snow showers before 7am. Mostly sunny, with a high near 37. Southwest wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1738123200000,
          "temp": 18,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Cloudy. Low around 18, with temperatures rising to around 22 overnight. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 21,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow showers and patchy blowing snow. Mostly cloudy. High near 21, with temperatures falling to around 18 in the afternoon. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1738191600000,
          "temp": 10,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1am. Mostly cloudy. Low around 10, with temperatures rising to around 14 overnight. West wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1738234800000,
          "temp": 37,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 37. Southwest wind 5 to 15 mph, with gusts as high as 35 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 28, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Golf course trails, Hawk Hills and Coyote Run, were rolled on January 24, 2025.  When skiing the golf course trails please ski on designated marked trails only.  All other trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Jan 28",
      "conditions": "The red & blue trails were groomed up nicely after yesterday's snowfall. We skate skied both this morning while the current round of snow was falling which slowed things down a lot."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Jan 28",
      "conditions": "If you’re looking for a sign that you should get out here before bucks opens this is it.  Variable conditions, rolled trail is harder packed and very thin south of clubhouse. North side is better coverage.  Some good crust on fairways.  Worth it for classic at least."
    }
  },
  "nubsNob": {
    "date": "1/28/25",
    "liftsOpen": "6 lifts and the rope tow",
    "xcTrails": "Trails are open. We are recovering from the windstorm yesterday by picking sticks off the trail and grooming. Trails should be in pretty good shape by this afternoon.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a calm start to the morning with a very light breeze. Three inches of snow landed at Nub's Nob last night and conditions continue to be mid-winter excellent. The forecast is predicting a few more inches of snow this afternoon. The snow total for the season has just exceeded the amount of snow we received all of last winter and it's not even February. The lifts will spin from 9:00 AM to 9:00 PM today with an hour break at 4:30 PM so we can prepare for night skiing. Make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "3\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 17\"",
      "ytd": "YTD: 97\""
    }
  }
}