{
  "timestamp": "2025-11-25T10:00:44.372Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764064800000,
          "temp": 43,
          "snowfall": 26,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy, with a low around 43. South southeast wind around 3 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1764068400000,
          "temp": 51,
          "snowfall": 94,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers. Cloudy, with a high near 51. Southeast wind around 6 mph. Chance of precipitation is 90%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1764111600000,
          "temp": 38,
          "snowfall": 65,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy. Low around 38, with temperatures rising to around 46 overnight. South southwest wind 2 to 7 mph. Chance of precipitation is 70%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 50,
          "snowfall": 53,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain Showers then Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers before noon, then a chance of rain and snow showers. Mostly cloudy, with a high near 50. Southwest wind 8 to 23 mph, with gusts as high as 47 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764064800000,
          "temp": 42,
          "snowfall": 52,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy, with a low around 42. South wind around 5 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1764068400000,
          "temp": 48,
          "snowfall": 52,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy. High near 48, with temperatures falling to around 45 in the afternoon. Southeast wind around 5 mph. Chance of precipitation is 50%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1764111600000,
          "temp": 41,
          "snowfall": 96,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers. Cloudy, with a low around 41. Southeast wind 5 to 10 mph. Chance of precipitation is 100%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 44,
          "snowfall": 96,
          "snowAmount": "",
          "shortForecast": "Rain Showers then Rain And Snow Showers",
          "detailedForecast": "Rain showers before 4pm, then rain and snow showers. Cloudy, with a high near 44. Southwest wind 10 to 15 mph. Chance of precipitation is 100%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764064800000,
          "temp": 38,
          "snowfall": 28,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy. Low around 38, with temperatures rising to around 40 overnight. South wind around 5 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1764068400000,
          "temp": 47,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy. High near 47, with temperatures falling to around 44 in the afternoon. South wind around 5 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1764111600000,
          "temp": 39,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers. Cloudy. Low around 39, with temperatures rising to around 42 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 90%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 43,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Rain And Snow Showers",
          "detailedForecast": "Rain showers before 11am, then rain and snow showers. Cloudy, with a high near 43. Southwest wind 10 to 15 mph. Chance of precipitation is 90%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "11/19/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The Snow Crew turned the guns on last night. Despite some cold temperatures in the area the conditions at Nub's Nob allowed for only a few hours of quality snowmaking. The team is here around the clock, ready for the next opportunity. At this point it looks like there is a turn toward colder weather right around Thanksgiving. We will continue to update the blog to keep you up to date. Think COLD and SNOW.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 5\"",
      "ytd": "YTD: 5\""
    }
  }
}