{
  "timestamp": "2025-02-12T19:00:39.957Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1739386800000,
          "temp": 29,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. High near 29, with temperatures falling to around 27 in the afternoon. East northeast wind around 12 mph, with gusts as high as 22 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739401200000,
          "temp": 24,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow. Cloudy. Low around 24, with temperatures rising to around 26 overnight. North wind 6 to 12 mph, with gusts as high as 23 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1739444400000,
          "temp": 30,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely before 1pm, then a chance of snow showers. Mostly cloudy. High near 30, with temperatures falling to around 26 in the afternoon. West northwest wind 10 to 14 mph, with gusts as high as 24 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1739487600000,
          "temp": 11,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Partly Cloudy",
          "detailedForecast": "A chance of snow showers before 7pm. Partly cloudy, with a low around 11. West wind 6 to 13 mph, with gusts as high as 25 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1739386800000,
          "temp": 21,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely before 4pm, then snow. Cloudy, with a high near 21. East wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739401200000,
          "temp": 11,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 11, with temperatures rising to around 13 overnight. Northeast wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1739444400000,
          "temp": 21,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy. High near 21, with temperatures falling to around 17 in the afternoon. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1739487600000,
          "temp": 4,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Slight Chance Snow Showers",
          "detailedForecast": "A chance of snow before 7pm, then a slight chance of snow showers between 7pm and 1am. Mostly cloudy, with a low around 4. Wind chill values as low as -6. Northwest wind 10 to 15 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1739386800000,
          "temp": 21,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 4pm, then snow. Cloudy, with a high near 21. East wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739401200000,
          "temp": 10,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 10, with temperatures rising to around 13 overnight. Northeast wind around 5 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1739444400000,
          "temp": 20,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy. High near 20, with temperatures falling to around 18 in the afternoon. Wind chill values as low as 0. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1739487600000,
          "temp": 3,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow then Snow Showers Likely",
          "detailedForecast": "Snow before 7pm, then snow showers likely. Mostly cloudy, with a low around 3. Wind chill values as low as -6. West wind 5 to 15 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 12, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/8 and 2/9.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Feb 11",
      "conditions": "Bucks Run was in great shape this afternoon....skate deck was wide, firm and fast and there were two or three tracks around the entire loop.  Hats off and a big thank you to the grooming team!   Hopefully Bucks Run will be complemented by the snow storm tomorrow and the other trails on the golf course are skiable as well."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 10",
      "conditions": "Nubs Red and Blue loops have deep base snow , great layered grooming , and a nice skiff of new snow on top . Excellent skiing today with LF Blue"
    }
  },
  "nubsNob": {
    "date": "2/12/25",
    "liftsOpen": "At least 5 lifts, Rope Tow, and the Space Worm",
    "xcTrails": "Trails are open and in great shape. Trails were power-tilled and tracked on Sunday. Trails were packed again on Tuesday.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a cold start to the ski day but the forecast calls for a high in the low 20's today. Over an inch of fresh snow landed at Nub's yesterday afternoon and conditions continue to be superb. More snow is predicted for this afternoon and tonight. Pintail Peak lodge is open until 3:30 PM. The Lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 PM to prepare for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 10\"",
      "ytd": "YTD: 111\""
    }
  }
}