{
  "timestamp": "2025-03-05T00:00:52.351Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1741132800000,
          "temp": 42,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers. Cloudy. Low around 42, with temperatures rising to around 47 overnight. Southeast wind 8 to 13 mph, with gusts as high as 26 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1741172400000,
          "temp": 58,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Rain showers before 10am, then showers and thunderstorms. Mostly cloudy. High near 58, with temperatures falling to around 52 in the afternoon. South wind around 14 mph, with gusts as high as 33 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1741215600000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Showers And Thunderstorms then Rain And Snow Showers",
          "detailedForecast": "Showers and thunderstorms before 1am, then rain and snow showers. Cloudy. Low around 28, with temperatures rising to around 30 overnight. West southwest wind 9 to 17 mph, with gusts as high as 31 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1741258800000,
          "temp": 39,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers then Partly Sunny",
          "detailedForecast": "Snow showers before 7am. Partly sunny, with a high near 39. West northwest wind 14 to 20 mph, with gusts as high as 39 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1741132800000,
          "temp": 35,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain and patchy fog. Cloudy. Low around 35, with temperatures rising to around 37 overnight. East wind 5 to 10 mph. Chance of precipitation is 100%. New rainfall amounts between three quarters and one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1741172400000,
          "temp": 38,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain and areas of fog. Cloudy. High near 38, with temperatures falling to around 36 in the afternoon. Northeast wind 10 to 15 mph. Chance of precipitation is 100%. New rainfall amounts between three quarters and one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1741215600000,
          "temp": 16,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Rain likely and patchy fog before 7pm, then rain showers between 7pm and 8pm, then sleet between 8pm and 9pm, then snow showers. Cloudy, with a low around 16. Wind chill values as low as 0. North wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1741258800000,
          "temp": 28,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A chance of snow showers before 7am. Partly sunny, with a high near 28. Wind chill values as low as 0. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1741132800000,
          "temp": 34,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain and areas of fog. Cloudy. Low around 34, with temperatures rising to around 37 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1741172400000,
          "temp": 44,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain and patchy fog. Cloudy. High near 44, with temperatures falling to around 41 in the afternoon. Southeast wind 5 to 10 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1741215600000,
          "temp": 14,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Rain likely and patchy fog before 7pm, then rain showers and patchy fog between 7pm and 9pm, then freezing rain between 9pm and 10pm, then snow showers and sleet. Cloudy, with a low around 14. Wind chill values as low as -3. Northwest wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday",
          "timestamp": 1741258800000,
          "temp": 27,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely before 1pm. Mostly cloudy, with a high near 27. Wind chill values as low as -3. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail was last groomed for classic and skate ski on March 2, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125. Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Due to the warm, rainy weather, trails have deteriorated and are not suitable for skiing."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Mar 3",
      "conditions": "Some of the best skating of the season.  Hard skate deck, freshly groomed, fast but plenty of control.  Single classic track from building and into woods.  The last loop is not tracked, but there is a cutoff straight to the small hill that is tracked.  Lots of leaves with wind, especially in the tracks on the connector.Thanks HM for keeping us going this season."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sun, Mar 2",
      "conditions": "Red and Blue loops are hard packed and fast with a light skiff of new . There is some wind debris: but no more than minor agility training . LF 7"
    }
  },
  "nubsNob": {
    "date": "3/4/25",
    "liftsOpen": "5  lifts",
    "xcTrails": "Trails were groomed and tracked on Saturday. Trails will not be groomed until the temperature goes below freezing.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "The warm temperature this morning combined with wet snow yesterday and evaporation has created firm snow. Our Grooming Crew is back out this morning to improve conditions. Please be aware that some slick spots will be encountered today and that not all slopes will ski the same. The lifts will spin from 9 AM to 9 PM. Despite the change in weather, make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 2\"",
      "ytd": "YTD: 130\""
    }
  }
}