{
  "timestamp": "2025-01-20T07:00:36.539Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737356400000,
          "temp": 4,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 4, with temperatures rising to around 6 overnight. Wind chill values as low as -10. West wind around 10 mph, with gusts as high as 18 mph."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1737370800000,
          "temp": 10,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 7am. Partly sunny, with a high near 10. Wind chill values as low as -11. West wind 8 to 17 mph, with gusts as high as 23 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1737414000000,
          "temp": 0,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 0, with temperatures rising to around 2 overnight. Wind chill values as low as -12. West southwest wind 7 to 13 mph, with gusts as high as 23 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1737457200000,
          "temp": 8,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A chance of snow showers before 7am. Partly sunny, with a high near 8. Wind chill values as low as -11. West southwest wind 7 to 10 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737356400000,
          "temp": 6,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 6, with temperatures rising to around 9 overnight. Wind chill values as low as -5. Northwest wind around 10 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1737370800000,
          "temp": 11,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 11. Wind chill values as low as -8. West wind 10 to 15 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1737414000000,
          "temp": 3,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 3, with temperatures rising to around 6 overnight. Wind chill values as low as -9. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1737457200000,
          "temp": 10,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 10. Wind chill values as low as -14. West wind 10 to 15 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail was groomed for skate and classic skiing today, January 19th, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Plenty of lake effect , combined with low 20 degree temps, plus the full big groom this morning , makes Nubs Knob red and blue trails as nice as it gets !"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Jan 19",
      "conditions": "Skated Bucks Run today mid afternoon. It was a great day. Lightning fast. Red Swix wax!Thank you to the staff. You keep making the best out of whatever nature gives us. Loop is 2.2km."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    }
  },
  "nubsNob": {
    "date": "1/19/25",
    "liftsOpen": "All 8 Lifts, Space Worm and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be packed this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM. Extra night session Sunday, January 19 from 5:30 to 9:00 PM as well.",
    "comments": "It's a cold day with a high around 12 degrees predicted. Despite the temperature the wind is light and this is the kind of cold you can dress for and still have a great day on the slopes. The snow surface is in excellent shape. Expect a firm base that has great grip for carving turns. A little fresh snow landed this morning which will further improve the ski conditions. Fresh cold snow can often make skis feel slow, stop by the Tune Center for a quick wax job for those ski and board bases. NASTAR racing is open to the public today from 12:30 to 2:30 PM on Birch Run, please sign-up at the Front Desk. The Tweed Tones will be playing at 3:30 PM in the Nub's Pub. The lifts spin from 9:00 AM to 9:00 PM today with an hour break beginning at 4:30 to prepare for the night session. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 19\"",
      "ytd": "YTD: 73\""
    }
  }
}