{
  "timestamp": "2025-03-14T13:05:08.362Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1741950000000,
          "temp": 67,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 67. Southeast wind 6 to 12 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1741989600000,
          "temp": 54,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Light Rain",
          "detailedForecast": "Rain likely between 3am and 5am, then rain and a slight chance of thunderstorms. Mostly cloudy, with a low around 54. South southeast wind 10 to 14 mph, with gusts as high as 24 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742032800000,
          "temp": 71,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Light Rain",
          "detailedForecast": "Rain and a slight chance of thunderstorms before 5pm, then a chance of thunderstorms and a chance of rain. Mostly cloudy, with a high near 71. South wind 14 to 22 mph, with gusts as high as 44 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742076000000,
          "temp": 49,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Chance T-storms then Rain",
          "detailedForecast": "A chance of thunderstorms and a chance of rain before 8pm, then rain and a chance of thunderstorms. Mostly cloudy, with a low around 49. South wind 8 to 20 mph, with gusts as high as 38 mph. Chance of precipitation is 90%. New rainfall amounts between three quarters and one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1741950000000,
          "temp": 65,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 65, with temperatures falling to around 63 in the afternoon. Southeast wind 5 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1741989600000,
          "temp": 50,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms after 5am. Mostly cloudy, with a low around 50. Southeast wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742032800000,
          "temp": 64,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms. Partly sunny. High near 64, with temperatures falling to around 60 in the afternoon. South wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742076000000,
          "temp": 33,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Mostly cloudy, with a low around 33. Southwest wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 30%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1741950000000,
          "temp": 66,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 66. South wind 10 to 15 mph, with gusts as high as 25 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1741989600000,
          "temp": 50,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Showers And Thunderstorms",
          "detailedForecast": "Isolated rain showers between 2am and 5am, then showers and thunderstorms. Mostly cloudy, with a low around 50. Southeast wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742032800000,
          "temp": 65,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Showers And Thunderstorms",
          "detailedForecast": "Showers and thunderstorms before 5pm, then a slight chance of showers and thunderstorms. Partly sunny. High near 65, with temperatures falling to around 62 in the afternoon. South wind 15 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 80%."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742076000000,
          "temp": 35,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of showers and thunderstorms. Mostly cloudy, with a low around 35. Southwest wind 5 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 40%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run ski trail was groomed today, March 9, 2025. Grass has started to show and the north loop of the trail is completely unusable at this time.  The current trail is approximately .5 km.  There is an additional $5 daily trail fee for the use of Bucks Run. Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours. Buck’s Run last day is Sunday, March 9, 2025."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Mar 8",
      "conditions": "Skated Bucks today 10:30 AM - 1:45 PM. Lots of fun. Fast and controllable. The connector was groomed but hard and icy under the groom.  Still very usable. Very little forest debris.  Much less than up north last weekend. No dirt spots even when a few turns started to soften in the sun around 12:30.  Soft turns later in the morning were not that slow. Watch out for some small ice balls that sometimes end up in the skate lanes.  Very avoidable. The hills and turn through the pines in the back is still part of the trail.  Very nice!  Used A skis. Should be great tomorrow morning after the groom.  Thank you Huron Meadows crew. Great job!  Came over from Lansing today thanks to your efforts.Check out XC Ski Headquarters up north at Higgins Lake tomorrow.  You don’t have to be on the official team to participate in the Michigan cup relays. And the trails up there have been very good the last couple mornings. Thanks for 50 years of family service and winter fun XC HQ team!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 10",
      "conditions": "Nubs has plenty of coverage , depth , and groom on the upper loops. The sweet spot between hard and soft was 10:30 to 1:00. A little bit of wind debris , but not an issue . LF 8 rilled"
    }
  },
  "nubsNob": {
    "date": "3/14/25",
    "liftsOpen": "5 Lifts, Rope Tow and Space Worm",
    "xcTrails": "Trails were groomed and tracked on Wednesday. Conditions will be very good this morning and too soft in the afternoon.",
    "nightSkiing": "Done for the season.",
    "comments": "A spring warm up is forecast today. The snow is machine groomed this morning and will quickly transition to wet spring snow by the late morning. The temperature is forecast to hit 60 degrees today. If you have ever had a goal to ski in the morning and bike in the afternoon, today is your day. Pintail Peak lodge is open with food and an espresso bar. The lifts will spin from 9 AM to 4:30 PM today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 1\"",
      "ytd": "YTD: 135\""
    }
  }
}