{
  "timestamp": "2025-12-09T17:02:24.941Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765299600000,
          "temp": 35,
          "snowfall": 31,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Patchy Freezing Drizzle",
          "detailedForecast": "Patchy freezing drizzle and a slight chance of snow before 1pm, then a chance of snow and patchy freezing drizzle between 1pm and 3pm. Cloudy, with a high near 35. South southwest wind around 13 mph, with gusts as high as 23 mph. Chance of precipitation is 30%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765321200000,
          "temp": 30,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow between 10pm and 3am, then rain and snow. Cloudy. Low around 30, with temperatures rising to around 34 overnight. South southwest wind 6 to 9 mph, with gusts as high as 20 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1765364400000,
          "temp": 38,
          "snowfall": 94,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow before 10am, then rain and snow. Cloudy. High near 38, with temperatures falling to around 31 in the afternoon. West wind around 13 mph, with gusts as high as 23 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1765407600000,
          "temp": 17,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely before 1am. Partly cloudy, with a low around 17. Northwest wind 7 to 12 mph, with gusts as high as 23 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765299600000,
          "temp": 28,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely and areas of freezing drizzle. Cloudy, with a high near 28. West wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tonight",
          "timestamp": 1765321200000,
          "temp": 19,
          "snowfall": 44,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Slight Chance Snow Showers then Chance Snow",
          "detailedForecast": "A slight chance of snow showers before 7pm, then a chance of snow. Mostly cloudy. Low around 19, with temperatures rising to around 23 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of 1 to 3 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Wednesday",
          "timestamp": 1765364400000,
          "temp": 26,
          "snowfall": 44,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow then Chance Snow Showers",
          "detailedForecast": "A chance of snow before 10am, then a chance of snow showers between 10am and 1pm. Mostly cloudy. High near 26, with temperatures falling to around 22 in the afternoon. North wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1765407600000,
          "temp": 19,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 7pm. Mostly cloudy, with a low around 19. Northwest wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765299600000,
          "temp": 27,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely and areas of freezing drizzle before 1pm, then areas of freezing drizzle and a chance of snow showers. Cloudy, with a high near 27. Southwest wind 10 to 15 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tonight",
          "timestamp": 1765321200000,
          "temp": 18,
          "snowfall": 72,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Slight Chance Snow Showers then Heavy Snow Likely",
          "detailedForecast": "A slight chance of snow showers before 7pm, then snow likely. Cloudy. Low around 18, with temperatures rising to around 21 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Wednesday",
          "timestamp": 1765364400000,
          "temp": 26,
          "snowfall": 72,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Heavy Snow Likely then Chance Snow Showers",
          "detailedForecast": "Snow likely before 10am, then a chance of snow showers between 10am and 1pm. Cloudy. High near 26, with temperatures falling to around 20 in the afternoon. North wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1765407600000,
          "temp": 14,
          "snowfall": 66,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 7pm. Mostly cloudy, with a low around 14. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Dec 8",
      "conditions": "MAN-MADE SNOW IS BEING ADDED TO BUCK'S RUN!  Tony Percha and I arrived at Huron Meadows at 7:45am this morning. A brisk 7 degrees out but no wind..we could see the snow plum.from.one of the snowmaking guns in the distance. As we put our boots on, the groomer came by setting fresh corduroy over the inch or two of new snow that fell last last night. Conditions were a little faster than I expected given the temps.We skied over to the section of Coyote Run that loops through the trees behind Buck's Run for an easy ski. I also wanted to donate speed workout (10-15 second all-out sprints). The trail was in great shape. We could hear equipment running and all of a sudden the park's material hauler came out on the trail heading back to the snow pile for more snow! We of course got way off the trail to let it by - we certainly didn't not want to slow him down! Fingers crossed - maybe Buck's Run will be open this weekend!"
    }
  },
  "nubsNob": {
    "date": "12/09/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning December 12. The Snow Crew is making rapid progress and we plan to have all of the frontside and southside runs open by December 13. Pintail Peak should open by December 20. Thanks for skiing at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 27\""
    }
  }
}