{
  "timestamp": "2026-01-14T17:04:25.166Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1768410000000,
          "temp": 39,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy. High near 39, with temperatures falling to around 23 in the afternoon. Northwest wind around 14 mph, with gusts as high as 24 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1768431600000,
          "temp": 11,
          "snowfall": 54,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy, with a low around 11. Wind chill values as low as -2. Northwest wind around 13 mph, with gusts as high as 25 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1768474800000,
          "temp": 20,
          "snowfall": 34,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow then Partly Sunny",
          "detailedForecast": "A chance of snow before 10am. Partly sunny, with a high near 20. Wind chill values as low as -3. Northwest wind 7 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1768518000000,
          "temp": 13,
          "snowfall": 23,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1am. Mostly cloudy, with a low around 13. West southwest wind 3 to 8 mph. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1768410000000,
          "temp": 18,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Cloudy. High near 18, with temperatures falling to around 11 in the afternoon. Wind chill values as low as -6. North wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1768431600000,
          "temp": 1,
          "snowfall": 43,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers then Mostly Cloudy",
          "detailedForecast": "Scattered snow showers before 10pm. Mostly cloudy. Low around 1, with temperatures rising to around 3 overnight. Wind chill values as low as -12. North wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1768474800000,
          "temp": 14,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 14, with temperatures falling to around 11 in the afternoon. Wind chill values as low as -12. Northwest wind 5 to 10 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1768518000000,
          "temp": 9,
          "snowfall": 48,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7pm. Mostly cloudy, with a low around 9. Wind chill values as low as -2. South wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1768410000000,
          "temp": 18,
          "snowfall": 72,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Cloudy. High near 18, with temperatures falling to around 9 in the afternoon. Wind chill values as low as -8. North wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1768431600000,
          "temp": 0,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 10pm. Mostly cloudy, with a low around 0. Wind chill values as low as -17. North wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1768474800000,
          "temp": 12,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 12, with temperatures falling to around 10 in the afternoon. Wind chill values as low as -16. Northwest wind 5 to 10 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1768518000000,
          "temp": 6,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 7pm. Mostly cloudy, with a low around 6. Wind chill values as low as -3. Southwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Jan 13",
      "conditions": "Bucks Run only: the metro parks website states Bucks is groomed for skate and classic. While technically true, it was groomed yesterday, not today. So with the slushing up in the warm sunshine yesterday and the overnight freeze, the classic tracks are icy and debris filled. Skate deck is hard and fast. Would be nice if the groomers would use those 2 big piles of snow, but rumor has it they are short staffed this week."
    }
  },
  "nubsNob": {
    "date": "1/14/26",
    "liftsOpen": "5 chairlifts and the rope tow.",
    "xcTrails": "Trails will be power tilled and tracked before noon today.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "The snow froze solid after the slopes were groomed early this morning. We are now grooming the slopes a second time to create the best conditions we can today. This second groom will mean a slightly delayed opening for Pintail Peak. If you venture off the groomed areas expect to find icy snow. On the groomed areas the skiing should be good. Pintail Peak Lodge will be open with food service and an espresso bar. The lifts will spin from 9:00 a.m. to 9:00 p.m. today with an hour break at 4:30 p.m. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 7\"",
      "ytd": "YTD: 80\""
    }
  }
}