{
  "timestamp": "2025-09-23T02:24:43.528Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1758592800000,
          "temp": 61,
          "snowfall": 38,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers before 2am, then a chance of rain showers and patchy fog. Mostly cloudy, with a low around 61. South southwest wind around 2 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1758621600000,
          "temp": 79,
          "snowfall": 54,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers then Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of rain showers and patchy fog before 8am, then patchy fog and a slight chance of rain showers between 8am and 2pm, then a chance of showers and thunderstorms. Mostly cloudy. High near 79, with temperatures falling to around 77 in the afternoon. Southwest wind 2 to 6 mph. Chance of precipitation is 50%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1758664800000,
          "temp": 60,
          "snowfall": 54,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of showers and thunderstorms before 8pm, then a chance of showers and thunderstorms. Mostly cloudy, with a low around 60. East northeast wind 1 to 5 mph. Chance of precipitation is 50%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1758708000000,
          "temp": 71,
          "snowfall": 61,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of rain showers before 8am, then a chance of showers and thunderstorms between 8am and 2pm, then showers and thunderstorms likely. Cloudy, with a high near 71. East northeast wind 2 to 7 mph. Chance of precipitation is 60%. New rainfall amounts between a quarter and half of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1758592800000,
          "temp": 57,
          "snowfall": 45,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of showers and thunderstorms before 11pm, then patchy fog and a chance of showers and thunderstorms between 11pm and 2am, then areas of fog and a chance of rain showers. Mostly cloudy. Low around 57, with temperatures rising to around 60 overnight. South wind 0 to 5 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1758621600000,
          "temp": 69,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Widespread Fog then Chance Rain Showers",
          "detailedForecast": "Widespread fog and a chance of rain showers before 10am, then a chance of rain showers and patchy fog. Mostly cloudy. High near 69, with temperatures falling to around 67 in the afternoon. North wind 0 to 5 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1758664800000,
          "temp": 55,
          "snowfall": 38,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers before midnight, then a chance of rain showers and patchy fog between midnight and 2am, then areas of fog and a chance of rain showers between 2am and 3am, then a chance of showers and thunderstorms. Mostly cloudy. Low around 55, with temperatures rising to around 57 overnight. Northeast wind around 5 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1758708000000,
          "temp": 67,
          "snowfall": 29,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers then Slight Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of rain showers before 5pm, then a slight chance of showers and thunderstorms. Mostly cloudy, with a high near 67. Northeast wind 5 to 10 mph. Chance of precipitation is 30%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1758592800000,
          "temp": 56,
          "snowfall": 45,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of showers and thunderstorms before midnight, then patchy fog and a chance of showers and thunderstorms between midnight and 2am, then areas of fog and a chance of showers and thunderstorms. Mostly cloudy. Low around 56, with temperatures rising to around 59 overnight. Southwest wind 0 to 5 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1758621600000,
          "temp": 69,
          "snowfall": 44,
          "snowAmount": "",
          "shortForecast": "Widespread Fog then Chance Showers And Thunderstorms",
          "detailedForecast": "Widespread fog and a chance of rain showers before 9am, then a chance of rain showers and patchy fog between 9am and 2pm, then a chance of showers and thunderstorms. Mostly cloudy, with a high near 69. North wind 0 to 5 mph. Chance of precipitation is 40%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1758664800000,
          "temp": 53,
          "snowfall": 44,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of showers and thunderstorms before 11pm, then a chance of rain showers and patchy fog between 11pm and 2am, then areas of fog and a chance of rain showers between 2am and 3am, then a chance of showers and thunderstorms. Mostly cloudy. Low around 53, with temperatures rising to around 56 overnight. Northeast wind 0 to 5 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1758708000000,
          "temp": 67,
          "snowfall": 34,
          "snowAmount": "",
          "shortForecast": "Chance Showers And Thunderstorms",
          "detailedForecast": "A chance of showers and thunderstorms. Mostly cloudy, with a high near 67. Northeast wind 5 to 10 mph. Chance of precipitation is 30%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "4/7/25: Closed for the season",
    "liftsOpen": "0",
    "xcTrails": "Closed for the season",
    "nightSkiing": "Done for the season",
    "comments": "Thank you for making 2024-25 another great season! Stay tuned for updates, we look forward to having you back next year.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 0\"",
      "ytd": "YTD: 152\""
    }
  }
}