{
  "timestamp": "2025-12-23T01:28:36.315Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1766451600000,
          "temp": 32,
          "snowfall": 33,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow then Chance Light Rain",
          "detailedForecast": "A chance of snow before midnight, then a chance of rain between midnight and 1am, then a chance of freezing drizzle and a chance of drizzle. Cloudy. Low around 32, with temperatures rising to around 34 overnight. South wind around 6 mph. Chance of precipitation is 30%. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday",
          "timestamp": 1766487600000,
          "temp": 45,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Chance Drizzle then Mostly Cloudy",
          "detailedForecast": "A chance of drizzle before 7am. Mostly cloudy. High near 45, with temperatures falling to around 43 in the afternoon. West southwest wind 3 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 30%. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1766530800000,
          "temp": 27,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 27, with temperatures rising to around 29 overnight. Northwest wind 2 to 9 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1766574000000,
          "temp": 38,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 38. Northeast wind 2 to 6 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1766451600000,
          "temp": 29,
          "snowfall": 36,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow before 4am, then a chance of snow and a chance of freezing drizzle and a slight chance of drizzle. Cloudy. Low around 29, with temperatures rising to around 32 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday",
          "timestamp": 1766487600000,
          "temp": 35,
          "snowfall": 32,
          "snowAmount": "",
          "shortForecast": "Chance Freezing Drizzle",
          "detailedForecast": "A chance of freezing drizzle and a chance of drizzle before 1pm. Mostly cloudy. High near 35, with temperatures falling to around 33 in the afternoon. West wind 5 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 30%. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1766530800000,
          "temp": 20,
          "snowfall": 5,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 20. Northwest wind 5 to 15 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1766574000000,
          "temp": 31,
          "snowfall": 11,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 31. Southeast wind 0 to 5 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1766451600000,
          "temp": 28,
          "snowfall": 41,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow before 4am, then a chance of snow and a chance of freezing drizzle. Cloudy. Low around 28, with temperatures rising to around 31 overnight. South wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1766487600000,
          "temp": 35,
          "snowfall": 37,
          "snowAmount": "",
          "shortForecast": "Slight Chance Freezing Drizzle",
          "detailedForecast": "A chance of freezing drizzle before 8am, then a slight chance of freezing drizzle and a slight chance of drizzle between 8am and 1pm. Mostly cloudy. High near 35, with temperatures falling to around 32 in the afternoon. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1766530800000,
          "temp": 17,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 17. Northwest wind 5 to 15 mph, with gusts as high as 25 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1766574000000,
          "temp": 30,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 30. Southeast wind 0 to 5 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Dec 16",
      "conditions": "All trails power-tilled flat with a classic track and wide skate deck. Conditions are very good."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Dec 22",
      "conditions": "Hey SK8TR BOIS: please try to keep your ski tips out of the classic tracks on Bucks Run. Instead, use that destructive energy to knock down the little berm the groomer leaves for you on the skate deck - thanksClassic skiers: the man made snow is fast and there is good grip with fish scales going up the “hill” - enjoy!"
    }
  },
  "nubsNob": {
    "date": "12/22/25",
    "liftsOpen": "7 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails are fully open and in good condition with a classic track.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "It's a beautiful start to the day a light wind and a clear sky. The grooming looks excellent and the snow is in good shape. The temperature is forecast to go slightly above freezing this afternoon. Pintail Peak is now open. The Pintail Lodge is open with food and an espresso bar. The soup of the day is broccoli cheddar. The lifts will spin from 9:00 a.m. to 4:30 p.m. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 48\""
    }
  }
}