{
  "timestamp": "2025-03-04T00:00:45.659Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1741046400000,
          "temp": 34,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Slight Chance Light Rain",
          "detailedForecast": "A chance of rain between 9pm and 10pm, then a slight chance of snow between 10pm and 11pm, then a slight chance of rain. Mostly cloudy, with a low around 34. South wind around 7 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1741086000000,
          "temp": 48,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Light Rain Likely",
          "detailedForecast": "Rain likely. Mostly cloudy, with a high near 48. South wind 6 to 9 mph, with gusts as high as 18 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1741129200000,
          "temp": 42,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain. Cloudy. Low around 42, with temperatures rising to around 46 overnight. Southeast wind 6 to 13 mph, with gusts as high as 24 mph. Chance of precipitation is 100%. New rainfall amounts between a half and three quarters of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1741172400000,
          "temp": 59,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain. Mostly cloudy, with a high near 59. South wind 9 to 13 mph, with gusts as high as 24 mph. Chance of precipitation is 100%. New rainfall amounts between a quarter and half of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1741046400000,
          "temp": 31,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Freezing Rain then Rain Showers Likely",
          "detailedForecast": "Freezing rain between 10pm and midnight, then rain showers likely. Mostly cloudy. Low around 31, with temperatures rising to around 34 overnight. Southwest wind 5 to 10 mph. Chance of precipitation is 80%. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday",
          "timestamp": 1741086000000,
          "temp": 39,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy, with a high near 39. South wind around 5 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1741129200000,
          "temp": 36,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain showers likely before 7pm, then rain. Cloudy, with a low around 36. East wind 5 to 10 mph. Chance of precipitation is 100%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1741172400000,
          "temp": 37,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain. Cloudy, with a high near 37. Northeast wind 5 to 15 mph. Chance of precipitation is 100%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1741046400000,
          "temp": 30,
          "snowfall": 70,
          "snowAmount": "",
          "shortForecast": "Freezing Rain Likely",
          "detailedForecast": "A chance of freezing rain between 10pm and 11pm, then freezing rain likely and rain showers likely. Mostly cloudy. Low around 30, with temperatures rising to around 33 overnight. Southwest wind around 10 mph. Chance of precipitation is 70%. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday",
          "timestamp": 1741086000000,
          "temp": 41,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy, with a high near 41. South wind 5 to 10 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1741129200000,
          "temp": 36,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain showers likely before 7pm, then rain. Cloudy, with a low around 36. Southeast wind 5 to 10 mph. Chance of precipitation is 100%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1741172400000,
          "temp": 43,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain. Mostly cloudy, with a high near 43. Northeast wind 5 to 10 mph. Chance of precipitation is 100%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for classic and skate ski today, March 2, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125. Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Due to the warm, rainy weather, trails have deteriorated and are not suitable for skiing."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Mar 3",
      "conditions": "Some of the best skating of the season.  Hard skate deck, freshly groomed, fast but plenty of control.  Single classic track from building and into woods.  The last loop is not tracked, but there is a cutoff straight to the small hill that is tracked.  Lots of leaves with wind, especially in the tracks on the connector.Thanks HM for keeping us going this season."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sun, Mar 2",
      "conditions": "Red and Blue loops are hard packed and fast with a light skiff of new . There is some wind debris: but no more than minor agility training . LF 7"
    }
  },
  "nubsNob": {
    "date": "3/3/25",
    "liftsOpen": "5  lifts, the Space Worm, and the Rope Tow",
    "xcTrails": "Trails were groomed and tracked on Saturday. Conditions are very good.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "The sun is out, the wind is light and the temperature is comfortable for skiing. The coverage on slopes continues to be very good with excellent grooming from our dedicated Crew. The XC trails and snowshoe trails still have plenty of natural snow. Pintail Peak Lodge is open with a deli and an espresso bar. The lifts will spin from 9 AM to 4:30 PM today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 2\"",
      "ytd": "YTD: 130\""
    }
  }
}