{
  "timestamp": "2025-12-08T14:00:36.978Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765202400000,
          "temp": 26,
          "snowfall": 11,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers then Partly Sunny",
          "detailedForecast": "Scattered snow showers before 10am. Partly sunny. High near 26, with temperatures falling to around 24 in the afternoon. East northeast wind around 5 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765234800000,
          "temp": 15,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 15, with temperatures rising to around 18 overnight. South wind 2 to 6 mph."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765278000000,
          "temp": 34,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 11am, then snow and freezing rain. Cloudy, with a high near 34. South southwest wind 8 to 13 mph, with gusts as high as 24 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1765321200000,
          "temp": 29,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "A chance of snow before 7pm, then rain and snow between 7pm and 4am, then rain and snow. Cloudy, with a low around 29. South southwest wind 7 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765202400000,
          "temp": 24,
          "snowfall": 21,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Isolated Snow Showers",
          "detailedForecast": "Isolated snow showers before 1pm. Mostly cloudy, with a high near 24. Southwest wind 0 to 10 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765234800000,
          "temp": 20,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Isolated Snow Showers then Light Snow And Areas Of Blowing Snow",
          "detailedForecast": "Isolated snow showers between 10pm and 1am, then snow and areas of blowing snow. Mostly cloudy. Low around 20, with temperatures rising to around 22 overnight. South wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765278000000,
          "temp": 30,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow And Areas Of Blowing Snow then Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow and areas of blowing snow before 10am, then snow showers and areas of blowing snow between 10am and 1pm, then patchy blowing snow and scattered snow showers. Mostly cloudy, with a high near 30. Southwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1765321200000,
          "temp": 21,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 1am, then snow. Cloudy, with a low around 21. South wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765202400000,
          "temp": 22,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 22, with temperatures falling to around 19 in the afternoon. Wind chill values as low as -4. Southwest wind 5 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765234800000,
          "temp": 15,
          "snowfall": 76,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Mostly Cloudy then Light Snow And Areas Of Blowing Snow",
          "detailedForecast": "Snow and areas of blowing snow after 1am. Mostly cloudy. Low around 15, with temperatures rising to around 19 overnight. South wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765278000000,
          "temp": 30,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow And Areas Of Blowing Snow then Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow and areas of blowing snow before 10am, then snow showers and areas of blowing snow between 10am and 1pm, then patchy blowing snow and scattered snow showers. Mostly cloudy, with a high near 30. Southwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1765321200000,
          "temp": 19,
          "snowfall": 91,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 1am, then snow. Cloudy, with a low around 19. South wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 6",
      "conditions": "Not bad considering how early in the season it is. some grassy spots that you can get around easily. the loop behind Bucks is real nice for skating. not enough snow for tracks though. some areas do have leaves but not terrible. worth going, enjoy!"
    }
  },
  "nubsNob": {
    "date": "12/08/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning December 12. The Snow Crew is making rapid progress and we plan to have all of the frontside and southside runs open by December 13. Thanks for skiing at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 27\""
    }
  }
}