{
  "timestamp": "2025-02-26T02:23:59.411Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740535200000,
          "temp": 30,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 30, with temperatures rising to around 32 overnight. Northwest wind around 5 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1740567600000,
          "temp": 40,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "A chance of rain between 10am and 11am, then rain and snow. Cloudy. High near 40, with temperatures falling to around 38 in the afternoon. South southeast wind 2 to 7 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740610800000,
          "temp": 35,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow",
          "detailedForecast": "Rain likely before 7pm, then a chance of rain and snow between 7pm and 4am, then a chance of rain and snow. Cloudy, with a low around 35. Southwest wind around 7 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1740654000000,
          "temp": 42,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Rain And Snow",
          "detailedForecast": "A chance of rain and snow. Mostly cloudy, with a high near 42. West wind 6 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740531600000,
          "temp": 24,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 24. Southeast wind 0 to 5 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1740567600000,
          "temp": 40,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 40, with temperatures falling to around 38 in the afternoon. Southeast wind around 5 mph."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740610800000,
          "temp": 26,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 1am. Mostly cloudy. Low around 26, with temperatures rising to around 29 overnight. North wind around 5 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1740654000000,
          "temp": 34,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy, with a high near 34. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740531600000,
          "temp": 22,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 22. Southwest wind 0 to 5 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1740567600000,
          "temp": 39,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 39. South wind 5 to 10 mph."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740610800000,
          "temp": 25,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain and snow showers after 7pm. Mostly cloudy. Low around 25, with temperatures rising to around 28 overnight. North wind around 5 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1740654000000,
          "temp": 34,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 34. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will not be groomed today, February 25, 2025, but is in good shape from yesterday.  There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Coyote Run and Cedar Trace were last groomed February 22, 2025 for classic ski and skate ski. Due to deteriorating conditions Hawk Hills will not be groomed today."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 24",
      "conditions": "Lovely blue sky Spring skiing on the Red and Blue loops today . Surprisingly little wind debris . The trail and groom is holding well.  The skate had a bit of suck : but I had rilled and LF 8 worked well."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Feb 24",
      "conditions": "Wanted to ski at Kensington because the site said they groomed the skate lanes today. I appreciate the staff doing this, but after the sun and temps today it was a slush bucket this afternoon. Ended up on Buck’s which matched the earlier comment. Still in great shape but a bit soft in spots. Enjoy it while you can!"
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Sat, Feb 22",
      "conditions": "Skied Stony Creek late in the afternoon on Friday 2/21.  The Golf Course trails to the East of the parking lot was rolled and classic tracks groomed.  They generally groom early on Saturdays for weekend visitors.  Snow was equal to the best you will see in SE lower MI.  Did not ski the trails in the woods West of the parking lot.The park closes at 8:00 PM, so it might be possible to get in some night skiing.  Warmer temps and rain are coming.  Enjoy Stony Creek NOW>"
    }
  },
  "nubsNob": {
    "date": "2/25/25",
    "liftsOpen": "5 lifts and the Rope Tow",
    "xcTrails": "All trails were groomed and tracked on Sunday. Expect softer snow conditions today.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a very comfortable ski day at Nub's with a high temperature expected to reach near 40 degrees. The snow never froze last night so a loose softer snow is to be expected today. Conditions are still very good. Pintail Peak Lodge is open with a deli and an espresso bar until 3:30 PM. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 PM to groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 7\"",
      "ytd": "YTD: 128\""
    }
  }
}