{
  "timestamp": "2025-12-11T22:00:41.230Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765490400000,
          "temp": 28,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Isolated Snow Showers",
          "detailedForecast": "Isolated snow showers. Partly sunny. High near 28, with temperatures falling to around 26 in the afternoon. West wind around 9 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1765494000000,
          "temp": 16,
          "snowfall": 17,
          "snowAmount": "",
          "shortForecast": "Isolated Snow Showers then Mostly Cloudy",
          "detailedForecast": "Isolated snow showers before 8pm. Mostly cloudy, with a low around 16. West northwest wind 2 to 8 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Friday",
          "timestamp": 1765537200000,
          "temp": 29,
          "snowfall": 13,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 29, with temperatures falling to around 24 in the afternoon. West southwest wind around 5 mph."
        },
        {
          "name": "Friday Night",
          "timestamp": 1765580400000,
          "temp": 15,
          "snowfall": 53,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 7pm. Mostly cloudy, with a low around 15. Southwest wind 2 to 9 mph, with gusts as high as 18 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765490400000,
          "temp": 25,
          "snowfall": 11,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 25, with temperatures falling to around 20 in the afternoon. Northwest wind around 5 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765494000000,
          "temp": 13,
          "snowfall": 12,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 13, with temperatures rising to around 18 overnight. Northwest wind around 5 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1765537200000,
          "temp": 28,
          "snowfall": 43,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7am. Mostly cloudy, with a high near 28. Southwest wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1765580400000,
          "temp": 11,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 11. Wind chill values as low as -3. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765490400000,
          "temp": 24,
          "snowfall": 15,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers. Mostly sunny. High near 24, with temperatures falling to around 21 in the afternoon. Northwest wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1765494000000,
          "temp": 6,
          "snowfall": 15,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Mostly cloudy. Low around 6, with temperatures rising to around 11 overnight. West wind 0 to 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Friday",
          "timestamp": 1765537200000,
          "temp": 27,
          "snowfall": 33,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7am. Mostly cloudy, with a high near 27. Southwest wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1765580400000,
          "temp": 9,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 9. Wind chill values as low as -2. Southwest wind 5 to 15 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "Good skating on Hawks, Coyote and Cedar Trace.  Hawks has  a little scrub sticking up.  But the best it has been so far.   All freshly groomed. No tracks.Thank guys."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Dec 10",
      "conditions": "Perfect grooming with the big groomer, trail was excellent on upper red loop. Perfect temperature, fast snow.Have to enter the trail from Valley road."
    }
  },
  "nubsNob": {
    "date": "12/11/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning tomorrow! Thanks to the Snow Farmers we will open tomorrow with all of our Front Side and South Side runs. This will bring our run count to over 30 runs, and Pintail Peak will open by Friday, December 19. This is our earliest full opening in over a decade. The lifts will spin daily from 9 a.m. to 4:30 p.m. with night skiing starting on December 26. Grab your gear and your friends and head to Nub's Nob to enjoy some incredible early season skiing.",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 6\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 33\""
    }
  }
}