{
  "timestamp": "2025-01-27T15:00:45.101Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737990000000,
          "temp": 37,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Sunny",
          "detailedForecast": "Sunny, with a high near 37. Southwest wind 17 to 22 mph, with gusts as high as 41 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1738018800000,
          "temp": 20,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7pm. Mostly cloudy. Low around 20, with temperatures rising to around 24 overnight. West northwest wind 12 to 21 mph, with gusts as high as 40 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 34,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Partly sunny. High near 34, with temperatures falling to around 32 in the afternoon. West wind 6 to 10 mph, with gusts as high as 18 mph. Chance of precipitation is 40%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 28,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 28. Southwest wind around 12 mph, with gusts as high as 24 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737990000000,
          "temp": 31,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 4pm, then a chance of snow showers and patchy blowing snow. Cloudy, with a high near 31. West wind 20 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1738018800000,
          "temp": 9,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy, with a low around 9. Wind chill values as low as -3. Northwest wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 30,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 30, with temperatures falling to around 25 in the afternoon. Wind chill values as low as -2. West wind 5 to 15 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 18,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 18. West wind around 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 7 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1737990000000,
          "temp": 30,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow before 1pm, then patchy blowing snow and scattered snow showers between 1pm and 4pm, then snow showers and patchy blowing snow. Mostly cloudy, with a high near 30. West wind 20 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1738018800000,
          "temp": 6,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy, with a low around 6. Wind chill values as low as -5. Northwest wind 5 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 28, with temperatures falling to around 23 in the afternoon. Wind chill values as low as -3. Southwest wind 5 to 15 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 19,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 19. West wind around 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 7 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 27, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Golf course trails, Hawk Hills and Coyote Run, were rolled on January 24, 2025.  When skiing the golf course trails please ski on designated marked trails only.  All other trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 25",
      "conditions": "The Nubs upper loops are in great  shape with a fresh big groom this morning. LF 7 was the perfect wax of today ."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Jan 26",
      "conditions": "Skied south of Hamel road ungroomed trails.  It had everything!  Snow, scenery, sticks, leaves, and hikers footprints.  Overall though, very skiable this morning while still cold, just don't use your fancy skis.  The snow is compacted so the footprints didn't bother *too* much.  Beautiful day and great to see so many people enjoying the snow.  Buck's run is in great shape, double tracks around most of it.Skied back via Cedar Trace (by the lake).  Do not ski down the first hill (on the left from the parking lot) as there is a large gravel patch."
    }
  },
  "nubsNob": {
    "date": "1/27/25",
    "liftsOpen": "5 lifts and the rope tow",
    "xcTrails": "Trails are open and in great shape with a classic track set. Trails were groomed on Sunday and will be groomed again tomorrow following the wind today.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "The wind is up today from the Southwest today. Snow conditions continue to be very good. Expect to encounter some drifts around the ski area today. We are hosting a middle school ski meet on Birch Run this afternoon. The lifts will spin from 9 AM to 4:30 PM today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 94\""
    }
  }
}