{
  "timestamp": "2026-01-23T13:14:19.041Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1769173200000,
          "temp": 5,
          "snowfall": 6,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 5, with temperatures falling to around 2 in the afternoon. Wind chill values as low as -18. West northwest wind 9 to 13 mph, with gusts as high as 23 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1769209200000,
          "temp": -8,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear. Low around -8, with temperatures rising to around -6 overnight. Wind chill values as low as -17. West northwest wind 3 to 7 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1769252400000,
          "temp": 9,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 9. Wind chill values as low as -8. West southwest wind around 3 mph."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1769295600000,
          "temp": 2,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of snow after 1am. Mostly cloudy, with a low around 2. Wind chill values as low as -4. East wind 1 to 5 mph. Chance of precipitation is 40%."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1769173200000,
          "temp": 2,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Blowing Snow",
          "detailedForecast": "Blowing snow and snow showers likely before 1pm, then a chance of snow showers and patchy blowing snow. Partly sunny, with a high near 2. Wind chill values as low as -25. Northwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769209200000,
          "temp": -4,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am. Mostly cloudy. Low around -4, with temperatures rising to around -1 overnight. Wind chill values as low as -19. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Saturday",
          "timestamp": 1769252400000,
          "temp": 10,
          "snowfall": 17,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Partly Sunny then Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 1pm. Partly sunny, with a high near 10. Wind chill values as low as -13. West wind around 5 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1769295600000,
          "temp": -3,
          "snowfall": 17,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Mostly cloudy, with a low around -3. Wind chill values as low as -14. South wind around 5 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1769173200000,
          "temp": 0,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Partly sunny, with a high near 0. Wind chill values as low as -22. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769209200000,
          "temp": -8,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around -8, with temperatures rising to around -6 overnight. Wind chill values as low as -18. West wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1769252400000,
          "temp": 8,
          "snowfall": 22,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers before 1pm. Partly sunny. High near 8, with temperatures falling to around 6 in the afternoon. Wind chill values as low as -17. Southwest wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1769295600000,
          "temp": -8,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around -8. Wind chill values as low as -16. South wind 0 to 5 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Thu, Jan 22",
      "conditions": "Plenty of snow in woods and on golf course, woods was nicer, less wind. Trail was soft, easy climbing but not much speed on downhills. Only classic tracks were skier produced; it would be nice if the foot traffic would stop walking in the ski tracks."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Jan 22",
      "conditions": "Once the crew at Huron Meadows rolled the trails, it was a little on the soft side but much better than the half a foot of fresh snow that Mike made me ski in on the contractors loop.  Conditions should firm up and be quite good the next few days if you can brave the cold!  Thanks HM crew!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Jan 19",
      "conditions": "Nubs Nob red and blue loop has 18” of hard packed base . Looks like we will be skiing late into the Spring!"
    }
  },
  "nubsNob": {
    "date": "1/23/26",
    "liftsOpen": "5 chairlifts and the conveyor.",
    "xcTrails": "Trails are groomed and tracked.",
    "nightSkiing": "No night skiing tonight. Night ski will resume on Saturday.",
    "comments": "It's a cold day at Nub's Nob. The high temperature is forecast to be around 4 degrees today with a biting windchill, please dress appropriately for the conditions. Due to the forecasted windchill we will ski from 9:00 a.m. to 4:30 p.m. with no night skiing. The slopes are expertly groomed today with quality snow. Expect slow snow today as the cold temperatures create more friction on ski bases. The soup of the day is clam chowder. Pintail Peak Lodge is open with food service and espresso bar. Bundle up and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 12\"",
      "sevenDays": "7 days: 23\"",
      "ytd": "YTD: 106\""
    }
  }
}