{
  "timestamp": "2025-12-08T19:00:45.620Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765220400000,
          "temp": 26,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 26, with temperatures falling to around 24 in the afternoon. East southeast wind around 3 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765234800000,
          "temp": 14,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 14, with temperatures rising to around 17 overnight. Southeast wind 2 to 6 mph."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765278000000,
          "temp": 34,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 11am, then snow and freezing rain. Cloudy, with a high near 34. South southwest wind 7 to 13 mph, with gusts as high as 26 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1765321200000,
          "temp": 29,
          "snowfall": 98,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "A chance of snow before 7pm, then rain and snow between 7pm and 4am, then rain and snow. Cloudy, with a low around 29. South southwest wind 6 to 9 mph, with gusts as high as 21 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765220400000,
          "temp": 24,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 24, with temperatures falling to around 22 in the afternoon. Southwest wind 5 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765234800000,
          "temp": 20,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Mostly Cloudy then Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely and patchy blowing snow after 4am. Mostly cloudy. Low around 20, with temperatures rising to around 23 overnight. South wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765278000000,
          "temp": 30,
          "snowfall": 89,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy, with a high near 30. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1765321200000,
          "temp": 21,
          "snowfall": 73,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 21. Southeast wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765220400000,
          "temp": 23,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 23, with temperatures falling to around 20 in the afternoon. Southwest wind around 5 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1765234800000,
          "temp": 15,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Mostly Cloudy then Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely and patchy blowing snow after 4am. Mostly cloudy. Low around 15, with temperatures rising to around 20 overnight. South wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765278000000,
          "temp": 30,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Cloudy, with a high near 30. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1765321200000,
          "temp": 19,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 19. Southeast wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Dec 8",
      "conditions": "MAN-MADE SNOW IS BEING ADDED TO BUCK'S RUN!  Tony Percha and I arrived at Huron Meadows at 7:45am this morning. A brisk 7 degrees out but no wind..we could see the snow plum.from.one of the snowmaking guns in the distance. As we put our boots on, the groomer came by setting fresh corduroy over the inch or two of new snow that fell last last night. Conditions were a little faster than I expected given the temps.We skied over to the section of Coyote Run that loops through the trees behind Buck's Run for an easy ski. I also wanted to donate speed workout (10-15 second all-out sprints). The trail was in great shape. We could hear equipment running and all of a sudden the park's material hauler came out on the trail heading back to the snow pile for more snow! We of course got way off the trail to let it by - we certainly didn't not want to slow him down! Fingers crossed - maybe Buck's Run will be open this weekend!"
    }
  },
  "nubsNob": {
    "date": "12/08/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning December 12. The Snow Crew is making rapid progress and we plan to have all of the frontside and southside runs open by December 13. Thanks for skiing at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 27\""
    }
  }
}