{
  "timestamp": "2025-02-06T08:00:44.420Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738828800000,
          "temp": 24,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Sleet and freezing rain before 4am, then snow likely and sleet likely and freezing rain likely. Cloudy, with a low around 24. East southeast wind around 8 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday",
          "timestamp": 1738839600000,
          "temp": 36,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "Freezing rain likely before 8am, then a slight chance of freezing drizzle between 8am and 9am, then a slight chance of snow and a slight chance of freezing drizzle between 9am and 11am. Mostly cloudy, with a high near 36. South southwest wind 5 to 17 mph, with gusts as high as 32 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1738882800000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 18, with temperatures rising to around 20 overnight. West wind around 17 mph, with gusts as high as 31 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1738926000000,
          "temp": 28,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 28. West northwest wind 6 to 14 mph, with gusts as high as 23 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738828800000,
          "temp": 16,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Cloudy. Low around 16, with temperatures rising to around 20 overnight. Southeast wind around 5 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Thursday",
          "timestamp": 1738839600000,
          "temp": 30,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely before 1pm, then a chance of snow and patchy blowing snow. Cloudy. High near 30, with temperatures falling to around 24 in the afternoon. South wind 5 to 25 mph, with gusts as high as 40 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1738882800000,
          "temp": 11,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow And Patchy Blowing Snow then Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow and patchy blowing snow before 7pm, then a chance of snow showers and patchy blowing snow between 7pm and 1am, then patchy blowing snow and a slight chance of snow showers. Mostly cloudy, with a low around 11. Wind chill values as low as -6. West wind 20 to 25 mph, with gusts as high as 40 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1738926000000,
          "temp": 19,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A slight chance of snow showers before 7am. Partly sunny, with a high near 19. Wind chill values as low as -5. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738828800000,
          "temp": 15,
          "snowfall": 50,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Cloudy. Low around 15, with temperatures rising to around 19 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 50%."
        },
        {
          "name": "Thursday",
          "timestamp": 1738839600000,
          "temp": 29,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely before 1pm, then a chance of snow and patchy blowing snow between 1pm and 4pm, then patchy blowing snow and a slight chance of snow. Cloudy. High near 29, with temperatures falling to around 23 in the afternoon. Southwest wind 5 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1738882800000,
          "temp": 9,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Patchy Blowing Snow then Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and a slight chance of snow before 7pm, then snow showers and patchy blowing snow. Cloudy, with a low around 9. Wind chill values as low as -7. West wind 15 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Friday",
          "timestamp": 1738926000000,
          "temp": 17,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely then Mostly Cloudy",
          "detailedForecast": "Snow showers likely before 7am. Mostly cloudy, with a high near 17. Wind chill values as low as -6. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 5, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time.  When skiing the golf course trails please ski on designated marked trails only."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/1 and 2/2.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Feb 5",
      "conditions": "Fast machine groomed. Good deep double tracked for classic. Red Toko worked better than my skins. Skating also was fast and easy."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 3",
      "conditions": "This morning’s  snow  was the icing on the cake over a well layered and constructed base . Beautiful groom - well done Nubs crew ! LF 7"
    }
  },
  "nubsNob": {
    "date": "2/5/25",
    "liftsOpen": "At least 5 lifts, Space Worm and the rope tow",
    "xcTrails": "Trails were power-tilled and tracked on Monday morning, and are in great shape.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's another great day to be on skis at Nub's Nob. Thanks to continuous temperatures below freezing along with the work of our Grooming Crew the snow surface continues to be top-notch. Today the temperature should reach 25 degrees with very light wind. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 to prepare for the night session. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 104\""
    }
  }
}