{
  "timestamp": "2025-12-02T21:00:47.239Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764709200000,
          "temp": 31,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 31. West wind around 5 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1764716400000,
          "temp": 22,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 22, with temperatures rising to around 25 overnight. West southwest wind 3 to 9 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764759600000,
          "temp": 32,
          "snowfall": 62,
          "snowAmount": "",
          "shortForecast": "Cloudy then Light Snow Likely",
          "detailedForecast": "Snow likely after 1pm. Cloudy. High near 32, with temperatures falling to around 30 in the afternoon. Southwest wind around 13 mph, with gusts as high as 24 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764802800000,
          "temp": 15,
          "snowfall": 62,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely before 2am. Mostly cloudy, with a low around 15. West wind 8 to 12 mph, with gusts as high as 20 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764709200000,
          "temp": 30,
          "snowfall": 16,
          "snowAmount": "",
          "shortForecast": "Isolated Snow Showers",
          "detailedForecast": "Isolated snow showers. Mostly cloudy. High near 30, with temperatures falling to around 27 in the afternoon. Southwest wind around 10 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1764716400000,
          "temp": 25,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 25, with temperatures rising to around 29 overnight. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764759600000,
          "temp": 32,
          "snowfall": 91,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. High near 32, with temperatures falling to around 25 in the afternoon. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764802800000,
          "temp": 10,
          "snowfall": 82,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 10. Wind chill values as low as -6. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764709200000,
          "temp": 29,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 29, with temperatures falling to around 25 in the afternoon. Southwest wind around 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1764716400000,
          "temp": 21,
          "snowfall": 31,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 4am. Mostly cloudy. Low around 21, with temperatures rising to around 25 overnight. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764759600000,
          "temp": 29,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. High near 29, with temperatures falling to around 23 in the afternoon. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764802800000,
          "temp": 8,
          "snowfall": 88,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 8. Wind chill values as low as -7. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Dec 2",
      "conditions": "All skate trails have been groomed at Huron Meadows. There's quite a bit of stumble showing though on the north and south golf course areas, but Buck's Run, the wooded trail behind Buck's Run, and the \"contractor's loop\" (Cedar Trace Trail) had good snow coverage. No classic track has been set - there's not enough snow. The snow is still soft - it should form up over the next few days. Better than expected early season conditions...and a snow gun is starting to build up a pile of man-made snow!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Nubs Nob is not yet open for its down hill program : coming this weekend . But the groomers jumped the gun on the Nordic Trails . Access through Valley road to the red and blue loops are currently primo !"
    }
  },
  "nubsNob": {
    "date": "12/02/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Trails are being packed today. Not open for skiing as we prepare trails.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today as we focus on snowmaking. We will be open for skiing and riding December 6 and 7 from 9 a.m. to 4:30 p.m. for our first two days of the ski season. Last night and this morning over 8\" of natural snow landed at Nub's Nob and it's still coming down. We are excited to welcome you all back to the slopes on December 6 and 7. We plan to reopen the slopes on December 12 and remain open everyday of the week.",
    "snowData": {
      "daily": "8\"",
      "threeDays": "3 days: 15\"",
      "sevenDays": "7 days: 18\"",
      "ytd": "YTD: 23\""
    }
  }
}