{
  "timestamp": "2025-01-28T14:00:45.603Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1738072800000,
          "temp": 34,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of snow after 1pm. Cloudy, with a high near 34. Southwest wind 3 to 14 mph, with gusts as high as 28 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1738105200000,
          "temp": 29,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Scattered Snow Showers",
          "detailedForecast": "A chance of snow before 7pm, then scattered snow showers. Mostly cloudy. Low around 29, with temperatures rising to around 33 overnight. West southwest wind 14 to 17 mph, with gusts as high as 38 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 32,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Partly sunny. High near 32, with temperatures falling to around 28 in the afternoon. West northwest wind 15 to 20 mph, with gusts as high as 38 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1738191600000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Isolated Snow Showers then Partly Cloudy",
          "detailedForecast": "Isolated snow showers before 7pm. Partly cloudy, with a low around 18. West southwest wind 2 to 13 mph, with gusts as high as 23 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1738072800000,
          "temp": 32,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow. Cloudy. High near 32, with temperatures falling to around 28 in the afternoon. Southwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1738105200000,
          "temp": 17,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow Likely then Snow Showers Likely",
          "detailedForecast": "Snow likely before 7pm, then snow showers likely. Cloudy. Low around 17, with temperatures rising to around 22 overnight. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 23,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 23, with temperatures falling to around 18 in the afternoon. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1738191600000,
          "temp": 12,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 7pm. Mostly cloudy, with a low around 12. West wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1738072800000,
          "temp": 31,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow. Cloudy. High near 31, with temperatures falling to around 28 in the afternoon. Southwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1738105200000,
          "temp": 18,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Snow Likely then Snow Showers",
          "detailedForecast": "Snow likely before 7pm, then snow showers. Cloudy. Low around 18, with temperatures rising to around 23 overnight. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 23,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 23, with temperatures falling to around 19 in the afternoon. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1738191600000,
          "temp": 10,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 10. West wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 28, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Golf course trails, Hawk Hills and Coyote Run, were rolled on January 24, 2025.  When skiing the golf course trails please ski on designated marked trails only.  All other trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 25",
      "conditions": "The Nubs upper loops are in great  shape with a fresh big groom this morning. LF 7 was the perfect wax of today ."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Jan 27",
      "conditions": "Classic skied golf course trails from 1-2:30pm.  They were holding up surprisingly well. Rolling it recently has helped if stay solid.  A few spots where you may want to detour off the trails but generally good coverage, but thin.  Even some decent skier tracks to follow for a good portion.  Tomorrow morning should be some decent crust skiing."
    }
  },
  "nubsNob": {
    "date": "1/28/25",
    "liftsOpen": "6 lifts and the rope tow",
    "xcTrails": "Trails are open. We are recovering from the windstorm yesterday by picking sticks off the trail and grooming. Trails should be in pretty good shape by this afternoon.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a calm start to the morning with a very light breeze. Three inches of snow landed at Nub's Nob last night and conditions continue to be mid-winter excellent. The forecast is predicting a few more inches of snow this afternoon. The snow total for the season has just exceeded the amount of snow we received all of last winter and it's not even February. The lifts will spin from 9:00 AM to 9:00 PM today with an hour break at 5:30 PM so we can prepare for night skiing. Make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "3\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 17\"",
      "ytd": "YTD: 97\""
    }
  }
}