{
  "timestamp": "2025-02-28T17:00:36.874Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1740762000000,
          "temp": 52,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Rain And Snow",
          "detailedForecast": "A slight chance of rain and snow before 1pm. Mostly cloudy, with a high near 52. Southwest wind 17 to 21 mph, with gusts as high as 43 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1740783600000,
          "temp": 20,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain then Slight Chance Light Snow",
          "detailedForecast": "A chance of rain between 7pm and 10pm, then a slight chance of snow between 1am and 4am. Mostly cloudy. Low around 20, with temperatures rising to around 24 overnight. West northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Saturday",
          "timestamp": 1740826800000,
          "temp": 25,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 25, with temperatures falling to around 23 in the afternoon. Northwest wind 13 to 17 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1740870000000,
          "temp": 15,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 15. Northwest wind 5 to 10 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1740762000000,
          "temp": 40,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow before 1pm, then a chance of rain showers between 1pm and 3pm, then a chance of rain and snow showers. Mostly cloudy. High near 40, with temperatures falling to around 35 in the afternoon. Southwest wind around 15 mph, with gusts as high as 45 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1740783600000,
          "temp": 6,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely before 9pm, then snow showers likely and patchy blowing snow. Mostly cloudy, with a low around 6. Wind chill values as low as -13. Northwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1740826800000,
          "temp": 16,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A slight chance of snow showers before 7am. Partly sunny, with a high near 16. Wind chill values as low as -12. North wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1740870000000,
          "temp": 7,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 7. Northwest wind 5 to 10 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1740762000000,
          "temp": 42,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1pm, then a chance of rain showers between 1pm and 2pm, then rain and snow showers likely. Mostly cloudy. High near 42, with temperatures falling to around 37 in the afternoon. Southwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1740783600000,
          "temp": 5,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely before 10pm, then a chance of snow showers and patchy blowing snow. Mostly cloudy, with a low around 5. Wind chill values as low as -13. Northwest wind 15 to 25 mph, with gusts as high as 50 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1740826800000,
          "temp": 15,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly sunny, with a high near 15. Wind chill values as low as -12. Northwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1740870000000,
          "temp": 4,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am. Mostly cloudy, with a low around 4. Wind chill values as low as -2. Northwest wind 5 to 10 mph. Chance of precipitation is 30%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for classic and skate ski today, February 28, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125. Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Due to the warm, rainy weather, trails have deteriorated and are not suitable for skiing."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Feb 27",
      "conditions": "Bucks run still going strong. I recommend. Slushy and slow but holding up. The far lobe is deteriorating quickest but still full coverage as of 1:50 today. I say get it while you can!"
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Sat, Feb 22",
      "conditions": "Skied Stony Creek late in the afternoon on Friday 2/21.  The Golf Course trails to the East of the parking lot was rolled and classic tracks groomed.  They generally groom early on Saturdays for weekend visitors.  Snow was equal to the best you will see in SE lower MI.  Did not ski the trails in the woods West of the parking lot.The park closes at 8:00 PM, so it might be possible to get in some night skiing.  Warmer temps and rain are coming.  Enjoy Stony Creek NOW>"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 24",
      "conditions": "Lovely blue sky Spring skiing on the Red and Blue loops today . Surprisingly little wind debris . The trail and groom is holding well.  The skate had a bit of suck : but I had rilled and LF 8 worked well."
    }
  },
  "nubsNob": {
    "date": "2/28/25",
    "liftsOpen": "At least 6 lifts, the Space Worm, and the Rope Tow",
    "xcTrails": "Trails are open with good coverage. Trails will be groomed and tracked tomorrow morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Nearly an inch of snow has fallen at Nub's this morning and it continues to snow on top of the machine groomed snow. The forecast is calling for some snow to continue to fall today. The snow coverage and depth are very good on all of our snowmaking runs, it still feels like the middle of winter at Nub's Nob. Pintail Peak Lodge is open until 3:30 PM with a deli and an espresso bar. The lifts will spin from 9:00 AM to 9:00 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 2\"",
      "ytd": "YTD: 129\""
    }
  }
}