{
  "timestamp": "2025-01-24T19:00:41.566Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737745200000,
          "temp": 21,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 21. Southwest wind around 7 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1737759600000,
          "temp": 11,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Light Snow Likely",
          "detailedForecast": "A chance of snow showers before 7pm, then snow likely. Mostly cloudy. Low around 11, with temperatures rising to around 14 overnight. South southwest wind 5 to 8 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737802800000,
          "temp": 29,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy, with a high near 29. Southwest wind 8 to 12 mph, with gusts as high as 21 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737846000000,
          "temp": 21,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy, with a low around 21. West wind around 9 mph, with gusts as high as 20 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737745200000,
          "temp": 21,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers before 4pm. Mostly cloudy, with a high near 21. Southwest wind 10 to 15 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1737759600000,
          "temp": 13,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Mostly Cloudy then Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 1am. Mostly cloudy. Low around 13, with temperatures rising to around 21 overnight. Wind chill values as low as -1. South wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737802800000,
          "temp": 32,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely before 9am, then snow showers likely and patchy blowing snow. Cloudy, with a high near 32. Southwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737846000000,
          "temp": 19,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely and patchy blowing snow. Cloudy, with a low around 19. West wind around 20 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 24, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Coyote Run and Hawks Hills ski trails have been rolled. The trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Jan 22",
      "conditions": "Excellent day out classic skiing on skins.  Tracks very good and fast most of the way around in the woods except for a few shallow spots but not down to the dirt.  Tracks blown in on connector with the wind.  Snow gun was running today also."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Jan 23",
      "conditions": "The upper Red Loop is as good as it gets . The Blue Loop has a minor high class issue with too much snow : but that was offset by an untouched thin layer of fresh over a well established under groom - delightful !"
    }
  },
  "nubsNob": {
    "date": "1/24/25",
    "liftsOpen": "7 lifts, Rope Tow, and Space Worm",
    "xcTrails": "Trails are open and in great shape. Trails will be packed this morning. Expect snow surface to be a little soft given all the recent snowfall.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's another mid-winter ski day at Nub's Nob with beautiful conditions. We only received a dusting of natural snow last night, but more snow is in the air this morning. The ski surface is so good right now. The Marker/Dalbello/Volkl Speed Series is tonight at 7 PM. Please sign up for this rest online prior to 3 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 18\"",
      "ytd": "YTD: 91\""
    }
  }
}