{
  "timestamp": "2026-01-17T02:30:32.166Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768615200000,
          "temp": 27,
          "snowfall": 25,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy. Low around 27, with temperatures rising to around 29 overnight. South southwest wind around 9 mph, with gusts as high as 18 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1768647600000,
          "temp": 31,
          "snowfall": 35,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy. High near 31, with temperatures falling to around 24 in the afternoon. Southwest wind 8 to 13 mph, with gusts as high as 22 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1768690800000,
          "temp": 15,
          "snowfall": 24,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Slight Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow before 7pm. Mostly cloudy, with a low around 15. Southwest wind 8 to 13 mph, with gusts as high as 23 mph. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1768734000000,
          "temp": 24,
          "snowfall": 11,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 24. Southwest wind 7 to 12 mph, with gusts as high as 20 mph. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768615200000,
          "temp": 21,
          "snowfall": 51,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Areas Of Freezing Drizzle",
          "detailedForecast": "Areas of freezing drizzle and a chance of snow showers. Cloudy. Low around 21, with temperatures rising to around 24 overnight. Southwest wind around 5 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Saturday",
          "timestamp": 1768647600000,
          "temp": 28,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 28, with temperatures falling to around 25 in the afternoon. West wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1768690800000,
          "temp": 15,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am. Mostly cloudy, with a low around 15. Northwest wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1768734000000,
          "temp": 21,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers after 7am. Mostly cloudy, with a high near 21. Southwest wind 5 to 15 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768615200000,
          "temp": 21,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Areas Of Freezing Drizzle",
          "detailedForecast": "Areas of freezing drizzle and a chance of snow showers. Cloudy. Low around 21, with temperatures rising to around 23 overnight. Southwest wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Saturday",
          "timestamp": 1768647600000,
          "temp": 28,
          "snowfall": 72,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy. High near 28, with temperatures falling to around 25 in the afternoon. West wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1768690800000,
          "temp": 12,
          "snowfall": 72,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 12. West wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1768734000000,
          "temp": 20,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 20. Southwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Jan 15",
      "conditions": "Thursday 4-5pm report. Bucks connector trail has man made and fresh with plenty to glide out to trail with tracks set. New snow also added on north/south section in woods along driving range on Bucks. Fast and hard pack with still some dirty snow and debris in sections. Classic tracks were deep and wide. Friday should be great if they do a nice groom in the morning. 2-3” expected Friday, let’s hope forecasters are accurate this time. Hoping park crew can roll or groom the other trails for Saturday. Thanks HM crew, your hard work is appreciated!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Jan 15",
      "conditions": "Skiing is awesome with a 24\" base of natural snow and daily power tilling.  All trails are open.  Save $20 on race registration by registering online at SKIREG.com by 10 pm tonight!"
    }
  },
  "nubsNob": {
    "date": "1/16/26",
    "liftsOpen": "7 chairlifts, conveyor and the rope tow.",
    "xcTrails": "Trails were power-tilled and tracked this morning conditions are excellent.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m. There is a special night skiing session this Sunday from 5:30 to 9:00 p.m.",
    "comments": "Two inches of light, dry and fluffy snow fell at Nub's this morning. The new snow will further improve the already good conditions. The majority of the snow surface is expertly machine groomed. The temperature will reach the upper 20's today and the wind is light, making for ideal conditions for a day on the slopes. The XC trails are groomed. The soup of the day is clam chowder. Pintail Peak Lodge is open with food and an espresso bar. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 p.m. so we can groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 11\"",
      "ytd": "YTD: 83\""
    }
  }
}