{
  "timestamp": "2025-03-22T07:00:40.777Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742626800000,
          "temp": 32,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain",
          "detailedForecast": "A chance of rain. Mostly cloudy. Low around 32, with temperatures rising to around 42 overnight. Southwest wind around 13 mph, with gusts as high as 29 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742637600000,
          "temp": 38,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Slight Chance Rain And Snow then Chance Snow Showers",
          "detailedForecast": "A chance of rain before 7am, then a slight chance of rain and snow between 7am and 8am, then a chance of snow showers between 8am and 2pm. Partly sunny. High near 38, with temperatures falling to around 36 in the afternoon. Northwest wind 12 to 17 mph, with gusts as high as 28 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742680800000,
          "temp": 25,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 25. North northeast wind 2 to 12 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1742724000000,
          "temp": 44,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Partly Sunny then Rain And Snow Likely",
          "detailedForecast": "Rain likely between 2pm and 5pm, then rain and snow likely. Partly sunny, with a high near 44. East southeast wind 3 to 14 mph, with gusts as high as 24 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742626800000,
          "temp": 15,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 15, with temperatures rising to around 23 overnight. North wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742637600000,
          "temp": 24,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers before 5pm. Partly sunny, with a high near 24. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742680800000,
          "temp": 15,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 15, with temperatures rising to around 18 overnight. South wind 0 to 10 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1742724000000,
          "temp": 38,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers between 8am and 2pm, then rain and snow showers likely. Partly sunny, with a high near 38. Southeast wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742626800000,
          "temp": 15,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy. Low around 15, with temperatures rising to around 24 overnight. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1742637600000,
          "temp": 24,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 5pm. Partly sunny, with a high near 24. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1742680800000,
          "temp": 14,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 14, with temperatures rising to around 16 overnight. Southwest wind 0 to 10 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1742724000000,
          "temp": 37,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Partly Sunny then Snow Showers Likely",
          "detailedForecast": "Snow showers likely between 2pm and 5pm, then rain and snow showers likely. Partly sunny, with a high near 37. Southeast wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Fri, Mar 21",
      "conditions": "6-inches of snow on Thursday and a complete powertilling of the upper loops to World Cup specs this morning. A touch soft today, but should be an amazing 7-10 day stretch starting tomorrow. Huge shoutout to Ben and the entire crew at Nubs for their commitment to Nordic skiing."
    }
  },
  "nubsNob": {
    "date": "3/21/25",
    "liftsOpen": "At least 5 lifts and the Rope Tow.",
    "xcTrails": "Upper Trails will be groomed later today. We are clearing brush from the wind yesterday.",
    "nightSkiing": "Done for the season.",
    "comments": "It looks like a great day to be on skis. The heavy wet snow from yesterday has dried out and the groomed surface is in great shape. We still have excellent coverage on the majority of our terrain. Sunshine and warmth are forecast as the day progresses and should bring spring snow conditions this afternoon. The lifts will spin from 9:00 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 7\"",
      "ytd": "YTD: 142\""
    }
  }
}