{
  "timestamp": "2025-12-22T06:00:42.597Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766383200000,
          "temp": 20,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 20, with temperatures rising to around 22 overnight. South southwest wind around 5 mph."
        },
        {
          "name": "Monday",
          "timestamp": 1766401200000,
          "temp": 36,
          "snowfall": 47,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 7am. Mostly cloudy, with a high near 36. South wind 5 to 8 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1766444400000,
          "temp": 32,
          "snowfall": 49,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow then Chance Light Rain",
          "detailedForecast": "A chance of snow before 8pm, then a chance of rain and snow between 8pm and 11pm, then a chance of rain and a slight chance of freezing rain. Cloudy. Low around 32, with temperatures rising to around 35 overnight. South wind 3 to 8 mph. Chance of precipitation is 50%. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday",
          "timestamp": 1766487600000,
          "temp": 46,
          "snowfall": 28,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain then Mostly Cloudy",
          "detailedForecast": "A chance of rain before 7am. Mostly cloudy, with a high near 46. West southwest wind 5 to 12 mph, with gusts as high as 21 mph. Chance of precipitation is 30%. Little or no ice accumulation expected."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766383200000,
          "temp": 19,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 19, with temperatures rising to around 27 overnight. Southwest wind 10 to 15 mph."
        },
        {
          "name": "Monday",
          "timestamp": 1766401200000,
          "temp": 35,
          "snowfall": 35,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers between 7am and noon, then a chance of rain and snow showers. Mostly cloudy. High near 35, with temperatures falling to around 33 in the afternoon. Southwest wind 5 to 10 mph, with gusts as high as 25 mph. Chance of precipitation is 40%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1766444400000,
          "temp": 27,
          "snowfall": 48,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 3am, then a chance of freezing rain between 3am and 4am, then a chance of snow showers between 4am and 5am, then a chance of rain showers. Mostly cloudy. Low around 27, with temperatures rising to around 30 overnight. South wind around 5 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday",
          "timestamp": 1766487600000,
          "temp": 36,
          "snowfall": 34,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain Showers then Partly Sunny",
          "detailedForecast": "A chance of rain showers before 7am. Partly sunny, with a high near 36. West wind 5 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766383200000,
          "temp": 13,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 13, with temperatures rising to around 22 overnight. Southwest wind around 10 mph."
        },
        {
          "name": "Monday",
          "timestamp": 1766401200000,
          "temp": 34,
          "snowfall": 49,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7am. Mostly cloudy. High near 34, with temperatures falling to around 32 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1766444400000,
          "temp": 25,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely before 2am, then a chance of freezing rain between 2am and 5am, then a chance of snow showers. Cloudy. Low around 25, with temperatures rising to around 29 overnight. South wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday",
          "timestamp": 1766487600000,
          "temp": 36,
          "snowfall": 39,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers then Partly Sunny",
          "detailedForecast": "A chance of rain showers before 7am. Partly sunny, with a high near 36. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. Little or no ice accumulation expected."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Dec 21",
      "conditions": "Bucks Run was spectacular today with the beautiful blue sky day! Thanks to the wonderful crew who works so hard on making snow and grooming!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Dec 16",
      "conditions": "All trails power-tilled flat with a classic track and wide skate deck. Conditions are very good."
    }
  },
  "nubsNob": {
    "date": "12/21/25",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be packed this morning. Coverage and grooming are very good.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "There was a strong wind last night that is predicted to calm down considerably today. The snow surface is machine groomed and some drifting snow could be encountered. Conditions are still very good as we head toward Christmas. Pintail Peak is open. The Pintail Lodge is open with food and an espresso bar. NASTAR racing begins at 12:30 on Birch Run. The soup of the day is beef, mushroom and potatoes. The lifts will spin from 9:00 a.m. to 4:30 p.m. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 48\""
    }
  }
}