{
  "timestamp": "2025-02-18T16:00:43.794Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1739890800000,
          "temp": 16,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 16, with temperatures falling to around 14 in the afternoon. Wind chill values as low as -7. West northwest wind around 12 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1739919600000,
          "temp": 3,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 3. Wind chill values as low as -7. West wind around 7 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1739962800000,
          "temp": 20,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 20, with temperatures falling to around 18 in the afternoon. Wind chill values as low as -8. West northwest wind around 7 mph."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740006000000,
          "temp": 12,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow after 7pm. Cloudy, with a low around 12. Northwest wind around 5 mph. Chance of precipitation is 30%."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1739890800000,
          "temp": 13,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Mostly cloudy, with a high near 13. Wind chill values as low as -9. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739919600000,
          "temp": -1,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Mostly cloudy. Low around -1, with temperatures rising to around 2 overnight. Wind chill values as low as -8. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1739962800000,
          "temp": 14,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers. Mostly cloudy, with a high near 14. Wind chill values as low as -5. Northwest wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740006000000,
          "temp": 7,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a low around 7. Wind chill values as low as -2. North wind around 5 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1739890800000,
          "temp": 12,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Mostly cloudy, with a high near 12. Wind chill values as low as -7. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1739919600000,
          "temp": -5,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Mostly cloudy. Low around -5, with temperatures rising to around 0 overnight. Wind chill values as low as -10. Northwest wind 5 to 15 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1739962800000,
          "temp": 14,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers. Mostly cloudy, with a high near 14. Wind chill values as low as -8. Northwest wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1740006000000,
          "temp": 4,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 4. Wind chill values as low as -4. Northwest wind 0 to 5 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be open on 2/15 and 2/16.  Golf course and Shelden Trails are currently groomed.  Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 18, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  For today, February 17, 2025 grooming for classic ski and skate ski will take place on Coyote Run and Hawks Hill while Cedar Trace will be rolled only."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Feb 16",
      "conditions": "Good snow coverage but strong north winds making it a little cool out on the open trails. Nice in the wood protected area. Classic tracks and skating lines were in good shape where protected from the wind. Kudos to the ski centre staff for doing such a great job with rentals, snack bar and general advice on a fairly busy day. Huron Meadows deserves a lot of credit for keeping cross country skiing going in the Metro Detroit area."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Feb 12",
      "conditions": "Being the very first on the groom today , I am biased : but boy oh boy it is nice at Nubs Nob ! LF 6"
    }
  },
  "nubsNob": {
    "date": "2/18/25",
    "liftsOpen": "5 lifts, Rope Tow, and the Space Worm",
    "xcTrails": "Trails are open and groomed wide for skating with a classic track.",
    "nightSkiing": "Night Skiing is Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a cold and beautiful morning at Nub's Nob with excellent snow. Nub's received a few more inches of natural snow yesterday and we have now had ten and a half feet of natural snow fall so far this ski season. It looks like we may see some sunshine on the slopes this morning with clear skies to start the day. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 PM to prepare for night skiing. Bundle up and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 9\"",
      "sevenDays": "7 days: 16\"",
      "ytd": "YTD: 126\""
    }
  }
}