{
  "timestamp": "2025-12-10T18:00:48.799Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765386000000,
          "temp": 38,
          "snowfall": 94,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow. Mostly cloudy. High near 38, with temperatures falling to around 29 in the afternoon. North northwest wind 9 to 17 mph, with gusts as high as 32 mph. Chance of precipitation is 90%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765407600000,
          "temp": 16,
          "snowfall": 16,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Slight Chance Light Snow then Partly Cloudy",
          "detailedForecast": "A slight chance of snow before 7pm. Partly cloudy, with a low around 16. Northwest wind 8 to 16 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 28,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 28, with temperatures falling to around 26 in the afternoon. West wind around 10 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 15,
          "snowfall": 12,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 15. West wind 2 to 7 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765389600000,
          "temp": 26,
          "snowfall": 37,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and patchy freezing drizzle and scattered snow showers. Mostly cloudy. High near 26, with temperatures falling to around 19 in the afternoon. North wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tonight",
          "timestamp": 1765407600000,
          "temp": 15,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Patchy Blowing Snow then Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 10pm, then a chance of snow showers and patchy blowing snow between 10pm and 1am, then patchy blowing snow and scattered snow showers. Mostly cloudy. Low around 15, with temperatures rising to around 17 overnight. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 25,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Mostly cloudy. High near 25, with temperatures falling to around 23 in the afternoon. Northwest wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 17,
          "snowfall": 21,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 17. Northwest wind 0 to 5 mph. Chance of precipitation is 20%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1765389600000,
          "temp": 26,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow and patchy freezing drizzle before 4pm, then patchy blowing snow and isolated snow showers. Cloudy. High near 26, with temperatures falling to around 18 in the afternoon. North wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tonight",
          "timestamp": 1765407600000,
          "temp": 10,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Patchy Blowing Snow then Chance Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Patchy blowing snow and isolated snow showers before 10pm, then a chance of snow showers and areas of blowing snow between 10pm and 1am, then areas of blowing snow and scattered snow showers. Mostly cloudy. Low around 10, with temperatures rising to around 12 overnight. Wind chill values as low as 0. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 24,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Areas Of Blowing Snow",
          "detailedForecast": "Areas of blowing snow and scattered snow showers. Mostly cloudy. High near 24, with temperatures falling to around 22 in the afternoon. Wind chill values as low as 0. Northwest wind 5 to 15 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 11,
          "snowfall": 23,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 11. West wind around 5 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Dec 9",
      "conditions": "From the park website: Bucks Run is currently closed.  Snow is currently being made for Bucks Run and construction will being in the coming weeks. The golf course trails, Coyote Run and Hawk Hills, along with Cedar Trace were rolled December 9, 2025.  No additional grooming has taken place."
    }
  },
  "nubsNob": {
    "date": "12/09/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning Friday, December 12. The Snow Crew is making exceptional progress and we plan to have all of the frontside and southside runs open this Friday which will bring our run count to over 30 runs. Pintail Peak will open by the following weekend. Thanks for skiing at Nub's Nob.",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 31\""
    }
  }
}