{
  "timestamp": "2025-11-25T22:00:40.335Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764108000000,
          "temp": 50,
          "snowfall": 37,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain",
          "detailedForecast": "A chance of rain and patchy fog. Cloudy, with a high near 50. South wind around 3 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764111600000,
          "temp": 38,
          "snowfall": 41,
          "snowAmount": "",
          "shortForecast": "Patchy Fog",
          "detailedForecast": "Patchy fog and a slight chance of rain before 1am, then a chance of rain and patchy fog. Mostly cloudy. Low around 38, with temperatures rising to around 45 overnight. South southwest wind 2 to 7 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 49,
          "snowfall": 41,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Rain then Chance Light Snow",
          "detailedForecast": "A chance of rain before 1pm, then a chance of snow. Mostly cloudy. High near 49, with temperatures falling to around 37 in the afternoon. Southwest wind 8 to 24 mph, with gusts as high as 47 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 29,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Cloudy, with a low around 29. West southwest wind 20 to 24 mph, with gusts as high as 45 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764108000000,
          "temp": 49,
          "snowfall": 47,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy. High near 49, with temperatures falling to around 44 in the afternoon. East wind around 5 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764111600000,
          "temp": 41,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy, with a low around 41. Southeast wind 5 to 10 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 43,
          "snowfall": 75,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Rain showers. Cloudy. High near 43, with temperatures falling to around 37 in the afternoon. South wind around 10 mph, with gusts as high as 25 mph. Chance of precipitation is 80%."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 27,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Areas Of Blowing Snow",
          "detailedForecast": "Rain and snow showers likely before 7pm, then rain and snow showers between 7pm and 8pm, then areas of blowing snow and rain and snow showers. Cloudy, with a low around 27. Northwest wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764108000000,
          "temp": 49,
          "snowfall": 57,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy. High near 49, with temperatures falling to around 45 in the afternoon. Southeast wind around 5 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764111600000,
          "temp": 39,
          "snowfall": 58,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy. Low around 39, with temperatures rising to around 42 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 43,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely then Chance Rain And Snow Showers",
          "detailedForecast": "Rain showers likely before noon, then a chance of rain and snow showers between noon and 3pm, then a chance of rain and snow showers between 3pm and 4pm, then rain and snow showers. Cloudy. High near 43, with temperatures falling to around 36 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 80%."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 25,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers before 7pm, then rain and snow showers between 7pm and 9pm, then snow showers and areas of blowing snow. Cloudy, with a low around 25. West wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "11/19/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The Snow Crew turned the guns on last night. Despite some cold temperatures in the area the conditions at Nub's Nob allowed for only a few hours of quality snowmaking. The team is here around the clock, ready for the next opportunity. At this point it looks like there is a turn toward colder weather right around Thanksgiving. We will continue to update the blog to keep you up to date. Think COLD and SNOW.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 5\"",
      "ytd": "YTD: 5\""
    }
  }
}