{
  "timestamp": "2026-01-15T23:00:41.916Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768518000000,
          "temp": 11,
          "snowfall": 5,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 11, with temperatures rising to around 18 overnight. Southwest wind 2 to 6 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1768561200000,
          "temp": 33,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow between 7am and 5pm. Cloudy. High near 33, with temperatures falling to around 30 in the afternoon. South southwest wind 6 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1768604400000,
          "temp": 25,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow after 7pm. Mostly cloudy. Low around 25, with temperatures rising to around 27 overnight. Southwest wind 5 to 9 mph, with gusts as high as 20 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1768647600000,
          "temp": 29,
          "snowfall": 37,
          "snowAmount": "",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy, with a high near 29. West southwest wind 5 to 10 mph, with gusts as high as 20 mph. Chance of precipitation is 40%."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768518000000,
          "temp": 11,
          "snowfall": 42,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 10pm. Mostly cloudy. Low around 11, with temperatures rising to around 20 overnight. South wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1768561200000,
          "temp": 27,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 27. South wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1768604400000,
          "temp": 21,
          "snowfall": 82,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 21. Southwest wind around 5 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1768647600000,
          "temp": 28,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a high near 28. West wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768518000000,
          "temp": 7,
          "snowfall": 51,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 10pm. Mostly cloudy. Low around 7, with temperatures rising to around 17 overnight. South wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1768561200000,
          "temp": 25,
          "snowfall": 89,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 25. South wind around 10 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1768604400000,
          "temp": 20,
          "snowfall": 71,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 20, with temperatures rising to around 22 overnight. Southwest wind around 5 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1768647600000,
          "temp": 26,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 26. Southwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Jan 14",
      "conditions": "8:00pm: the Kids Learn to Ski class just ended. Kids were treated to several inches of fresh snow! Me? I took me forever to get to the park as cars were driving a conservative 20-25 mph on the highway. But it was fun skiing in classic tracks! Adam Haberkorn is now out on the trail packing everything down for tomorrow."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Jan 15",
      "conditions": "Skiing is awesome with a 24\" base of natural snow and daily power tilling.  All trails are open.  Save $20 on race registration by registering online at SKIREG.com by 10 pm tonight!"
    }
  },
  "nubsNob": {
    "date": "1/15/26",
    "liftsOpen": "5 chairlifts and the rope tow.",
    "xcTrails": "Trails were power-tilled and tracked on Wednesday morning. Conditions are excellent.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "A cold and beautiful morning awaits skiers at Nub's Nob. The wind is light and the possibility of some sunshine this morning exists. The snow is in exceptional shape due to the cold, a dusting of fresh snow, and the meticulous work of the Grooming Crew. Today will be a good day to stop by the Tune Center for a fresh wax to cope with the cold and slower snow. The soup of the day is BBQ soup. Pintail Peak is open with food service and an espresso bar. Harbor Springs High School has a ski meet this afternoon on Smokey and Valley. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 p.m. Bundle up and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 2\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 81\""
    }
  }
}