{
  "timestamp": "2025-03-24T07:00:36.401Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742796000000,
          "temp": 36,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers before 5am. Mostly cloudy. Low around 36, with temperatures rising to around 38 overnight. Southwest wind around 17 mph, with gusts as high as 32 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Monday",
          "timestamp": 1742810400000,
          "temp": 42,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers between 8am and 2pm, then a chance of rain showers between 2pm and 3pm, then a chance of rain and snow showers. Mostly cloudy. High near 42, with temperatures falling to around 40 in the afternoon. West southwest wind 17 to 22 mph, with gusts as high as 36 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742853600000,
          "temp": 31,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of rain and snow showers before 8pm. Mostly cloudy. Low around 31, with temperatures rising to around 33 overnight. West wind 8 to 18 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1742896800000,
          "temp": 46,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 46. West northwest wind 7 to 10 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742796000000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 28, with temperatures rising to around 31 overnight. East wind 10 to 15 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742810400000,
          "temp": 32,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow then Chance Snow Showers",
          "detailedForecast": "Snow before 8am, then a chance of snow showers. Cloudy, with a high near 32. North wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742853600000,
          "temp": 27,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a low around 27. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1742896800000,
          "temp": 32,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 2pm. Mostly cloudy, with a high near 32. Northwest wind around 10 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1742796000000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 28, with temperatures rising to around 31 overnight. South wind around 10 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742810400000,
          "temp": 33,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Light Snow then Snow Showers",
          "detailedForecast": "Snow before 8am, then snow showers. Cloudy. High near 33, with temperatures falling to around 31 in the afternoon. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742853600000,
          "temp": 24,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 24. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1742896800000,
          "temp": 32,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 2pm. Mostly cloudy, with a high near 32. Northwest wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Fri, Mar 21",
      "conditions": "6-inches of snow on Thursday and a complete powertilling of the upper loops to World Cup specs this morning. A touch soft today, but should be an amazing 7-10 day stretch starting tomorrow. Huge shoutout to Ben and the entire crew at Nubs for their commitment to Nordic skiing."
    }
  },
  "nubsNob": {
    "date": "3/23/25",
    "liftsOpen": "7 lifts, Rope Tow and Space Worm.",
    "xcTrails": "All trails were packed yesterday morning. Conditions are very good on the upper trails. The lower trails are marginal.",
    "nightSkiing": "Done for the season.",
    "comments": "It feels like the middle of winter today and the snow is in good shape. The cold, frequent grooming and some fresh snow over the last few days have further improved conditions. Expect hard, but not icy snow this morning. The snow should loosen up by the afternoon as the temperature goes above freezing. NASTAR Racing on Birch Run from 12:30 to 2:30 PM. Seasonal Road will play the Nub's Pub this afternoon. Pintail Peak lodge is open with a deli and espresso bar. The lifts will spin from 9:00 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 7\"",
      "ytd": "YTD: 142\""
    }
  }
}