{
  "timestamp": "2025-01-25T06:00:39.525Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737784800000,
          "temp": 10,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 3am. Cloudy. Low around 10, with temperatures rising to around 14 overnight. South southwest wind around 8 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737802800000,
          "temp": 30,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 30. South southwest wind 8 to 12 mph, with gusts as high as 23 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737846000000,
          "temp": 21,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 21, with temperatures rising to around 23 overnight. West southwest wind 8 to 12 mph, with gusts as high as 22 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737889200000,
          "temp": 27,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers then Partly Sunny",
          "detailedForecast": "Scattered snow showers before 7am. Partly sunny, with a high near 27. West wind around 10 mph, with gusts as high as 21 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737784800000,
          "temp": 3,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 3, with temperatures rising to around 17 overnight. Wind chill values as low as -5. South wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737802800000,
          "temp": 29,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers before 2pm, then snow showers likely and patchy blowing snow. Cloudy. High near 29, with temperatures falling to around 27 in the afternoon. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737846000000,
          "temp": 16,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "Snow showers likely and patchy blowing snow. Mostly cloudy. Low around 16, with temperatures rising to around 19 overnight. West wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737889200000,
          "temp": 25,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 7am. Mostly cloudy, with a high near 25. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737784800000,
          "temp": 1,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 1, with temperatures rising to around 12 overnight. Wind chill values as low as -5. South wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737802800000,
          "temp": 27,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a high near 27. Wind chill values as low as -2. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737846000000,
          "temp": 14,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 14, with temperatures rising to around 18 overnight. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737889200000,
          "temp": 22,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely then Mostly Cloudy",
          "detailedForecast": "Snow showers likely before 7am. Mostly cloudy, with a high near 22. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 24, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Coyote Run and Hawks Hills ski trails have been rolled. The trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Jan 24",
      "conditions": "The golf course is ROLLED, baby!! It’s thin, but it’s golf course skiing, for which I am grateful. The Metroparks did a very nice job given the lack of snowfall. I skied the gully on the south end by the entrance, but I would super definitely very much not ski it again until we get more snow. Parking lot was PACKED at 2pm on a Friday. Should be a good weekend out here."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Fri, Jan 24",
      "conditions": "The upper red and blue were groomed this morning with the Piston Bully . The wide skate lane and the firm classic tract were as good as it gets . Used LF 7 - LF6 might have been a slightly better choice ."
    }
  },
  "nubsNob": {
    "date": "1/24/25",
    "liftsOpen": "7 lifts, Rope Tow, and Space Worm",
    "xcTrails": "Trails are open and in great shape. Trails will be packed this morning. Expect snow surface to be a little soft given all the recent snowfall.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's another mid-winter ski day at Nub's Nob with beautiful conditions. We only received a dusting of natural snow last night, but more snow is in the air this morning. The ski surface is so good right now. The Marker/Dalbello/Volkl Speed Series is tonight at 7 PM. Please sign up for this rest online prior to 3 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 18\"",
      "ytd": "YTD: 91\""
    }
  }
}