{
  "timestamp": "2025-01-23T21:00:44.271Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737662400000,
          "temp": 27,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. High near 27, with temperatures falling to around 24 in the afternoon. West northwest wind around 9 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737673200000,
          "temp": 8,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers then Mostly Cloudy",
          "detailedForecast": "Scattered snow showers before 10pm. Mostly cloudy. Low around 8, with temperatures rising to around 10 overnight. West northwest wind 5 to 8 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1737716400000,
          "temp": 22,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 22, with temperatures falling to around 19 in the afternoon. Wind chill values as low as 0. West southwest wind around 7 mph."
        },
        {
          "name": "Friday Night",
          "timestamp": 1737759600000,
          "temp": 10,
          "snowfall": 0,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 10. South southwest wind 5 to 8 mph. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1737662400000,
          "temp": 23,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Partly sunny. High near 23, with temperatures falling to around 20 in the afternoon. North wind around 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1737673200000,
          "temp": 11,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 11, with temperatures rising to around 15 overnight. Northwest wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1737716400000,
          "temp": 22,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers before 1pm. Mostly cloudy, with a high near 22. Southwest wind 5 to 15 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1737759600000,
          "temp": 13,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Mostly Cloudy then Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 1am. Mostly cloudy, with a low around 13. South wind 10 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 23, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Plenty of lake effect , combined with low 20 degree temps, plus the full big groom this morning , makes Nubs Knob red and blue trails as nice as it gets !"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Jan 22",
      "conditions": "Excellent day out classic skiing on skins.  Tracks very good and fast most of the way around in the woods except for a few shallow spots but not down to the dirt.  Tracks blown in on connector with the wind.  Snow gun was running today also."
    }
  },
  "nubsNob": {
    "date": "1/23/25",
    "liftsOpen": "5 Lifts and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be power-tilled this morning. Conditions will be soft with all the new snow.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Seven more inches of high quality lake effect snow landed at Nub's Nob last night. This is very light and perfect skiing snow. Some of this fresh snow is laying on top of the steep groomed runs. We are doing a second groom this morning on the majority of the green circle runs along with our race hill, Birch Run. This continues to be an amazing winter for skiers and riders, we now have 90\" of snow for the season and it's not even February. The snowshoe trails and XC trails are also in very good condition. We are proud to host our friends at the 70+ ski club today for their NASTAR race. The lifts will spin from 9 AM to 9 PM today with an hour break at 4:30 PM to prepare for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "7\"",
      "threeDays": "3 days: 17\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 90\""
    }
  }
}