{
  "timestamp": "2025-01-28T10:00:40.352Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738058400000,
          "temp": 20,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 20, with temperatures rising to around 25 overnight. Northwest wind around 9 mph, with gusts as high as 20 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 34,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers then Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow. Cloudy, with a high near 34. West wind 3 to 14 mph, with gusts as high as 26 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 29,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Scattered Snow Showers",
          "detailedForecast": "A chance of snow before 7pm, then scattered snow showers. Mostly cloudy. Low around 29, with temperatures rising to around 33 overnight. West southwest wind 14 to 17 mph, with gusts as high as 38 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 32,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Partly sunny, with a high near 32. West northwest wind 15 to 20 mph, with gusts as high as 38 mph. Chance of precipitation is 30%."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738058400000,
          "temp": 6,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 6, with temperatures rising to around 8 overnight. Wind chill values as low as -1. West wind around 5 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 32,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Scattered Snow Showers then Heavy Snow",
          "detailedForecast": "Scattered snow showers before 7am, then snow. Mostly cloudy. High near 32, with temperatures falling to around 28 in the afternoon. Wind chill values as low as -2. Southwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 17,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Heavy Snow Likely then Snow Showers Likely",
          "detailedForecast": "Snow likely before 7pm, then snow showers likely. Cloudy. Low around 17, with temperatures rising to around 22 overnight. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 23,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 23. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738058400000,
          "temp": 4,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 4, with temperatures rising to around 8 overnight. Wind chill values as low as -1. West wind around 5 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 31,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Scattered Snow Showers then Heavy Snow",
          "detailedForecast": "Scattered snow showers before 7am, then snow. Cloudy. High near 31, with temperatures falling to around 28 in the afternoon. Wind chill values as low as -2. Southwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 18,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Snow Likely then Snow Showers",
          "detailedForecast": "Snow likely before 7pm, then snow showers. Cloudy. Low around 18, with temperatures rising to around 23 overnight. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1738148400000,
          "temp": 23,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 23. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 27, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Golf course trails, Hawk Hills and Coyote Run, were rolled on January 24, 2025.  When skiing the golf course trails please ski on designated marked trails only.  All other trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 25",
      "conditions": "The Nubs upper loops are in great  shape with a fresh big groom this morning. LF 7 was the perfect wax of today ."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Jan 27",
      "conditions": "Classic skied golf course trails from 1-2:30pm.  They were holding up surprisingly well. Rolling it recently has helped if stay solid.  A few spots where you may want to detour off the trails but generally good coverage, but thin.  Even some decent skier tracks to follow for a good portion.  Tomorrow morning should be some decent crust skiing."
    }
  },
  "nubsNob": {
    "date": "1/27/25",
    "liftsOpen": "5 lifts and the rope tow",
    "xcTrails": "Trails are open and in great shape with a classic track set. Trails were groomed on Sunday and will be groomed again tomorrow following the wind today.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "The wind is up today from the Southwest today. Snow conditions continue to be very good. Expect to encounter some drifts around the ski area today. We are hosting a middle school ski meet on Birch Run this afternoon. The lifts will spin from 9 AM to 4:30 PM today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 94\""
    }
  }
}