{
  "timestamp": "2026-01-21T22:01:18.576Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1769032800000,
          "temp": 32,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy, with a high near 32. Southwest wind around 12 mph, with gusts as high as 22 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769036400000,
          "temp": 19,
          "snowfall": 41,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow then Chance Snow Showers",
          "detailedForecast": "A chance of snow before 7pm, then a chance of snow showers. Mostly cloudy. Low around 19, with temperatures rising to around 23 overnight. West southwest wind 9 to 13 mph, with gusts as high as 25 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1769079600000,
          "temp": 23,
          "snowfall": 33,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A chance of snow showers before 7am. Partly sunny. High near 23, with temperatures falling to around 20 in the afternoon. West wind 12 to 17 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1769122800000,
          "temp": 2,
          "snowfall": 42,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers between 7pm and 1am. Mostly cloudy, with a low around 2. Wind chill values as low as -10. West wind around 10 mph, with gusts as high as 22 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1769032800000,
          "temp": 21,
          "snowfall": 73,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy, with a high near 21. West wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769036400000,
          "temp": 11,
          "snowfall": 89,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 11, with temperatures rising to around 14 overnight. Wind chill values as low as -1. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1769079600000,
          "temp": 13,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers before noon, then snow showers likely and patchy blowing snow. Mostly cloudy. High near 13, with temperatures falling to around 11 in the afternoon. Wind chill values as low as -7. West wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1769122800000,
          "temp": -4,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around -4. Wind chill values as low as -23. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1769032800000,
          "temp": 21,
          "snowfall": 55,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy, with a high near 21. Southwest wind around 10 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769036400000,
          "temp": 9,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. Low around 9, with temperatures rising to around 12 overnight. Wind chill values as low as -3. West wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1769079600000,
          "temp": 13,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 1pm, then snow showers likely and patchy blowing snow. Mostly cloudy. High near 13, with temperatures falling to around 9 in the afternoon. Wind chill values as low as -8. West wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1769122800000,
          "temp": -4,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around -4. Wind chill values as low as -21. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Jan 19",
      "conditions": "Nubs Nob red and blue loop has 18” of hard packed base . Looks like we will be skiing late into the Spring!"
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Jan 21",
      "conditions": "I went around Cedar Trace and did a few laps of Buck's Run this afternoon. Lots of coverage. Buck's is in great shape, Cedar Trace was OK but pretty slow and a bit sticky in parts. The trails off the golf course would be great if they got around to grooming them. Rod Little"
    }
  },
  "nubsNob": {
    "date": "1/21/26",
    "liftsOpen": "At least 5 chairlifts and the rope tow.",
    "xcTrails": "Trails were power-tilled and tracked Tuesday morning. Conditions are excellent.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "It looks like a fantastic day to ski. The temperature is forecast to go above 20 degrees today and we are supposed to receive a few inches of snow during the day. The snow surface is machine groomed and the snow quality is excellent thanks to the fresh snow and sustained cold. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 p.m. Pintail Peak Lodge is open with food service and an espresso bar. We are proud to welcome the 70 plus ski club for their 40th annual gathering. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 18\"",
      "ytd": "YTD: 97\""
    }
  }
}