{
  "timestamp": "2025-12-11T04:10:24.709Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1765425600000,
          "temp": 16,
          "snowfall": 9,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 16. West northwest wind 8 to 13 mph, with gusts as high as 24 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 28,
          "snowfall": 11,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 28, with temperatures falling to around 26 in the afternoon. West wind around 10 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 15,
          "snowfall": 6,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 15. West wind 2 to 7 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1765537200000,
          "temp": 29,
          "snowfall": 9,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 29. West southwest wind around 5 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1765425600000,
          "temp": 15,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow before 1am, then patchy blowing snow and scattered snow showers. Mostly cloudy. Low around 15, with temperatures rising to around 17 overnight. Northwest wind 10 to 15 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 25,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Mostly cloudy. High near 25, with temperatures falling to around 23 in the afternoon. Northwest wind 5 to 10 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 17,
          "snowfall": 21,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers before 1am. Mostly cloudy. Low around 17, with temperatures rising to around 19 overnight. Northwest wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Friday",
          "timestamp": 1765537200000,
          "temp": 29,
          "snowfall": 44,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers after 1pm. Mostly cloudy, with a high near 29. West wind 5 to 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1765425600000,
          "temp": 10,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Chance Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "A chance of snow showers and areas of blowing snow before 1am, then areas of blowing snow and scattered snow showers. Mostly cloudy. Low around 10, with temperatures rising to around 12 overnight. Wind chill values as low as 0. Northwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 24,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Areas Of Blowing Snow",
          "detailedForecast": "Areas of blowing snow and scattered snow showers. Mostly cloudy. High near 24, with temperatures falling to around 22 in the afternoon. Wind chill values as low as 0. Northwest wind 5 to 15 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 11,
          "snowfall": 23,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers. Mostly cloudy, with a low around 11. West wind 0 to 5 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1765537200000,
          "temp": 28,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy, with a high near 28. Southwest wind around 5 mph. Chance of precipitation is 40%."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 10",
      "conditions": "If you didn't know, you can't groom when it's a above freezing, so if you expected good skating conditions or amazing tracks at Huron Meadows today , you were sorely disappointed ??. But it was awesome to break trail on my waxless classic touring skis with Sarah and Tony around the lake and the contractor's loop! Big smiles just getting out in the woods!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Dec 10",
      "conditions": "Perfect grooming with the big groomer, trail was excellent on upper red loop. Perfect temperature, fast snow.Have to enter the trail from Valley road."
    }
  },
  "nubsNob": {
    "date": "12/09/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning Friday, December 12. The Snow Crew is making exceptional progress and we plan to have all of the frontside and southside runs open this Friday which will bring our run count to over 30 runs. Pintail Peak will open by the following weekend. Thanks for skiing at Nub's Nob.",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 31\""
    }
  }
}