{
  "timestamp": "2025-12-15T09:03:38.934Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1765789200000,
          "temp": 10,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 10, with temperatures rising to around 15 overnight. Southwest wind around 6 mph."
        },
        {
          "name": "Monday",
          "timestamp": 1765796400000,
          "temp": 20,
          "snowfall": 44,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers between 7am and 4pm. Cloudy. High near 20, with temperatures falling to around 18 in the afternoon. Southwest wind 7 to 15 mph, with gusts as high as 29 mph. Chance of precipitation is 40%."
        },
        {
          "name": "Monday Night",
          "timestamp": 1765839600000,
          "temp": 13,
          "snowfall": 5,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 13, with temperatures rising to around 15 overnight. Southwest wind 3 to 8 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765882800000,
          "temp": 33,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 33. South southwest wind 3 to 10 mph, with gusts as high as 22 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1765789200000,
          "temp": 15,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Cloudy. Low around 15, with temperatures rising to around 20 overnight. Southwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1765796400000,
          "temp": 23,
          "snowfall": 88,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers before 8am, then snow showers and patchy blowing snow. Cloudy. High near 23, with temperatures falling to around 21 in the afternoon. West wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1765839600000,
          "temp": 15,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Mostly cloudy. Low around 15, with temperatures rising to around 20 overnight. West wind 5 to 10 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765882800000,
          "temp": 36,
          "snowfall": 9,
          "snowAmount": "",
          "shortForecast": "Cloudy",
          "detailedForecast": "Cloudy, with a high near 36. Southwest wind 10 to 15 mph, with gusts as high as 35 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1765789200000,
          "temp": 10,
          "snowfall": 54,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 10, with temperatures rising to around 17 overnight. Southwest wind around 10 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1765796400000,
          "temp": 21,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. High near 21, with temperatures falling to around 19 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1765839600000,
          "temp": 12,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7pm. Mostly cloudy. Low around 12, with temperatures rising to around 15 overnight. Southwest wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tuesday",
          "timestamp": 1765882800000,
          "temp": 34,
          "snowfall": 9,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 34. Southwest wind 5 to 15 mph, with gusts as high as 35 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Dec 14",
      "conditions": "Bucks run groomed for classic and skate in great condition from building and back.Coyote and Cedar trace groomed this morning for both classic and skate.i did not ski Hawk hills."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "[ ] groomed[ ] golf course is about as good as it gets[ ] Sheldon trails - fair to  good littered with tree parts, though the usual being trod upon[ ] icy patches under trees where not enough snow made it to the groun)d as it got colder and the rain - wet snow turned to ( oops - repost -- rain >>> snow"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sun, Dec 14",
      "conditions": "Seriously great grooming and firm snow depth on Nubs upper Red & Blue loops . I wished I had LF6 instead of my LF7 as the temps were in the low teens : but it was a delightful ski in the sunshine ."
    }
  },
  "nubsNob": {
    "date": "12/14/25",
    "liftsOpen": "6 lifts, Rope Tow and Conveyor",
    "xcTrails": "Groomed and tracked. Conditions are very good.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "It's a cold start to the ski day but the wind is light and the temperature is forecast to rise quickly today with a high around 24 degrees. A few inches of snow fell at Nub's this morning. Expect some light snow sitting on top of the corduroy which should make for great skiing. NASTAR racing today from 12:30 to 2:30 p.m. on Birch Run. The soups of the day is cream of potato and ham. Over 40 runs are now open at Nub's! Pintail Peak will open before next weekend! Make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 8\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 39\""
    }
  }
}