{
  "timestamp": "2026-01-22T22:00:40.735Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1769119200000,
          "temp": 23,
          "snowfall": 26,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 23, with temperatures falling to around 19 in the afternoon. West southwest wind around 13 mph, with gusts as high as 24 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769122800000,
          "temp": -2,
          "snowfall": 46,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 4am. Mostly cloudy. Low around -2, with temperatures rising to around 4 overnight. Wind chill values as low as -13. West wind around 13 mph, with gusts as high as 29 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1769166000000,
          "temp": 4,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 4, with temperatures falling to around 2 in the afternoon. Wind chill values as low as -19. West northwest wind 12 to 15 mph, with gusts as high as 26 mph."
        },
        {
          "name": "Friday Night",
          "timestamp": 1769209200000,
          "temp": -10,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear, with a low around -10. Wind chill values as low as -21. West northwest wind 5 to 9 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1769119200000,
          "temp": 14,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers and blowing snow. Partly sunny. High near 14, with temperatures falling to around 8 in the afternoon. Wind chill values as low as -8. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769122800000,
          "temp": -6,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow then Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow before 10pm, then blowing snow and scattered snow showers. Mostly cloudy, with a low around -6. Wind chill values as low as -26. Northwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Friday",
          "timestamp": 1769166000000,
          "temp": 1,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Blowing Snow",
          "detailedForecast": "Blowing snow and scattered snow showers. Mostly sunny, with a high near 1. Wind chill values as low as -26. Northwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1769209200000,
          "temp": -13,
          "snowfall": 26,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers then Partly Cloudy",
          "detailedForecast": "Scattered snow showers before 7pm. Partly cloudy, with a low around -13. Wind chill values as low as -23. West wind 5 to 15 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1769119200000,
          "temp": 13,
          "snowfall": 91,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 13, with temperatures falling to around 7 in the afternoon. Wind chill values as low as -8. West wind around 10 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1769122800000,
          "temp": -7,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before midnight, then snow showers and blowing snow between midnight and 4am, then blowing snow and a chance of snow showers. Mostly cloudy. Low around -7, with temperatures rising to around -5 overnight. Wind chill values as low as -26. West wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Friday",
          "timestamp": 1769166000000,
          "temp": 0,
          "snowfall": 73,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "A chance of snow showers and areas of blowing snow. Partly sunny, with a high near 0. Wind chill values as low as -26. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1769209200000,
          "temp": -20,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am. Partly cloudy, with a low around -20. Wind chill values as low as -28. West wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Jan 22",
      "conditions": "Once the crew at Huron Meadows rolled the trails, it was a little on the soft side but much better than the half a foot of fresh snow that Mike made me ski in on the contractors loop.  Conditions should firm up and be quite good the next few days if you can brave the cold!  Thanks HM crew!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Jan 19",
      "conditions": "Nubs Nob red and blue loop has 18” of hard packed base . Looks like we will be skiing late into the Spring!"
    }
  },
  "nubsNob": {
    "date": "1/22/26",
    "liftsOpen": "5 chairlifts and the rope tow.",
    "xcTrails": "Trails will be power-tilled and tracked this morning.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "It just keeps snowing. Yesterday the accumulation happened in waves throughout the day and then all at once during night skiing. These lake effect bands are highly localized and Nub's has been getting the goods all week long. The majority of all of this snow is now groomed in and will make for excellent conditions today. The soup of the day is kielbasa and cabbage. Pintail Peak Lodge is open with food service and espresso bar. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 p.m. Bundle up and make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "7\"",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 24\"",
      "ytd": "YTD: 105\""
    }
  }
}