{
  "timestamp": "2025-12-05T07:01:44.822Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764918000000,
          "temp": 5,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear, with a low around 5. Wind chill values as low as -3. South southwest wind around 5 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1764932400000,
          "temp": 26,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 26, with temperatures falling to around 23 in the afternoon. Wind chill values as low as -6. South southwest wind 6 to 10 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Friday Night",
          "timestamp": 1764975600000,
          "temp": 19,
          "snowfall": 19,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 7pm. Mostly cloudy. Low around 19, with temperatures rising to around 24 overnight. Southwest wind around 8 mph."
        },
        {
          "name": "Saturday",
          "timestamp": 1765018800000,
          "temp": 35,
          "snowfall": 19,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow before 7am. Mostly cloudy, with a high near 35. West southwest wind 6 to 9 mph, with gusts as high as 18 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764914400000,
          "temp": 15,
          "snowfall": 41,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow before 4am, then a chance of snow and patchy blowing snow. Cloudy. Low around 15, with temperatures rising to around 21 overnight. Southwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1764932400000,
          "temp": 29,
          "snowfall": 82,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow And Areas Of Blowing Snow",
          "detailedForecast": "Snow and areas of blowing snow. Cloudy, with a high near 29. Southwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1764975600000,
          "temp": 21,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 21, with temperatures rising to around 25 overnight. Southwest wind around 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1765018800000,
          "temp": 27,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy, with a high near 27. Northwest wind 10 to 15 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764914400000,
          "temp": 11,
          "snowfall": 13,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 11, with temperatures rising to around 16 overnight. Wind chill values as low as -3. Southwest wind 15 to 20 mph, with gusts as high as 35 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1764932400000,
          "temp": 27,
          "snowfall": 58,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely after 7am. Cloudy, with a high near 27. Southwest wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1764975600000,
          "temp": 20,
          "snowfall": 97,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 20, with temperatures rising to around 23 overnight. Southwest wind around 10 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1765018800000,
          "temp": 26,
          "snowfall": 95,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1pm. Mostly cloudy, with a high near 26. West wind around 10 mph. Chance of precipitation is 100%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Dec 4",
      "conditions": "Really terrific skating Thursday morning. As reported, golf course was rolled this morning, and it's gorgeous (90% perfect, the rest is grassy).  Thank you, Metroparks!  From the Metroparks web site: \"Bucks Run is currently closed.  Snow is currently being made for Bucks Run and construction will being in the coming weeks. Patrons are free to ski on the trails marked by orange flags on the golf course trails as conditions allow.  The golf course and Cedar Trace trails will be rolled this morning December 4, 2025.  No additional grooming will take place until we receive additional snow.\""
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Nubs Nob is not yet open for its down hill program : coming this weekend . But the groomers jumped the gun on the Nordic Trails . Access through Valley road to the red and blue loops are currently primo !"
    }
  },
  "nubsNob": {
    "date": "12/04/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "All trails will be open this Saturday and Sunday. We are packing the trails every morning to improve conditions. Expect very good conditions this weekend.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob will open this December 6 and 7 for skiing and riding. We anticipate having 12 runs open which includes almost every run on our frontside with the exception of Scarface, Chute and Twilight Zone. We plan to have 3 chairlifts open along with the rope tow. The lifts will spin from 9 AM to 4:30 PM. See you on Saturday! We will be open daily for skiing and riding beginning on December 12.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 19\"",
      "ytd": "YTD: 24\""
    }
  }
}