{
  "timestamp": "2026-01-13T04:14:00.264Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768276800000,
          "temp": 29,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 29. Southwest wind around 7 mph."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768302000000,
          "temp": 43,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Chance Rain Showers",
          "detailedForecast": "A slight chance of snow showers between 7am and 10am, then a chance of rain showers. Mostly cloudy, with a high near 43. South southwest wind 6 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1768345200000,
          "temp": 29,
          "snowfall": 26,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Rain then Slight Chance Rain And Snow",
          "detailedForecast": "A chance of rain showers before 7pm, then a slight chance of rain between 7pm and 4am, then a slight chance of rain and snow. Mostly cloudy. Low around 29, with temperatures rising to around 34 overnight. West southwest wind 6 to 14 mph, with gusts as high as 26 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768388400000,
          "temp": 37,
          "snowfall": 75,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow. Mostly cloudy, with a high near 37. West northwest wind 6 to 13 mph, with gusts as high as 23 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768276800000,
          "temp": 27,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of freezing rain between 4am and 5am, then a chance of snow. Mostly cloudy. Low around 27, with temperatures rising to around 29 overnight. Southwest wind 5 to 10 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768302000000,
          "temp": 35,
          "snowfall": 95,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Freezing rain before 8am, then snow between 8am and 10am, then rain and snow. Cloudy, with a high near 35. Southwest wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 100%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1768345200000,
          "temp": 10,
          "snowfall": 55,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Rain And Snow Likely",
          "detailedForecast": "Rain and snow likely. Cloudy. Low around 10, with temperatures rising to around 17 overnight. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768388400000,
          "temp": 16,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy, with a high near 16. Wind chill values as low as -7. North wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768276800000,
          "temp": 25,
          "snowfall": 29,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of snow after 4am. Mostly cloudy. Low around 25, with temperatures rising to around 28 overnight. Southwest wind 5 to 10 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768302000000,
          "temp": 35,
          "snowfall": 94,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "A chance of snow before 7am, then freezing rain between 7am and 8am, then snow and a slight chance of freezing rain between 8am and 9am, then rain and snow. Mostly cloudy, with a high near 35. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1768345200000,
          "temp": 9,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow. Mostly cloudy. Low around 9, with temperatures rising to around 18 overnight. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768388400000,
          "temp": 16,
          "snowfall": 76,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Mostly cloudy, with a high near 16. Wind chill values as low as -8. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Jan 12",
      "conditions": "Post race skate. Trail was in perfect condition!Even enough snow to ski from club house to the woods"
    }
  },
  "nubsNob": {
    "date": "1/12/26",
    "liftsOpen": "6 chairlifts and the rope tow.",
    "xcTrails": "Trails will be packed this morning. Classic track is in great shape.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "The wind is up from the west this morning but is forecast to calm down during the day. The temperature is very comfortable and will stay right around freezing. The snow surface is machine groomed and is excellent thanks to the recent snowfall. The lifts will spin from 9:00 a.m. to 4:30 p.m. Pintail Peak Lodge is open with food service and an espresso bar. The soup of the day is \"BBQ Soup\" and it's worth the trip. Petoskey and Harbor Springs Middle Schools will host a ski meet on Birch Run this afternoon. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 79\""
    }
  }
}