{
  "timestamp": "2025-01-18T09:00:46.879Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737190800000,
          "temp": 30,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow. Cloudy. Low around 30, with temperatures rising to around 36 overnight. South southwest wind around 9 mph, with gusts as high as 22 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737198000000,
          "temp": 36,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain And Snow then Mostly Cloudy",
          "detailedForecast": "Rain and snow before noon. Mostly cloudy. High near 36, with temperatures falling to around 26 in the afternoon. West northwest wind 7 to 16 mph, with gusts as high as 26 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737241200000,
          "temp": 13,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 13, with temperatures rising to around 15 overnight. North northwest wind 6 to 12 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1737284400000,
          "temp": 18,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 7am. Mostly cloudy, with a high near 18. Northwest wind around 8 mph."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1737190800000,
          "temp": 20,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 20, with temperatures rising to around 26 overnight. Northwest wind around 20 mph, with gusts as high as 35 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1737198000000,
          "temp": 25,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. High near 25, with temperatures falling to around 19 in the afternoon. Northwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1737241200000,
          "temp": 10,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 10, with temperatures rising to around 12 overnight. Wind chill values as low as -2. Northwest wind 10 to 15 mph. Chance of precipitation is 40%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737284400000,
          "temp": 14,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 14. Wind chill values as low as -4. Northwest wind around 10 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 17, 2025.  There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Trails were unable to be groomed today, January 17, 2025 due to limited snowfall.  You are always welcome to come out and blaze your own trail."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Fri, Jan 17",
      "conditions": "Friday am groomed upper and lower trails.   Plans are to groom Saturday and Sunday.  Hero snow, everybody smiling ."
    },
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Jan 16",
      "conditions": "Perfect conditions for skating and classic on Bucks Run. Golf course is not groomed and no info on whether it will be before the weekend."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    }
  },
  "nubsNob": {
    "date": "1/17/25",
    "liftsOpen": "7 Lifts, Space Worm and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be power-tilled and tracked again this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM. Extra night session Sunday, January 19 from 5:30 to 9:00 PM as well.",
    "comments": "All of the natural snow we received this week has been meticulously tilled into the base, and the result is nothing at which to shake a stick. We strongly advise gearing up and getting out for what should be a fantastic weekend on the snow. The lifts spin today from 9:00 AM to 9:00 PM today with an hour break beginning at 4:30 to prepare for the night session. Make it a grand day at Nub's Nob.",
    "snowData": {
      "daily": "2\"",
      "threeDays": "3 days: 17\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 73\""
    }
  }
}