{
  "timestamp": "2025-03-27T11:00:36.773Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1743073200000,
          "temp": 57,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 57, with temperatures falling to around 55 in the afternoon. West southwest wind 5 to 15 mph, with gusts as high as 24 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1743112800000,
          "temp": 35,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Rain",
          "detailedForecast": "A slight chance of rain after 5am. Mostly cloudy, with a low around 35. North wind 2 to 14 mph, with gusts as high as 22 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1743156000000,
          "temp": 62,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Light Rain Likely",
          "detailedForecast": "A chance of rain before 2pm, then rain likely and a slight chance of thunderstorms. Cloudy. High near 62, with temperatures falling to around 60 in the afternoon. Southeast wind 5 to 9 mph, with gusts as high as 18 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1743199200000,
          "temp": 54,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Light Rain Likely",
          "detailedForecast": "Rain likely and a slight chance of thunderstorms. Mostly cloudy, with a low around 54. Southwest wind 7 to 12 mph, with gusts as high as 24 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1743073200000,
          "temp": 41,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 41, with temperatures falling to around 37 in the afternoon. West wind 10 to 15 mph, with gusts as high as 25 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1743112800000,
          "temp": 23,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 5am. Mostly cloudy. Low around 23, with temperatures rising to around 26 overnight. Northeast wind 5 to 10 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1743156000000,
          "temp": 37,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Rain",
          "detailedForecast": "A slight chance of snow showers before 8am, then a chance of snow and a chance of freezing rain between 8am and 11am, then rain and a chance of freezing rain. Cloudy, with a high near 37. East wind 10 to 15 mph. Chance of precipitation is 90%. New snow accumulation of less than half an inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Friday Night",
          "timestamp": 1743199200000,
          "temp": 30,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Freezing Rain",
          "detailedForecast": "Rain before 11pm, then freezing rain and rain and a chance of thunderstorms. Cloudy, with a low around 30. East wind around 15 mph. Chance of precipitation is 90%. New ice accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1743073200000,
          "temp": 45,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Sunny",
          "detailedForecast": "Sunny. High near 45, with temperatures falling to around 41 in the afternoon. West wind 10 to 15 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1743112800000,
          "temp": 23,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 23, with temperatures rising to around 26 overnight. Northeast wind 0 to 10 mph."
        },
        {
          "name": "Friday",
          "timestamp": 1743156000000,
          "temp": 40,
          "snowfall": 80,
          "snowAmount": "",
          "shortForecast": "Chance Freezing Rain then Light Rain",
          "detailedForecast": "A chance of freezing rain between 8am and 11am, then rain. Mostly cloudy, with a high near 40. Southeast wind 5 to 10 mph. Chance of precipitation is 80%. Little or no ice accumulation expected."
        },
        {
          "name": "Friday Night",
          "timestamp": 1743199200000,
          "temp": 30,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Rain then Freezing Rain",
          "detailedForecast": "Rain before 8pm, then rain and a chance of thunderstorms between 8pm and 5am, then freezing rain and rain. Cloudy, with a low around 30. East wind 5 to 10 mph. Chance of precipitation is 90%. Little or no ice accumulation expected."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 24",
      "conditions": "Nubs with over a foot of snow since Thursday. Upper loops powertilled and tracked again Monday AM. Mid-winter type conditions should continue through the weekend."
    }
  },
  "nubsNob": {
    "date": "3/26/25",
    "liftsOpen": "5 lifts, Rope Tow and Space Worm.",
    "xcTrails": "Trails were groomed on Tuesday morning. Conditions are very good. The upper trails have the best conditions.",
    "nightSkiing": "Done for the season.",
    "comments": "It looks like a nearly perfect ski day. The snow dried out thanks to the overnight cold. There is barely a cloud in the sky and sunshine is anticipated for the majority of the day. The temperature will rapidly increase today, and top out around 35 degrees. Pintail Peak Lodge is open with an espresso bar. The lifts will spin from 9:00 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 8\"",
      "sevenDays": "7 days: 13\"",
      "ytd": "YTD: 150\""
    }
  }
}