{
  "timestamp": "2025-02-12T06:01:06.825Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739340000000,
          "temp": 14,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 14, with temperatures rising to around 17 overnight. Northeast wind around 5 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1739358000000,
          "temp": 28,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Cloudy then Snow",
          "detailedForecast": "Snow after 1pm. Cloudy. High near 28, with temperatures falling to around 26 in the afternoon. East northeast wind 6 to 12 mph, with gusts as high as 21 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1739401200000,
          "temp": 24,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 5 to 9 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow. Cloudy. Low around 24, with temperatures rising to around 27 overnight. North northeast wind 6 to 10 mph, with gusts as high as 21 mph. Chance of precipitation is 100%. New snow accumulation of 5 to 9 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1739444400000,
          "temp": 29,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy, with a high near 29. West northwest wind around 12 mph, with gusts as high as 21 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739340000000,
          "temp": -6,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around -6, with temperatures rising to around -2 overnight. Wind chill values as low as -10. East wind around 5 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1739358000000,
          "temp": 22,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Cloudy then Light Snow",
          "detailedForecast": "Snow after 1pm. Cloudy, with a high near 22. Wind chill values as low as -12. East wind around 5 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1739401200000,
          "temp": 11,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 11, with temperatures rising to around 13 overnight. Wind chill values as low as 0. Northeast wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1739444400000,
          "temp": 21,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow Likely then Chance Snow Showers",
          "detailedForecast": "Snow likely before 7am, then a chance of snow showers. Mostly cloudy, with a high near 21. Wind chill values as low as 0. Northwest wind 5 to 15 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739340000000,
          "temp": -7,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around -7, with temperatures rising to around -3 overnight. Wind chill values as low as -3. Southeast wind around 0 mph."
        },
        {
          "name": "Wednesday",
          "timestamp": 1739358000000,
          "temp": 21,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow after 7am. Cloudy, with a high near 21. Wind chill values as low as -3. East wind 0 to 5 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1739401200000,
          "temp": 11,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 11, with temperatures rising to around 13 overnight. Wind chill values as low as 0. Northeast wind 5 to 10 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1739444400000,
          "temp": 20,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow then Snow Showers",
          "detailedForecast": "Snow before 7am, then snow showers. Mostly cloudy, with a high near 20. Wind chill values as low as 0. Northwest wind 5 to 15 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/8 and 2/9.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 11, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Feb 11",
      "conditions": "Bucks Run was in great shape this afternoon....skate deck was wide, firm and fast and there were two or three tracks around the entire loop.  Hats off and a big thank you to the grooming team!   Hopefully Bucks Run will be complemented by the snow storm tomorrow and the other trails on the golf course are skiable as well."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 10",
      "conditions": "Nubs Red and Blue loops have deep base snow , great layered grooming , and a nice skiff of new snow on top . Excellent skiing today with LF Blue"
    }
  },
  "nubsNob": {
    "date": "2/11/25",
    "liftsOpen": "5 lifts and the Space Worm",
    "xcTrails": "Trails are open and in great shape. Trails were power-tilled and tracked on Sunday.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "There is a dusting of snow on the grooming today and conditions look great for skiing and riding with exceptional snow quality. It's a cold day with a high just below 20 degrees. The wind is light and some sunshine is predicted this afternoon. This is one of those cold ski days that can feel very comfortable. Pintail Peak lodge is open until 3:30 PM. The Lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 PM to prepare for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 110\""
    }
  }
}