{
  "timestamp": "2026-01-03T20:00:36.910Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767470400000,
          "temp": 26,
          "snowfall": 42,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow and a slight chance of snow showers. Cloudy, with a high near 26. West wind around 6 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767481200000,
          "temp": 18,
          "snowfall": 42,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Snow Showers Likely",
          "detailedForecast": "A chance of snow and a slight chance of snow showers before 7pm, then snow showers likely and a chance of snow between 7pm and 1am. Mostly cloudy. Low around 18, with temperatures rising to around 20 overnight. West wind around 5 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1767524400000,
          "temp": 29,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 29, with temperatures falling to around 27 in the afternoon. West northwest wind around 6 mph."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1767567600000,
          "temp": 21,
          "snowfall": 65,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely after 7pm. Mostly cloudy, with a low around 21. South southwest wind around 5 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767470400000,
          "temp": 22,
          "snowfall": 71,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy, with a high near 22. West wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767481200000,
          "temp": 17,
          "snowfall": 71,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely then Chance Snow Showers",
          "detailedForecast": "Snow likely before 7pm, then a chance of snow showers. Cloudy, with a low around 17. Northwest wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1767524400000,
          "temp": 25,
          "snowfall": 21,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 7am. Mostly cloudy. High near 25, with temperatures falling to around 23 in the afternoon. West wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1767567600000,
          "temp": 17,
          "snowfall": 93,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers after 7pm. Cloudy, with a low around 17. South wind around 5 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767470400000,
          "temp": 22,
          "snowfall": 63,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Cloudy, with a high near 22. West wind around 10 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767481200000,
          "temp": 16,
          "snowfall": 85,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow Likely then Chance Snow Showers",
          "detailedForecast": "Snow likely before 7pm, then a chance of snow showers. Cloudy. Low around 16, with temperatures rising to around 18 overnight. Northwest wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1767524400000,
          "temp": 24,
          "snowfall": 41,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A chance of snow showers before 7am. Mostly cloudy. High near 24, with temperatures falling to around 22 in the afternoon. West wind around 5 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1767567600000,
          "temp": 15,
          "snowfall": 94,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers after 7pm. Mostly cloudy, with a low around 15. South wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 31",
      "conditions": "Bucks Run will be open for skiing tomorrow but will not be groomed. The building will be open for its usual hours. The park says that the next possible groom date is January 2nd. At 3:30 today it's snowing really hard and the trail is filling in nicely. Might be a good classic day as the track is rock solid and once it's skied in a little bit it should be good. Not so sure about skating for tomorrow."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Wed, Dec 31",
      "conditions": "Lots of lake effect snow !  Firm groom this AM was covered this afternoon with 2 to 3 inches of fairly light snow resulting in a pleasant skiable skate deck . The  classic tracks look great and those skiers were moving fast . The best access is through Valley road dead end as the Lodge side is very busy with the downhill crowd ."
    }
  },
  "nubsNob": {
    "date": "1/3/26",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power tilled and tracked this morning. Conditions are excellent",
    "nightSkiing": "Tonight from 5:30 to 9:00 p.m.",
    "comments": "It's a beautiful Saturday for skiing. The snow surface is extremely good thanks to fresh snow over the last few days and the mercury staying below freezing. Pintail Peak is open with food and an espresso bar. The soup of the day is \"It's in There\" and it is not to be missed. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 to groom for night skiing. Make it a great day at Nub's.",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 17\"",
      "ytd": "YTD: 65\""
    }
  }
}