{
  "timestamp": "2026-01-13T23:00:45.147Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768345200000,
          "temp": 29,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain then Chance Rain And Snow",
          "detailedForecast": "A chance of rain between 7pm and 5am, then a chance of rain and snow. Mostly cloudy. Low around 29, with temperatures rising to around 36 overnight. West southwest wind 8 to 14 mph, with gusts as high as 25 mph. Chance of precipitation is 30%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768388400000,
          "temp": 35,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow Likely",
          "detailedForecast": "Snow likely. Mostly cloudy. High near 35, with temperatures falling to around 20 in the afternoon. Northwest wind 9 to 17 mph, with gusts as high as 26 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1768431600000,
          "temp": 10,
          "snowfall": 54,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Mostly Cloudy",
          "detailedForecast": "A chance of snow before 7pm. Mostly cloudy. Low around 10, with temperatures rising to around 12 overnight. Wind chill values as low as -2. North northwest wind 10 to 15 mph, with gusts as high as 26 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1768474800000,
          "temp": 21,
          "snowfall": 7,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 21. Wind chill values as low as -3. Northwest wind 7 to 10 mph, with gusts as high as 20 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768345200000,
          "temp": 11,
          "snowfall": 65,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow Showers then Patchy Blowing Snow",
          "detailedForecast": "A chance of rain showers before 9pm, then a chance of rain and snow showers between 9pm and 10pm, then scattered rain and snow showers between 10pm and 11pm, then scattered rain and snow showers between 11pm and 1am, then patchy blowing snow and isolated snow showers. Cloudy. Low around 11, with temperatures rising to around 18 overnight. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 70%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768388400000,
          "temp": 14,
          "snowfall": 54,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Cloudy. High near 14, with temperatures falling to around 10 in the afternoon. Wind chill values as low as -8. North wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1768431600000,
          "temp": 4,
          "snowfall": 34,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers then Mostly Cloudy",
          "detailedForecast": "Scattered snow showers before 10pm. Mostly cloudy, with a low around 4. Wind chill values as low as -10. North wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1768474800000,
          "temp": 18,
          "snowfall": 4,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 18. Wind chill values as low as -8. West wind 5 to 10 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1768345200000,
          "temp": 10,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Rain And Snow Showers then Patchy Blowing Snow",
          "detailedForecast": "A chance of rain and snow showers before 7pm, then rain and snow showers between 7pm and 1am, then patchy blowing snow and scattered snow showers. Cloudy. Low around 10, with temperatures rising to around 19 overnight. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768388400000,
          "temp": 14,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Patchy Blowing Snow then Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 10am, then a chance of snow showers and patchy blowing snow. Mostly cloudy. High near 14, with temperatures falling to around 8 in the afternoon. Wind chill values as low as -10. North wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1768431600000,
          "temp": 1,
          "snowfall": 49,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Snow Showers then Mostly Cloudy",
          "detailedForecast": "Scattered snow showers before 10pm. Mostly cloudy, with a low around 1. Wind chill values as low as -12. North wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1768474800000,
          "temp": 16,
          "snowfall": 9,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 16. Wind chill values as low as -12. Northwest wind around 5 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Jan 13",
      "conditions": "Bucks Run only: the metro parks website states Bucks is groomed for skate and classic. While technically true, it was groomed yesterday, not today. So with the slushing up in the warm sunshine yesterday and the overnight freeze, the classic tracks are icy and debris filled. Skate deck is hard and fast. Would be nice if the groomers would use those 2 big piles of snow, but rumor has it they are short staffed this week."
    }
  },
  "nubsNob": {
    "date": "1/13/26",
    "liftsOpen": "At least 5 chairlifts and the rope tow.",
    "xcTrails": "Trails were packed yesterday morning. There is a classic track set on all trails. Conditions are very good.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "The snow surface is expertly machine groomed this morning. The snow quality continues to be very good thanks to the fresh snow that fell a few days ago. The temperature will go above freezing today so softer snow is expected as the day goes on. The forecast is calling for a wintery mix of precipitation during the day. Pintail Peak Lodge is open with food service and the espresso bar. The soup of the day is tomato. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break at 4:30 p.m. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 7\"",
      "sevenDays": "7 days: 7\"",
      "ytd": "YTD: 79\""
    }
  }
}