{
  "timestamp": "2025-02-02T05:00:38.660Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738472400000,
          "temp": 17,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Cloudy",
          "detailedForecast": "Cloudy, with a low around 17. East southeast wind around 9 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1738494000000,
          "temp": 32,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow between 7am and 5pm, then a slight chance of freezing rain. Cloudy. High near 32, with temperatures falling to around 29 in the afternoon. South southeast wind 6 to 9 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1738537200000,
          "temp": 30,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Freezing Rain then Cloudy",
          "detailedForecast": "A slight chance of freezing rain before 7pm. Cloudy. Low around 30, with temperatures rising to around 34 overnight. South southwest wind around 5 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 42,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain",
          "detailedForecast": "A chance of rain after 7am. Cloudy, with a high near 42. Southwest wind around 6 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738472400000,
          "temp": 12,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 12, with temperatures rising to around 18 overnight. Southeast wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1738494000000,
          "temp": 33,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Light Snow then Snow Showers Likely",
          "detailedForecast": "Snow before 7am, then snow showers likely. Cloudy. High near 33, with temperatures falling to around 29 in the afternoon. South wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1738537200000,
          "temp": 26,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Chance Freezing Drizzle",
          "detailedForecast": "A chance of snow showers before 7pm, then a slight chance of snow and a slight chance of freezing drizzle between 7pm and 10pm, then a chance of freezing drizzle and a chance of drizzle and a slight chance of snow between 10pm and 2am, then a chance of snow and a slight chance of freezing drizzle and a slight chance of drizzle. Mostly cloudy. Low around 26, with temperatures rising to around 29 overnight. Southwest wind 5 to 15 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 28,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Likely",
          "detailedForecast": "Snow likely and a slight chance of freezing drizzle. Cloudy, with a high near 28. Northwest wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738472400000,
          "temp": 12,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. Low around 12, with temperatures rising to around 15 overnight. Wind chill values as low as 0. Southeast wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1738494000000,
          "temp": 31,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow then Snow Showers Likely",
          "detailedForecast": "Snow before 7am, then snow showers likely. Mostly cloudy. High near 31, with temperatures falling to around 28 in the afternoon. Wind chill values as low as 0. South wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1738537200000,
          "temp": 27,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers then Chance Light Snow",
          "detailedForecast": "A chance of snow showers before 7pm, then a chance of snow and a slight chance of freezing drizzle. Mostly cloudy. Low around 27, with temperatures rising to around 29 overnight. Southwest wind around 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 29,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow and a slight chance of freezing drizzle. Cloudy, with a high near 29. Northwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/1 and 2/2.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail has been groomed for skate and classic skiing today, February 1, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time.  When skiing the golf course trails please ski on designated marked trails only."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Feb 1",
      "conditions": "Bucks Run survived! (thank you thermodynamics) Tracks are hard and fast."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Jan 28",
      "conditions": "The red & blue trails were groomed up nicely after yesterday's snowfall. We skate skied both this morning while the current round of snow was falling which slowed things down a lot."
    }
  },
  "nubsNob": {
    "date": "2/1/25",
    "liftsOpen": "All 8 lifts, Space Worm and the rope tow",
    "xcTrails": "Trails are open and will be groomed this morning with a track set.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "It's a cold, clear and beautiful morning at Nub's. We had a small warm-up the last few days, but the snow did not get wet and the ski surface remains in exceptional shape. We should see some sunshine this morning, remember to bring your shades. NASTAR racing is open to the public from 12:30 to 2:30 PM. Pintail Peak lodge is open with a deli and espresso bar. Owen James will play the Nub's Pub at 3:30 PM. The Lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 PM to groom for night skiing. Bundle up and make it a great day at Nub's Nob!",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 101\""
    }
  }
}