{
  "timestamp": "2025-02-09T08:00:55.814Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739088000000,
          "temp": 23,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 23. Northwest wind around 6 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1739098800000,
          "temp": 31,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 31, with temperatures falling to around 28 in the afternoon. West northwest wind 6 to 9 mph."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1739142000000,
          "temp": 13,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy. Low around 13, with temperatures rising to around 15 overnight. West northwest wind around 5 mph."
        },
        {
          "name": "Monday",
          "timestamp": 1739185200000,
          "temp": 31,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 31. West wind 2 to 8 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739088000000,
          "temp": 15,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 15, with temperatures rising to around 19 overnight. Northwest wind around 10 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1739098800000,
          "temp": 20,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers before 1pm. Mostly cloudy. High near 20, with temperatures falling to around 18 in the afternoon. Northwest wind around 10 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1739142000000,
          "temp": 10,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 7pm. Mostly cloudy. Low around 10, with temperatures rising to around 12 overnight. West wind around 5 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Monday",
          "timestamp": 1739185200000,
          "temp": 21,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A slight chance of snow showers before 7am. Partly sunny, with a high near 21. West wind 5 to 15 mph. Chance of precipitation is 20%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1739088000000,
          "temp": 14,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 14, with temperatures rising to around 17 overnight. Northwest wind around 5 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1739098800000,
          "temp": 19,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. High near 19, with temperatures falling to around 17 in the afternoon. Northwest wind 10 to 15 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1739142000000,
          "temp": 9,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 9, with temperatures rising to around 11 overnight. West wind around 5 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1739185200000,
          "temp": 20,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 20. Wind chill values as low as 0. West wind 5 to 15 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, February 8, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time.  When skiing the golf course trails please ski on designated marked trails only."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/8 and 2/9.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Feb 7",
      "conditions": "Bucks has been good but likely groomed close to ski hours without time to set up,  so it’s turned to deep sugar after ski traffic. On the bright side, it is more work (challenging) and a good change from the rocket fast and effortless ball bearings as is typical. Wax is still insignificant…everything is fast. Still great to be skiing close to home and there seems to be a lot of daily XC traffic at HM."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 3",
      "conditions": "This morning’s  snow  was the icing on the cake over a well layered and constructed base . Beautiful groom - well done Nubs crew ! LF 7"
    }
  },
  "nubsNob": {
    "date": "2/8/25",
    "liftsOpen": "All 8 lifts, Space Worm and the rope tow",
    "xcTrails": "Trails are open and will be power-tilled and tracked this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Welcome to another awesome ski day at Nub's Nob. The wind is light and the temperature will be in the mid-20's today. Snow conditions are mid-winter excellent thanks to over an inch of fresh snow yesterday and the work of our award-winning Grooming Crew. NASTAR racing is available on Birch Run from 12:30 PM to 2:30 PM. The XC trails are also back in great shape with a fresh groom following the windstorm on Thursday. Myk Rise will play the Nub's Pub from 3:30 to 6 PM. The lifts will spin from 9:00 AM to 9:00 PM with an hour break at 4:30 to groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 2\"",
      "sevenDays": "7 days: 5\"",
      "ytd": "YTD: 106\""
    }
  }
}