{
  "timestamp": "2025-11-25T18:00:44.583Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764093600000,
          "temp": 51,
          "snowfall": 65,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy, with a high near 51. Southeast wind around 6 mph. Chance of precipitation is 70%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764111600000,
          "temp": 38,
          "snowfall": 65,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely then Areas Of Fog",
          "detailedForecast": "Rain showers likely before 7pm, then areas of fog and a chance of rain showers. Cloudy. Low around 38, with temperatures rising to around 46 overnight. South southwest wind 2 to 7 mph. Chance of precipitation is 70%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 50,
          "snowfall": 53,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain Showers then Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers before noon, then a chance of rain and snow showers. Mostly cloudy. High near 50, with temperatures falling to around 38 in the afternoon. Southwest wind 8 to 23 mph, with gusts as high as 47 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 29,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy, with a low around 29. West southwest wind 15 to 22 mph, with gusts as high as 46 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764093600000,
          "temp": 49,
          "snowfall": 49,
          "snowAmount": "",
          "shortForecast": "Chance Rain Showers",
          "detailedForecast": "A chance of rain showers. Cloudy. High near 49, with temperatures falling to around 46 in the afternoon. Southeast wind around 5 mph. Chance of precipitation is 50%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764111600000,
          "temp": 41,
          "snowfall": 60,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy, with a low around 41. Southeast wind 5 to 10 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 44,
          "snowfall": 88,
          "snowAmount": "",
          "shortForecast": "Rain Showers then Rain And Snow Showers",
          "detailedForecast": "Rain showers before 4pm, then rain and snow showers. Cloudy. High near 44, with temperatures falling to around 37 in the afternoon. South wind around 10 mph, with gusts as high as 25 mph. Chance of precipitation is 90%."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 27,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Rain and snow showers before 10pm, then snow showers and patchy blowing snow. Cloudy, with a low around 27. Northwest wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764093600000,
          "temp": 49,
          "snowfall": 57,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy. High near 49, with temperatures falling to around 46 in the afternoon. Southeast wind around 5 mph. Chance of precipitation is 60%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764111600000,
          "temp": 39,
          "snowfall": 58,
          "snowAmount": "",
          "shortForecast": "Rain Showers Likely",
          "detailedForecast": "Rain showers likely. Cloudy. Low around 39, with temperatures rising to around 42 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 60%. New rainfall amounts between a tenth and quarter of an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1764154800000,
          "temp": 43,
          "snowfall": 87,
          "snowAmount": "",
          "shortForecast": "Rain And Snow Showers",
          "detailedForecast": "Rain showers before 11am, then rain and snow showers. Cloudy. High near 43, with temperatures falling to around 35 in the afternoon. Southwest wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1764198000000,
          "temp": 25,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Rain and snow showers before 9pm, then snow showers and patchy blowing snow. Cloudy, with a low around 25. West wind 10 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {},
  "nubsNob": {
    "date": "11/19/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Closed",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The Snow Crew turned the guns on last night. Despite some cold temperatures in the area the conditions at Nub's Nob allowed for only a few hours of quality snowmaking. The team is here around the clock, ready for the next opportunity. At this point it looks like there is a turn toward colder weather right around Thanksgiving. We will continue to update the blog to keep you up to date. Think COLD and SNOW.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 5\"",
      "ytd": "YTD: 5\""
    }
  }
}