{
  "timestamp": "2025-12-19T05:01:55.509Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766120400000,
          "temp": 23,
          "snowfall": 71,
          "snowAmount": "",
          "shortForecast": "Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers before 3am, then a chance of rain and snow showers. Cloudy. Low around 23, with temperatures rising to around 29 overnight. West southwest wind 10 to 14 mph, with gusts as high as 26 mph. Chance of precipitation is 70%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1766142000000,
          "temp": 29,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 5pm. Mostly cloudy. High near 29, with temperatures falling to around 25 in the afternoon. West wind 14 to 17 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1766185200000,
          "temp": 20,
          "snowfall": 11,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 20, with temperatures rising to around 22 overnight. West southwest wind 5 to 13 mph, with gusts as high as 26 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1766228400000,
          "temp": 38,
          "snowfall": 23,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1pm. Mostly cloudy, with a high near 38. South southwest wind 8 to 12 mph, with gusts as high as 23 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766120400000,
          "temp": 15,
          "snowfall": 79,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Rain and snow showers before 5am, then snow showers and areas of blowing snow. Cloudy. Low around 15, with temperatures rising to around 23 overnight. West wind 15 to 20 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1766142000000,
          "temp": 22,
          "snowfall": 81,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow before 1pm, then areas of blowing snow and a chance of snow showers. Mostly cloudy. High near 22, with temperatures falling to around 18 in the afternoon. Wind chill values as low as -1. Northwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1766185200000,
          "temp": 16,
          "snowfall": 36,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 16, with temperatures rising to around 20 overnight. Southwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1766228400000,
          "temp": 32,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 32. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766120400000,
          "temp": 15,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers before 5am, then snow showers and areas of blowing snow. Cloudy. Low around 15, with temperatures rising to around 23 overnight. Southwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1766142000000,
          "temp": 21,
          "snowfall": 86,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow before 1pm, then areas of blowing snow and a chance of snow showers. Mostly cloudy. High near 21, with temperatures falling to around 17 in the afternoon. Wind chill values as low as -1. Northwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1766185200000,
          "temp": 13,
          "snowfall": 24,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 13, with temperatures rising to around 19 overnight. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1766228400000,
          "temp": 31,
          "snowfall": 56,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 31. Southwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 17",
      "conditions": "Skated Coyote from 8 to 10.Softer and more control than Tuesday. Tracks are good with a lot of leaves."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Dec 16",
      "conditions": "All trails power-tilled flat with a classic track and wide skate deck. Conditions are very good."
    }
  },
  "nubsNob": {
    "date": "12/18/25",
    "liftsOpen": "4 chairlifts and the rope tow.",
    "xcTrails": "All trails were power-tilled and tracked on Tuesday. We will not groom until the temperature goes below freezing. Coverage is still very good.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "It's a warm ski day at Nub's Nob. The temperature is forecast to go above 40 degrees, which should result in  soft snow conditions this afternoon. Snow depth and coverage continues to be very good. Pintail Peak opens this Friday. The Big Park opens on Saturday. Lifts will spin from 9:00 a.m. to 4:30 p.m. today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 45\""
    }
  }
}