{
  "timestamp": "2025-12-05T14:00:39.080Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1764943200000,
          "temp": 27,
          "snowfall": 2,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 27, with temperatures falling to around 25 in the afternoon. South southwest wind 6 to 9 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1764975600000,
          "temp": 21,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1am. Mostly cloudy. Low around 21, with temperatures rising to around 25 overnight. South southwest wind around 7 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Saturday",
          "timestamp": 1765018800000,
          "temp": 35,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow before 1pm. Mostly cloudy. High near 35, with temperatures falling to around 31 in the afternoon. West southwest wind 7 to 10 mph, with gusts as high as 20 mph."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1765062000000,
          "temp": 20,
          "snowfall": 15,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1am. Mostly cloudy, with a low around 20. North northwest wind 1 to 5 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1764928800000,
          "temp": 14,
          "snowfall": 38,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "A chance of snow showers and patchy blowing snow. Mostly cloudy. Low around 14, with temperatures rising to around 19 overnight. Southwest wind around 20 mph, with gusts as high as 40 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1764932400000,
          "temp": 30,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow. Cloudy, with a high near 30. Southwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1764975600000,
          "temp": 21,
          "snowfall": 93,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 21, with temperatures rising to around 25 overnight. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1765018800000,
          "temp": 27,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely before 1pm. Mostly cloudy, with a high near 27. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1764943200000,
          "temp": 27,
          "snowfall": 54,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 27. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764975600000,
          "temp": 20,
          "snowfall": 86,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 20, with temperatures rising to around 23 overnight. Southwest wind around 10 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1765018800000,
          "temp": 26,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers before 1pm. Mostly cloudy. High near 26, with temperatures falling to around 19 in the afternoon. West wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1765062000000,
          "temp": 11,
          "snowfall": 61,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Mostly Cloudy then Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 1am. Mostly cloudy, with a low around 11. West wind 0 to 5 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Dec 4",
      "conditions": "Really terrific skating Thursday morning. As reported, golf course was rolled this morning, and it's gorgeous (90% perfect, the rest is grassy).  Thank you, Metroparks!  From the Metroparks web site: \"Bucks Run is currently closed.  Snow is currently being made for Bucks Run and construction will being in the coming weeks. Patrons are free to ski on the trails marked by orange flags on the golf course trails as conditions allow.  The golf course and Cedar Trace trails will be rolled this morning December 4, 2025.  No additional grooming will take place until we receive additional snow.\""
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Dec 1",
      "conditions": "Nubs Nob is not yet open for its down hill program : coming this weekend . But the groomers jumped the gun on the Nordic Trails . Access through Valley road to the red and blue loops are currently primo !"
    }
  },
  "nubsNob": {
    "date": "12/05/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "All trails will be open this Saturday and Sunday. We are packing the trails every morning to improve conditions. Expect very good conditions this weekend.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob will open tomorrow and Sunday for the first two days of the ski season! We anticipate having 12 runs open which includes almost every run on our frontside with the exception of Scarface, Chute and Twilight Zone. We will have 3 chairlifts (Purple, Green, Yellow) open along with the rope tow and Space Worm. The lifts will spin from 9 AM to 4:30 PM. See you on Saturday! We will be open daily for skiing and riding beginning on December 12.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 19\"",
      "ytd": "YTD: 24\""
    }
  }
}