{
  "timestamp": "2025-02-03T10:00:36.710Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738576800000,
          "temp": 28,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Areas Of Fog",
          "detailedForecast": "Areas of fog. Cloudy. Low around 28, with temperatures rising to around 32 overnight. South wind around 2 mph."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 43,
          "snowfall": 0,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Areas Of Fog",
          "detailedForecast": "Areas of fog before 7am, then areas of fog and a slight chance of rain. Cloudy. High near 43, with temperatures falling to around 41 in the afternoon. South southwest wind 2 to 7 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1738623600000,
          "temp": 23,
          "snowfall": 0,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Light Rain then Mostly Cloudy",
          "detailedForecast": "A slight chance of rain before 7pm. Mostly cloudy. Low around 23, with temperatures rising to around 25 overnight. North northwest wind around 7 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738666800000,
          "temp": 29,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 29. North northwest wind around 8 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738576800000,
          "temp": 25,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 25, with temperatures rising to around 32 overnight. West wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 31,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow before 4pm. Cloudy. High near 31, with temperatures falling to around 25 in the afternoon. Northwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1738623600000,
          "temp": 13,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Mostly Cloudy then Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow after 1am. Mostly cloudy. Low around 13, with temperatures rising to around 15 overnight. Northwest wind around 10 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738666800000,
          "temp": 20,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow then Partly Sunny",
          "detailedForecast": "A slight chance of snow before 7am. Partly sunny, with a high near 20. Wind chill values as low as 0. Northwest wind 5 to 10 mph. Chance of precipitation is 20%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1738576800000,
          "temp": 24,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy. Low around 24, with temperatures rising to around 30 overnight. West wind around 5 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1738580400000,
          "temp": 31,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Heavy Snow",
          "detailedForecast": "Snow before 4pm. Cloudy. High near 31, with temperatures falling to around 25 in the afternoon. Northwest wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 7 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1738623600000,
          "temp": 11,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Mostly Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of snow after 1am. Mostly cloudy. Low around 11, with temperatures rising to around 14 overnight. Northwest wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738666800000,
          "temp": 19,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow then Slight Chance Snow Showers",
          "detailedForecast": "A chance of snow before 7am, then a slight chance of snow showers between 7am and 1pm. Mostly cloudy, with a high near 19. Wind chill values as low as -2. Northwest wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Ski center will be closed 2/1 and 2/2.   Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail has been groomed for skate and classic skiing today, February 2, 2025 . There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Due to limited snowfall trails are unable to be groomed at this time.  When skiing the golf course trails please ski on designated marked trails only."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Feb 2",
      "conditions": "Great day today at Huron Meadows’ Bucks Run. Skied classic for about 50 min. Double set of tracks was great. I found the tracks fast and with good grip for the kick. I used A skis. Saw fewer skaters than usual, not sure why, but the skate deck seemed great. Connector to club house was in great shape."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Jan 28",
      "conditions": "The red & blue trails were groomed up nicely after yesterday's snowfall. We skate skied both this morning while the current round of snow was falling which slowed things down a lot."
    }
  },
  "nubsNob": {
    "date": "2/2/25",
    "liftsOpen": "All 8 lifts, Space Worm and the rope tow",
    "xcTrails": "Trails continue to be in very good condition and will be packed again this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Welcome to an ideal Northern Michigan ski day. The temperature should climb to around 32 degrees with light wind. A dusting of snow landed on the corduroy this morning and a few more inches are forecast today. Snow surface and grooming are top-notch. Birch Run and JB Arena are closed for the Nordica Winter Rally junior club race. The lifts will spin from 9:00 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Dusting",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 9\"",
      "ytd": "YTD: 101\""
    }
  }
}