{
  "timestamp": "2025-03-01T04:00:35.145Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740801600000,
          "temp": 20,
          "snowfall": 20,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers between 1am and 4am. Mostly cloudy. Low around 20, with temperatures rising to around 22 overnight. West northwest wind around 16 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1740826800000,
          "temp": 24,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 24. Northwest wind 10 to 15 mph, with gusts as high as 28 mph."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1740870000000,
          "temp": 15,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 15. Northwest wind 5 to 10 mph, with gusts as high as 18 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1740913200000,
          "temp": 32,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 32. West northwest wind around 6 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740801600000,
          "temp": 4,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Areas Of Blowing Snow",
          "detailedForecast": "Areas of blowing snow and a chance of snow before 4am, then a slight chance of snow showers. Mostly cloudy. Low around 4, with temperatures rising to around 6 overnight. Wind chill values as low as -13. North wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 30%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1740826800000,
          "temp": 16,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Partly sunny, with a high near 16. Wind chill values as low as -12. North wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1740870000000,
          "temp": 9,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 9, with temperatures rising to around 11 overnight. Wind chill values as low as -1. Northwest wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1740913200000,
          "temp": 24,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers then Partly Sunny",
          "detailedForecast": "A slight chance of snow showers before 7am. Partly sunny, with a high near 24. Northwest wind around 5 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1740801600000,
          "temp": 3,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Areas Of Blowing Snow",
          "detailedForecast": "Areas of blowing snow and a chance of snow before 1am, then a chance of snow and patchy blowing snow between 1am and 4am, then a chance of snow showers. Mostly cloudy. Low around 3, with temperatures rising to around 6 overnight. Wind chill values as low as -13. Northwest wind 15 to 25 mph, with gusts as high as 45 mph. Chance of precipitation is 50%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Saturday",
          "timestamp": 1740826800000,
          "temp": 15,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly sunny, with a high near 15. Wind chill values as low as -12. Northwest wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Saturday Night",
          "timestamp": 1740870000000,
          "temp": 5,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 5, with temperatures rising to around 8 overnight. Wind chill values as low as -2. Northwest wind 5 to 10 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Sunday",
          "timestamp": 1740913200000,
          "temp": 23,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1pm. Mostly cloudy, with a high near 23. Wind chill values as low as 0. West wind 0 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for classic and skate ski today, February 28, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125. Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Due to the warm, rainy weather, trails have deteriorated and are not suitable for skiing."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Fri, Feb 28",
      "conditions": "Good skiing on bucks today 12 to 2 till warm weather hit.  Still plenty of snow on trail.  Can still ski from clubhouse and into woods.  Double track on most of the trail  Should be good for next few days with colder weather."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Sat, Feb 22",
      "conditions": "Skied Stony Creek late in the afternoon on Friday 2/21.  The Golf Course trails to the East of the parking lot was rolled and classic tracks groomed.  They generally groom early on Saturdays for weekend visitors.  Snow was equal to the best you will see in SE lower MI.  Did not ski the trails in the woods West of the parking lot.The park closes at 8:00 PM, so it might be possible to get in some night skiing.  Warmer temps and rain are coming.  Enjoy Stony Creek NOW>"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 24",
      "conditions": "Lovely blue sky Spring skiing on the Red and Blue loops today . Surprisingly little wind debris . The trail and groom is holding well.  The skate had a bit of suck : but I had rilled and LF 8 worked well."
    }
  },
  "nubsNob": {
    "date": "2/28/25",
    "liftsOpen": "At least 6 lifts, the Space Worm, and the Rope Tow",
    "xcTrails": "Trails are open with good coverage. Trails will be groomed and tracked tomorrow morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "Nearly an inch of snow has fallen at Nub's this morning and it continues to snow on top of the machine groomed snow. The forecast is calling for some snow to continue to fall today. The snow coverage and depth are very good on all of our snowmaking runs, it still feels like the middle of winter at Nub's Nob. Pintail Peak Lodge is open until 3:30 PM with a deli and an espresso bar. The lifts will spin from 9:00 AM to 9:00 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 1\"",
      "sevenDays": "7 days: 2\"",
      "ytd": "YTD: 129\""
    }
  }
}