{
  "timestamp": "2025-11-30T22:00:36.862Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764540000000,
          "temp": 37,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Cloudy. High near 37, with temperatures falling to around 32 in the afternoon. West northwest wind around 14 mph, with gusts as high as 30 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tonight",
          "timestamp": 1764543600000,
          "temp": 18,
          "snowfall": 33,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers then Partly Cloudy",
          "detailedForecast": "Scattered snow showers before 9pm. Partly cloudy. Low around 18, with temperatures rising to around 20 overnight. West northwest wind 5 to 14 mph, with gusts as high as 30 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Monday",
          "timestamp": 1764586800000,
          "temp": 31,
          "snowfall": 3,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny. High near 31, with temperatures falling to around 28 in the afternoon. West southwest wind 2 to 6 mph."
        },
        {
          "name": "Monday Night",
          "timestamp": 1764630000000,
          "temp": 21,
          "snowfall": 75,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow after 7pm. Cloudy, with a low around 21. Southeast wind around 3 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764540000000,
          "temp": 31,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Partly sunny. High near 31, with temperatures falling to around 25 in the afternoon. Northwest wind around 15 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764543600000,
          "temp": 18,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Mostly cloudy. Low around 18, with temperatures rising to around 20 overnight. Northwest wind 5 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1764586800000,
          "temp": 28,
          "snowfall": 41,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Cloudy, with a high near 28. Southwest wind 5 to 15 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1764630000000,
          "temp": 21,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 21. Southwest wind 5 to 15 mph. Chance of precipitation is 80%. New snow accumulation of 3 to 7 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1764540000000,
          "temp": 30,
          "snowfall": 26,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers. Mostly cloudy. High near 30, with temperatures falling to around 24 in the afternoon. Northwest wind around 15 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1764543600000,
          "temp": 13,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Patchy Blowing Snow then Chance Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Patchy blowing snow and scattered snow showers before 7pm, then a chance of snow showers and patchy blowing snow between 7pm and 4am. Mostly cloudy. Low around 13, with temperatures rising to around 16 overnight. West wind 5 to 10 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1764586800000,
          "temp": 26,
          "snowfall": 13,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 26, with temperatures falling to around 24 in the afternoon. Southwest wind 5 to 10 mph."
        },
        {
          "name": "Monday Night",
          "timestamp": 1764630000000,
          "temp": 17,
          "snowfall": 72,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7pm. Mostly cloudy, with a low around 17. Southwest wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Nov 29",
      "conditions": "Has anybody been by HM to see if they are blowing snow yet? Ski hills in the area have been making snow for a few days now."
    }
  },
  "nubsNob": {
    "date": "11/30/25: Pre-Season Update",
    "liftsOpen": "0",
    "xcTrails": "Trails are being packed today. Not open for skiing as we prepare trails.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today as we focus on snowmaking. We will be open for skiing and riding December 6 and 7 from 9 a.m. to 4:30 p.m. for our first two days of the ski season. Thanks to the Nub's Nob Snow Farmers and some natural snow we should be in very good shape for this opening weekend. Stay tuned for more details including a run count over the next few days. See you on the slopes next weekend!",
    "snowData": {
      "daily": "5\"",
      "threeDays": "3 days: 8\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 13\""
    }
  }
}