{
  "timestamp": "2026-01-20T08:00:37.167Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768892400000,
          "temp": 6,
          "snowfall": 29,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 6. Wind chill values as low as -6. West southwest wind around 8 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 17,
          "snowfall": 29,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1pm. Mostly cloudy. High near 17, with temperatures falling to around 15 in the afternoon. Wind chill values as low as -7. West southwest wind 5 to 12 mph, with gusts as high as 21 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1768950000000,
          "temp": 10,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Mostly Cloudy then Chance Light Snow",
          "detailedForecast": "A chance of snow after 1am. Mostly cloudy. Low around 10, with temperatures rising to around 16 overnight. Wind chill values as low as 0. South southwest wind around 8 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768993200000,
          "temp": 33,
          "snowfall": 87,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow. Cloudy, with a high near 33. South southwest wind 8 to 13 mph, with gusts as high as 23 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768892400000,
          "temp": 4,
          "snowfall": 28,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 4. Wind chill values as low as -15. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 15,
          "snowfall": 24,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers. Mostly cloudy. High near 15, with temperatures falling to around 12 in the afternoon. Wind chill values as low as -15. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1768950000000,
          "temp": 11,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 11, with temperatures rising to around 15 overnight. Wind chill values as low as -3. Southwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768993200000,
          "temp": 21,
          "snowfall": 68,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 21. Southwest wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1768892400000,
          "temp": 2,
          "snowfall": 57,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a low around 2. Wind chill values as low as -15. West wind around 15 mph. Chance of precipitation is 60%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1768906800000,
          "temp": 11,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 11, with temperatures falling to around 9 in the afternoon. Wind chill values as low as -15. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1768950000000,
          "temp": 6,
          "snowfall": 47,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. Low around 6, with temperatures rising to around 11 overnight. Wind chill values as low as -7. Southwest wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 50%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1768993200000,
          "temp": 21,
          "snowfall": 79,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 21. Wind chill values as low as -1. Southwest wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sun, Jan 18",
      "conditions": "Bucks Run was firm and fast this afternoon as there had been a lot of skiers on the course.  When I arrived around 4 pm the parking lot was jammed and there were a lot of skiers on the trail.  Conditions should remain very good with the potential snow later tonight and colder temps in the forecast.    Great job by the Huron Meadows crew!"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Thu, Jan 15",
      "conditions": "Skiing is awesome with a 24\" base of natural snow and daily power tilling.  All trails are open.  Save $20 on race registration by registering online at SKIREG.com by 10 pm tonight!"
    }
  },
  "nubsNob": {
    "date": "1/19/26",
    "liftsOpen": "6 chairlifts, conveyor and the rope tow.",
    "xcTrails": "Trails will be power-tilled and tracked later this morning.",
    "nightSkiing": "Tuesday thru Saturday from 5:30 to 9:00 p.m.",
    "comments": "It's nuking snow at Nub's this morning. Lake effect bands are dropping snow rapidly and the slopes are covered in a powder blanket. The majority of snow fell after grooming this morning. The grooming crew is going out a second time to put lines down on the beginner terrain and less steep runs. Expect powder on the expert terrain and much of the intermediate runs. If you prefer groomers head to Pintail Peak as that will be groomed last. The soup of the day is sweet and sour sweet potato with ham. Pintail Peak Lodge is open with food service and the espresso bar. Lifts will turn from 9:00 a.m. to 4:30 p.m. Grab the wide skis and enjoy an epic MLK jr. Holiday at Nub's Nob.",
    "snowData": {
      "daily": "6\"",
      "threeDays": "3 days: 11\"",
      "sevenDays": "7 days: 15\"",
      "ytd": "YTD: 94\""
    }
  }
}