{
  "timestamp": "2025-12-10T12:00:51.346Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765368000000,
          "temp": 38,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow before 4pm. Cloudy. High near 38, with temperatures falling to around 30 in the afternoon. West wind 8 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765407600000,
          "temp": 16,
          "snowfall": 8,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 16. Northwest wind 8 to 14 mph, with gusts as high as 26 mph. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 28,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 28, with temperatures falling to around 26 in the afternoon. West wind around 10 mph, with gusts as high as 21 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 15,
          "snowfall": 12,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 15. West wind 2 to 7 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765368000000,
          "temp": 26,
          "snowfall": 15,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 10am. Mostly cloudy. High near 26, with temperatures falling to around 20 in the afternoon. North wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%."
        },
        {
          "name": "Tonight",
          "timestamp": 1765407600000,
          "temp": 16,
          "snowfall": 52,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7pm. Mostly cloudy. Low around 16, with temperatures rising to around 18 overnight. Northwest wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 27,
          "snowfall": 36,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 27, with temperatures falling to around 25 in the afternoon. Northwest wind around 10 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 18,
          "snowfall": 26,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 18. Northwest wind 5 to 10 mph. Chance of precipitation is 30%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765368000000,
          "temp": 26,
          "snowfall": 45,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 26, with temperatures falling to around 19 in the afternoon. North wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1765407600000,
          "temp": 12,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 12, with temperatures rising to around 15 overnight. Northwest wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 25,
          "snowfall": 42,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy. High near 25, with temperatures falling to around 23 in the afternoon. Northwest wind around 10 mph. Chance of precipitation is 40%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1765494000000,
          "temp": 14,
          "snowfall": 33,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 14. West wind 0 to 5 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Dec 9",
      "conditions": "From the park website: Bucks Run is currently closed.  Snow is currently being made for Bucks Run and construction will being in the coming weeks. The golf course trails, Coyote Run and Hawk Hills, along with Cedar Trace were rolled December 9, 2025.  No additional grooming has taken place."
    }
  },
  "nubsNob": {
    "date": "12/09/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning Friday, December 12. The Snow Crew is making rapid progress and we plan to have all of the frontside and southside runs open this weekend which will bring our run count to over 30 runs. Pintail Peak will open by the following weekend. Thanks for skiing at Nub's Nob.",
    "snowData": {
      "daily": "4\"",
      "threeDays": "3 days: 4\"",
      "sevenDays": "7 days: 8\"",
      "ytd": "YTD: 31\""
    }
  }
}