{
  "timestamp": "2025-02-27T21:00:37.830Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1740686400000,
          "temp": 42,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Rain And Snow Showers",
          "detailedForecast": "Scattered rain and snow showers. Mostly cloudy. High near 42, with temperatures falling to around 40 in the afternoon. West wind around 12 mph, with gusts as high as 24 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1740697200000,
          "temp": 28,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Scattered Rain And Snow Showers then Mostly Cloudy",
          "detailedForecast": "Scattered rain and snow showers before 11pm. Mostly cloudy. Low around 28, with temperatures rising to around 30 overnight. West wind 5 to 12 mph, with gusts as high as 24 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1740740400000,
          "temp": 52,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers between 8am and 1pm. Mostly cloudy, with a high near 52. Southwest wind 6 to 17 mph, with gusts as high as 37 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1740783600000,
          "temp": 23,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Rain And Snow Showers",
          "detailedForecast": "A chance of rain showers between 7pm and 10pm, then a chance of rain and snow showers. Mostly cloudy, with a low around 23. West northwest wind 10 to 14 mph, with gusts as high as 33 mph. Chance of precipitation is 30%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1740686400000,
          "temp": 38,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 38. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1740697200000,
          "temp": 22,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely before 1am, then snow. Mostly cloudy. Low around 22, with temperatures rising to around 25 overnight. West wind 5 to 10 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Friday",
          "timestamp": 1740740400000,
          "temp": 37,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Heavy Snow And Patchy Blowing Snow",
          "detailedForecast": "Snow before 7am, then snow and patchy blowing snow between 7am and noon, then patchy blowing snow and rain and snow between noon and 4pm, then patchy blowing snow and rain and snow likely. Cloudy. High near 37, with temperatures falling to around 35 in the afternoon. Southwest wind around 10 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1740783600000,
          "temp": 5,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow Likely And Patchy Blowing Snow then Chance Snow Showers",
          "detailedForecast": "Snow likely and patchy blowing snow before 7pm, then a chance of snow showers between 7pm and 1am. Mostly cloudy, with a low around 5. Wind chill values as low as -10. North wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1740686400000,
          "temp": 39,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 39. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1740697200000,
          "temp": 20,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely before 1am, then snow likely. Mostly cloudy. Low around 20, with temperatures rising to around 23 overnight. West wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Friday",
          "timestamp": 1740740400000,
          "temp": 41,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow And Patchy Blowing Snow then Rain And Snow",
          "detailedForecast": "Snow likely before 7am, then snow and patchy blowing snow between 7am and 11am, then rain and snow between 11am and 5pm, then rain and snow likely. Cloudy, with a high near 41. Southwest wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Friday Night",
          "timestamp": 1740783600000,
          "temp": 4,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Rain And Snow Likely then Snow Showers",
          "detailedForecast": "Rain and snow likely before 7pm, then snow showers. Mostly cloudy, with a low around 4. Wind chill values as low as -10. Northwest wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for classic and skate ski today, February 27, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125. Dogs and walkers are not permitted on our groomed trails. No trails on the golf course."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "–  Due to the warm, rainy weather, trails have deteriorated and are not suitable for skiing."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Thu, Feb 27",
      "conditions": "Bucks run still going strong. I recommend. Slushy and slow but holding up. The far lobe is deteriorating quickest but still full coverage as of 1:50 today. I say get it while you can!"
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Sat, Feb 22",
      "conditions": "Skied Stony Creek late in the afternoon on Friday 2/21.  The Golf Course trails to the East of the parking lot was rolled and classic tracks groomed.  They generally groom early on Saturdays for weekend visitors.  Snow was equal to the best you will see in SE lower MI.  Did not ski the trails in the woods West of the parking lot.The park closes at 8:00 PM, so it might be possible to get in some night skiing.  Warmer temps and rain are coming.  Enjoy Stony Creek NOW>"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Feb 24",
      "conditions": "Lovely blue sky Spring skiing on the Red and Blue loops today . Surprisingly little wind debris . The trail and groom is holding well.  The skate had a bit of suck : but I had rilled and LF 8 worked well."
    }
  },
  "nubsNob": {
    "date": "2/27/25",
    "liftsOpen": "5 lifts and the Rope Tow",
    "xcTrails": "Trails are open but soft this morning. Trails will not be groomed until the snow freezes. We still have a very good base of snow on the trails.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "The snow is soft this morning. It looks like the temperature should stay above freezing for the majority of the day. A drop in temperature is expected this evening. A significant snow event is predicted to hit our region starting tomorrow morning. Pintail Peak Lodge is open until 3:30 PM with a deli and an espresso bar. The lifts will spin from 9:00 AM to 9:00 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 2\"",
      "ytd": "YTD: 128\""
    }
  }
}