{
  "timestamp": "2025-03-16T18:00:45.140Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1742148000000,
          "temp": 58,
          "snowfall": 40,
          "snowAmount": "",
          "shortForecast": "Chance Light Rain",
          "detailedForecast": "A chance of rain. Mostly cloudy. High near 58, with temperatures falling to around 40 in the afternoon. West wind around 14 mph, with gusts as high as 23 mph. Chance of precipitation is 40%. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1742162400000,
          "temp": 28,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of rain before 8pm, then a chance of snow between 8pm and 1am. Mostly cloudy, with a low around 28. Northwest wind 6 to 12 mph, with gusts as high as 22 mph. Chance of precipitation is 40%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742205600000,
          "temp": 47,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 47, with temperatures falling to around 45 in the afternoon. West southwest wind around 6 mph."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742248800000,
          "temp": 35,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Clear",
          "detailedForecast": "Mostly clear, with a low around 35. South wind around 7 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1742144400000,
          "temp": 33,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. High near 33, with temperatures falling to around 27 in the afternoon. Northwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1742162400000,
          "temp": 20,
          "snowfall": 20,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Isolated Snow Showers then Mostly Cloudy",
          "detailedForecast": "Isolated snow showers before 8pm. Mostly cloudy, with a low around 20. Northwest wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742205600000,
          "temp": 42,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny then Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers after 5pm. Mostly sunny. High near 42, with temperatures falling to around 39 in the afternoon. South wind 5 to 10 mph."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742248800000,
          "temp": 31,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers before 8pm. Mostly cloudy, with a low around 31. South wind around 10 mph."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1742144400000,
          "temp": 35,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 4 to 6 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. High near 35, with temperatures falling to around 27 in the afternoon. Northwest wind 15 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 4 to 6 inches possible. Little or no ice accumulation expected."
        },
        {
          "name": "Tonight",
          "timestamp": 1742162400000,
          "temp": 17,
          "snowfall": 30,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Scattered Snow Showers then Mostly Cloudy",
          "detailedForecast": "Scattered snow showers before 8pm. Mostly cloudy. Low around 17, with temperatures rising to around 19 overnight. Northwest wind 5 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 30%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1742205600000,
          "temp": 43,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny. High near 43, with temperatures falling to around 39 in the afternoon. Southwest wind 0 to 15 mph."
        },
        {
          "name": "Monday Night",
          "timestamp": 1742248800000,
          "temp": 30,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 30. South wind around 10 mph."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Closed for the season."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Cross Country Ski center closed for the season."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Mon, Mar 10",
      "conditions": "Nubs has plenty of coverage , depth , and groom on the upper loops. The sweet spot between hard and soft was 10:30 to 1:00. A little bit of wind debris , but not an issue . LF 8 rilled"
    }
  },
  "nubsNob": {
    "date": "3/16/25",
    "liftsOpen": "At least 6 Lifts, Rope Tow and Space Worm",
    "xcTrails": "Trails are in late season. Expect bare spots, especially on the lower trails.",
    "nightSkiing": "Done for the season.",
    "comments": "What a difference a day makes. This morning it is raining at Nub's but that is forecast to change to snow soon with some accumulation expected. The groomers are out in full force this morning. As the snow begins to freeze expect variable conditions on the slopes. Today is TELEbration sponsored by our friends at The Outfitter of Harbor Springs. This is a great chance to try a pair of demo telemark skis and hang out with your free-heel friends at the warming hut at the bottom of Birch Run. NASTAR Racing today from 12:30 to 2:30 PM. Pintail Peak lodge is open with a deli and an espresso bar. The lifts will spin from 9 AM to 4:30 PM. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 0\"",
      "ytd": "YTD: 135\""
    }
  }
}