{
  "timestamp": "2025-01-19T00:01:01.934Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1737244800000,
          "temp": 14,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 14. North northwest wind 6 to 10 mph, with gusts as high as 20 mph."
        },
        {
          "name": "Sunday",
          "timestamp": 1737284400000,
          "temp": 19,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers after 7am. Cloudy. High near 19, with temperatures falling to around 17 in the afternoon. Northwest wind 6 to 9 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1737327600000,
          "temp": 4,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am, then a slight chance of snow. Mostly cloudy, with a low around 4. Wind chill values as low as -8. West northwest wind around 10 mph, with gusts as high as 20 mph. Chance of precipitation is 30%."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1737370800000,
          "temp": 11,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Slight Chance Light Snow",
          "detailedForecast": "A slight chance of snow. Partly sunny, with a high near 11. Wind chill values as low as -9. West wind around 12 mph, with gusts as high as 22 mph."
        }
      ]
    },
    "harborSprings": {
      "name": "Harbor Springs",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1737244800000,
          "temp": 10,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. Low around 10, with temperatures rising to around 13 overnight. Wind chill values as low as 0. Northwest wind 10 to 15 mph. Chance of precipitation is 60%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Sunday",
          "timestamp": 1737284400000,
          "temp": 15,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Cloudy. High near 15, with temperatures falling to around 13 in the afternoon. Wind chill values as low as -2. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1737327600000,
          "temp": 5,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 5. Wind chill values as low as -9. Northwest wind around 10 mph. Chance of precipitation is 70%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "M.L. King Jr. Day",
          "timestamp": 1737370800000,
          "temp": 11,
          "snowfall": 60,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 11. Wind chill values as low as -10. West wind 10 to 15 mph. Chance of precipitation is 60%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 18th and 19th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail was groomed for skate and classic skiing yesterday, January 17, 2025.  Due to wet snow conditions no additional grooming will be taking place today, January 18, 2025.  The trail is still open and skiable.  There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– These trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Trail was not groomed due to rain and warm temperatures.Was just a little icy at 9:00.Now at 12:00 with falling temperatures it is very icy for either skate or classic.Connector is a sheet of ice.Lots of leaves and debris with wind."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Wed, Jan 15",
      "conditions": "They've finally got enough accumulation to make the golf course skiable. Used waxless rock skis and had a very nice time. Skied some in the woods, flats are doable but wouldn't try any hills, not enough snow yet."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 18",
      "conditions": "Plenty of lake effect , combined with low 20 degree temps, plus the full big groom this morning , makes Nubs Knob red and blue trails as nice as it gets !"
    }
  },
  "nubsNob": {
    "date": "1/18/25",
    "liftsOpen": "All 8 Lifts, Space Worm and the Rope Tow",
    "xcTrails": "Trails are open and in great shape. Trails will be groomed and tracked again this morning.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM. Extra night session Sunday, January 19 from 5:30 to 9:00 PM as well.",
    "comments": "It should be a great ski day at Nub's Nob. The wind is up this morning but is forecast to lay down as the day goes on. Last night we received a little rain that froze on the snow. The dedicated Grooming Crew power-tilled the slopes two times last night to get the best possible surface for skiing and riding. NASTAR racing is open to the public today from 12:30 to 2:30 PM on Birch Run, please sign-up at the Front Desk. Pete Kehoe will be playing at 3:30 PM. The lifts spin from 9:00 AM to 9:00 PM today with an hour break beginning at 4:30 to prepare for the night session. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 5\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 73\""
    }
  }
}