{
  "timestamp": "2025-01-27T22:00:38.767Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1738011600000,
          "temp": 38,
          "snowfall": 30,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly sunny, with a high near 38. West southwest wind around 24 mph, with gusts as high as 46 mph. Chance of precipitation is 30%."
        },
        {
          "name": "Tonight",
          "timestamp": 1738018800000,
          "temp": 20,
          "snowfall": 40,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy. Low around 20, with temperatures rising to around 24 overnight. West wind 10 to 23 mph, with gusts as high as 47 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 35,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Scattered Snow Showers then Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow. Mostly cloudy. High near 35, with temperatures falling to around 30 in the afternoon. West wind 7 to 13 mph, with gusts as high as 28 mph. Chance of precipitation is 50%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 29,
          "snowfall": 50,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow",
          "detailedForecast": "A chance of snow. Mostly cloudy, with a low around 29. West southwest wind 13 to 16 mph, with gusts as high as 31 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1738015200000,
          "temp": 31,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Cloudy, with a high near 31. West wind around 20 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1738018800000,
          "temp": 6,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy. Low around 6, with temperatures rising to around 8 overnight. Wind chill values as low as -4. Northwest wind 5 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 30,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 30, with temperatures falling to around 24 in the afternoon. Wind chill values as low as -3. West wind 5 to 15 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 17,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 3 to 7 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 17. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 90%. New snow accumulation of 3 to 7 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1738011600000,
          "temp": 33,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy. High near 33, with temperatures falling to around 31 in the afternoon. West wind around 25 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1738018800000,
          "temp": 4,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy. Low around 4, with temperatures rising to around 6 overnight. Wind chill values as low as -5. Northwest wind 5 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1738062000000,
          "temp": 28,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 28, with temperatures falling to around 23 in the afternoon. Wind chill values as low as -5. West wind 5 to 10 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Tuesday Night",
          "timestamp": 1738105200000,
          "temp": 17,
          "snowfall": 90,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a low around 17. West wind 10 to 15 mph, with gusts as high as 25 mph. Chance of precipitation is 90%. New snow accumulation of 4 to 8 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": "Bucks Run 2.5 km ski trail will be groomed for skate and classic skiing today, January 27, 2025. There is an additional $5 daily trail fee for the use of Bucks Run or annual permits are available for $125.  Dogs and walkers are not permitted on our groomed trails."
        },
        {
          "header": "Bucks Run Hours:",
          "content": "Please adhere to posted hours."
        },
        {
          "header": "Natural Snow Classic and Skate Ski Trails",
          "content": "– Golf course trails, Hawk Hills and Coyote Run, were rolled on January 24, 2025.  When skiing the golf course trails please ski on designated marked trails only.  All other trails have not been groomed due to very limited snowfall."
        }
      ],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [
        {
          "header": "Stony Creek Cross Country Ski Rental:",
          "content": "Open this weekend January 25th and 26th from 10 a.m. until 5 p.m. (final rental at 4 p.m.) Ski rentals can be booked ahead https://www.metroparks.com/stony-creek-metropark/#cross-country_skiing.  Trails will not be groomed at this time."
        }
      ],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Mon, Jan 27",
      "conditions": "Classic skied golf course trails from 1-2:30pm.  They were holding up surprisingly well. Rolling it recently has helped if stay solid.  A few spots where you may want to detour off the trails but generally good coverage, but thin.  Even some decent skier tracks to follow for a good portion.  Tomorrow morning should be some decent crust skiing."
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Sat, Jan 25",
      "conditions": "The Nubs upper loops are in great  shape with a fresh big groom this morning. LF 7 was the perfect wax of today ."
    }
  },
  "nubsNob": {
    "date": "1/27/25",
    "liftsOpen": "5 lifts and the rope tow",
    "xcTrails": "Trails are open and in great shape with a classic track set. Trails were groomed on Sunday and will be groomed again tomorrow following the wind today.",
    "nightSkiing": "Tuesday through Saturday from 5:30 to 9:00 PM.",
    "comments": "The wind is up today from the Southwest today. Snow conditions continue to be very good. Expect to encounter some drifts around the ski area today. We are hosting a middle school ski meet on Birch Run this afternoon. The lifts will spin from 9 AM to 4:30 PM today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 21\"",
      "ytd": "YTD: 94\""
    }
  }
}