{
  "timestamp": "2025-12-29T08:00:40.555Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766995200000,
          "temp": 28,
          "snowfall": 51,
          "snowAmount": "",
          "shortForecast": "Chance Rain And Snow",
          "detailedForecast": "A chance of rain and snow after 4am. Cloudy. Low around 28, with temperatures rising to around 33 overnight. West southwest wind around 21 mph, with gusts as high as 48 mph. Chance of precipitation is 50%."
        },
        {
          "name": "Monday",
          "timestamp": 1767006000000,
          "temp": 30,
          "snowfall": 88,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Light Snow then Snow Showers",
          "detailedForecast": "Snow before 7am, then snow showers. Cloudy. High near 30, with temperatures falling to around 26 in the afternoon. West wind around 28 mph, with gusts as high as 53 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1767049200000,
          "temp": 21,
          "snowfall": 42,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Scattered Snow Showers",
          "detailedForecast": "Scattered snow showers. Mostly cloudy, with a low around 21. West northwest wind 13 to 25 mph, with gusts as high as 48 mph. Chance of precipitation is 40%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 27,
          "snowfall": 27,
          "snowAmount": "",
          "shortForecast": "Scattered Snow Showers then Chance Light Snow",
          "detailedForecast": "Scattered snow showers before 7am, then a chance of snow. Mostly cloudy, with a high near 27. West northwest wind 10 to 14 mph, with gusts as high as 25 mph. Chance of precipitation is 30%."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766995200000,
          "temp": 20,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 4 to 8 inches possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers before 5am, then snow showers and blowing snow. Cloudy. Low around 20, with temperatures rising to around 26 overnight. North wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 4 to 8 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1767006000000,
          "temp": 22,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 9 to 13 inches possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers and blowing snow before 4pm, then snow and areas of blowing snow between 4pm and 5pm, then snow showers and areas of blowing snow. Cloudy. High near 22, with temperatures falling to around 19 in the afternoon. Wind chill values as low as 0. North wind 20 to 25 mph, with gusts as high as 50 mph. Chance of precipitation is 100%. New snow accumulation of 9 to 13 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1767049200000,
          "temp": 15,
          "snowfall": 93,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Areas Of Blowing Snow",
          "detailedForecast": "Snow showers and areas of blowing snow before 1am, then patchy blowing snow and a slight chance of snow showers. Mostly cloudy, with a low around 15. Wind chill values as low as -1. Northwest wind 15 to 25 mph, with gusts as high as 50 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 23,
          "snowfall": 80,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy, with a high near 23. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of around one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Overnight",
          "timestamp": 1766995200000,
          "temp": 21,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Cloudy. Low around 21, with temperatures rising to around 27 overnight. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "Monday",
          "timestamp": 1767006000000,
          "temp": 24,
          "snowfall": 100,
          "snowAmount": "New snow accumulation of 7 to 11 inches possible",
          "shortForecast": "Snow Showers And Blowing Snow",
          "detailedForecast": "Snow showers before 8am, then snow showers and blowing snow between 8am and 4pm, then snow and patchy blowing snow between 4pm and 5pm, then snow showers and patchy blowing snow. Cloudy. High near 24, with temperatures falling to around 18 in the afternoon. Wind chill values as low as -1. Northwest wind 15 to 25 mph, with gusts as high as 55 mph. Chance of precipitation is 100%. New snow accumulation of 7 to 11 inches possible."
        },
        {
          "name": "Monday Night",
          "timestamp": 1767049200000,
          "temp": 13,
          "snowfall": 95,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers And Patchy Blowing Snow",
          "detailedForecast": "Snow showers and patchy blowing snow. Mostly cloudy, with a low around 13. Wind chill values as low as -3. Northwest wind 15 to 20 mph, with gusts as high as 45 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tuesday",
          "timestamp": 1767092400000,
          "temp": 22,
          "snowfall": 78,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a high near 22. Wind chill values as low as -1. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    },
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Sat, Dec 27",
      "conditions": "Highly variable, but decent conditions this morning for skate and classic. If you're looking to get out and ski, do it this afternoon; the park has already decided to close for tomorrow. Given how thin the snow coverage is it's doubtful they'll be able to reopen until they spread more snow, and based on past practices, that's unlikely to happen until after New Year . But check anyways in case we get lucky."
    }
  },
  "nubsNob": {
    "date": "12/28/25",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails are fully open with a classic track. Snow depth is thin and some dirt spots will be encountered.",
    "nightSkiing": "5:30 - 9:00 p.m. tonight",
    "comments": "It's a nice start to the ski day at Nub's Nob with a light breeze and machine groomed granular snow. Rain is predicted to arrive late this afternoon and into the evening, so the best time to ski looks like the morning and into the early afternoon. The rain is predicted to transition into accumulating snow overnight. Coverage and base depth continue to be very good on all of our snowmaking runs. The Tweed Tones will play the Nub's Pub this afternoon. Pintail Peak Lodge is open with food and an espresso bar. The soup of the day is meatball mushroom chowder. The lifts will spin from 9 a.m. to 9 p.m. with an hour break from 4:30 to 5:30 p.m. to groom for night skiing. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 1\"",
      "ytd": "YTD: 48\""
    }
  }
}