{
  "timestamp": "2025-12-17T12:00:46.114Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765972800000,
          "temp": 42,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 42, with temperatures falling to around 34 in the afternoon. West southwest wind 3 to 10 mph, with gusts as high as 22 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1766012400000,
          "temp": 28,
          "snowfall": 5,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 28, with temperatures rising to around 34 overnight. South wind 3 to 10 mph, with gusts as high as 20 mph."
        },
        {
          "name": "Thursday",
          "timestamp": 1766055600000,
          "temp": 48,
          "snowfall": 96,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain after 7am. Mostly cloudy. High near 48, with temperatures falling to around 46 in the afternoon. South wind 10 to 14 mph, with gusts as high as 29 mph. Chance of precipitation is 100%. New rainfall amounts between a quarter and half of an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1766098800000,
          "temp": 23,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Rain then Scattered Rain And Snow Showers",
          "detailedForecast": "Rain before 7pm, then rain showers between 7pm and 1am, then scattered rain and snow showers. Cloudy, with a low around 23. Southwest wind 10 to 14 mph, with gusts as high as 26 mph. Chance of precipitation is 100%. New snow accumulation of less than half an inch possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765972800000,
          "temp": 32,
          "snowfall": 10,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 32, with temperatures falling to around 27 in the afternoon. West wind 10 to 15 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1766012400000,
          "temp": 25,
          "snowfall": 9,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 25, with temperatures rising to around 32 overnight. South wind 10 to 15 mph, with gusts as high as 30 mph."
        },
        {
          "name": "Thursday",
          "timestamp": 1766055600000,
          "temp": 42,
          "snowfall": 92,
          "snowAmount": "",
          "shortForecast": "Drizzle then Rain Showers",
          "detailedForecast": "Drizzle between 7am and 1pm, then rain showers. Mostly cloudy. High near 42, with temperatures falling to around 39 in the afternoon. South wind 10 to 15 mph, with gusts as high as 35 mph. Chance of precipitation is 90%."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1766098800000,
          "temp": 15,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain And Snow Showers",
          "detailedForecast": "Rain showers before 7pm, then rain and snow showers. Cloudy, with a low around 15. West wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1765972800000,
          "temp": 35,
          "snowfall": 23,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers then Mostly Cloudy",
          "detailedForecast": "A slight chance of snow showers and a slight chance of freezing drizzle before 10am. Mostly cloudy. High near 35, with temperatures falling to around 26 in the afternoon. West wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1766012400000,
          "temp": 22,
          "snowfall": 8,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. Low around 22, with temperatures rising to around 30 overnight. South wind 5 to 20 mph, with gusts as high as 40 mph."
        },
        {
          "name": "Thursday",
          "timestamp": 1766055600000,
          "temp": 41,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Drizzle Likely then Rain And Snow Showers",
          "detailedForecast": "Drizzle likely between 7am and 1pm, then rain showers between 1pm and 4pm, then rain and snow showers. Mostly cloudy. High near 41, with temperatures falling to around 38 in the afternoon. South wind 10 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 90%."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1766098800000,
          "temp": 14,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain And Snow Showers",
          "detailedForecast": "Rain and snow showers before 7pm, then rain and snow showers. Cloudy, with a low around 14. West wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 17",
      "conditions": "I skied from 10-11:30 today. A very icy wind blown skate deck but still fun. Classic tracks were mostly intact on cedar trace and coyote run, but wind had filled them in on hawks hills. I had a very nice ski."
    },
    "Stoney Creek Metropark (Shelby Township)": {
      "lastUpdated": "Thu, Dec 11",
      "conditions": "[ ] groomed[ ] golf course is about as good as it gets[ ] Sheldon trails - fair to  good littered with tree parts, though the usual being trod upon[ ] icy patches under trees where not enough snow made it to the groun)d as it got colder and the rain - wet snow turned to ( oops - repost -- rain >>> snow"
    },
    "Nubs Nob (Harbor Springs)": {
      "lastUpdated": "Tue, Dec 16",
      "conditions": "All trails power-tilled flat with a classic track and wide skate deck. Conditions are very good."
    }
  },
  "nubsNob": {
    "date": "12/17/25",
    "liftsOpen": "4 chairlifts and the rope tow.",
    "xcTrails": "All trails were power-tilled and tracked on Tuesday. Conditions are very good.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "The exceptional early season conditions continue today. The temperature should stay just below freezing making for a comfortable day on the slopes. The snow surface is machine groomed. Pintail Peak opens this Friday. The Big Park opens on Saturday. Lifts will spin from 9:00 a.m. to 4:30 p.m. today. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 8\"",
      "sevenDays": "7 days: 18\"",
      "ytd": "YTD: 45\""
    }
  }
}