{
  "timestamp": "2025-12-31T19:00:42.490Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767207600000,
          "temp": 29,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow. Cloudy. High near 29, with temperatures falling to around 27 in the afternoon. West wind around 14 mph, with gusts as high as 29 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767222000000,
          "temp": 9,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Light Snow",
          "detailedForecast": "Snow before 1am. Partly cloudy, with a low around 9. Wind chill values as low as -2. West northwest wind 9 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "New Year's Day",
          "timestamp": 1767265200000,
          "temp": 21,
          "snowfall": 1,
          "snowAmount": "",
          "shortForecast": "Mostly Sunny",
          "detailedForecast": "Mostly sunny, with a high near 21. Wind chill values as low as -3. West wind 7 to 10 mph, with gusts as high as 20 mph."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1767308400000,
          "temp": 16,
          "snowfall": 12,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a low around 16. West wind around 7 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767207600000,
          "temp": 21,
          "snowfall": 84,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 21, with temperatures falling to around 15 in the afternoon. Wind chill values as low as -1. Northwest wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 80%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767222000000,
          "temp": 9,
          "snowfall": 56,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 9, with temperatures rising to around 11 overnight. Wind chill values as low as -6. Northwest wind around 15 mph, with gusts as high as 40 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "New Year's Day",
          "timestamp": 1767265200000,
          "temp": 16,
          "snowfall": 24,
          "snowAmount": "New snow accumulation of less than half an inch possible",
          "shortForecast": "Slight Chance Snow Showers",
          "detailedForecast": "A slight chance of snow showers. Mostly cloudy, with a high near 16. Wind chill values as low as -7. West wind around 15 mph, with gusts as high as 35 mph. Chance of precipitation is 20%. New snow accumulation of less than half an inch possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1767308400000,
          "temp": 13,
          "snowfall": 26,
          "snowAmount": "",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers before 1am. Mostly cloudy, with a low around 13. Wind chill values as low as -1. West wind around 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "This Afternoon",
          "timestamp": 1767207600000,
          "temp": 20,
          "snowfall": 83,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy. High near 20, with temperatures falling to around 15 in the afternoon. Wind chill values as low as -1. Northwest wind 15 to 20 mph, with gusts as high as 40 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Tonight",
          "timestamp": 1767222000000,
          "temp": 6,
          "snowfall": 64,
          "snowAmount": "New snow accumulation of 3 to 5 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy. Low around 6, with temperatures rising to around 8 overnight. Wind chill values as low as -7. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 60%. New snow accumulation of 3 to 5 inches possible."
        },
        {
          "name": "New Year's Day",
          "timestamp": 1767265200000,
          "temp": 14,
          "snowfall": 39,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 14. Wind chill values as low as -8. West wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 40%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Thursday Night",
          "timestamp": 1767308400000,
          "temp": 10,
          "snowfall": 45,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a low around 10. Wind chill values as low as -2. West wind around 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [
        {
          "header": "Bucks Run-",
          "content": ""
        }
      ],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 31",
      "conditions": "Huron Meadows reports that Buck's Run will be open at noon, groomed for both skate and classic."
    }
  },
  "nubsNob": {
    "date": "12/31/25",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails will be power tilled and tracked this morning. Conditions are excellent",
    "nightSkiing": "no night skiing tonight",
    "comments": "The last day of 2025 is marked by exceptionally good conditions on the slopes. The fresh snow, overnight cold, and the work of our highly skilled Grooming Crew will provide an awesome snow surface. The lifts will spin from 9:00 a.m. to 4:30 p.m. There is no night skiing tonight. The torchlight parade begins at 5:30 p.m. Gather at the bottom of the Green Lift to witness a spectacular  light show on skis. This is a great way to ring in the New Year with little ones that won't make it to midnight. Dane Tollas will play the Nub's Pub at 1:00 p.m. DJ CJ Bounce will be getting weird and playing family friendly beats outside in the Winter Garden starting at 3:45 p.m. The soup of the day is split pea and ham. Make it a great New Year's Eve at Nub's Nob.",
    "snowData": {
      "daily": "1\"",
      "threeDays": "3 days: 10\"",
      "sevenDays": "7 days: 11\"",
      "ytd": "YTD: 59\""
    }
  }
}