{
  "timestamp": "2025-12-09T23:00:44.496Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1765321200000,
          "temp": 30,
          "snowfall": 99,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Snow",
          "detailedForecast": "Snow between 10pm and 4am, then rain and snow likely. Cloudy. Low around 30, with temperatures rising to around 33 overnight. South southwest wind 7 to 10 mph, with gusts as high as 22 mph. Chance of precipitation is 100%. New snow accumulation of 2 to 4 inches possible."
        },
        {
          "name": "Wednesday",
          "timestamp": 1765364400000,
          "temp": 37,
          "snowfall": 92,
          "snowAmount": "New snow accumulation of 1 to 3 inches possible",
          "shortForecast": "Rain And Snow",
          "detailedForecast": "Rain and snow likely before 7am, then rain and snow between 7am and 9am, then rain and snow between 9am and 3pm. Cloudy. High near 37, with temperatures falling to around 31 in the afternoon. West wind 8 to 16 mph, with gusts as high as 31 mph. Chance of precipitation is 90%. New snow accumulation of 1 to 3 inches possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1765407600000,
          "temp": 17,
          "snowfall": 9,
          "snowAmount": "",
          "shortForecast": "Partly Cloudy",
          "detailedForecast": "Partly cloudy, with a low around 17. Northwest wind 8 to 15 mph, with gusts as high as 28 mph. New rainfall amounts less than a tenth of an inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 29,
          "snowfall": 9,
          "snowAmount": "",
          "shortForecast": "Partly Sunny",
          "detailedForecast": "Partly sunny, with a high near 29. West wind around 10 mph, with gusts as high as 21 mph."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1765321200000,
          "temp": 19,
          "snowfall": 25,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Areas Of Freezing Drizzle then Chance Light Snow",
          "detailedForecast": "Areas of freezing drizzle and a slight chance of snow showers before 7pm, then a chance of snow. Mostly cloudy. Low around 19, with temperatures rising to around 23 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Wednesday",
          "timestamp": 1765364400000,
          "temp": 26,
          "snowfall": 25,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Light Snow then Slight Chance Snow Showers",
          "detailedForecast": "A chance of snow before 10am, then a slight chance of snow showers between 10am and 1pm. Mostly cloudy. High near 26, with temperatures falling to around 21 in the afternoon. North wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1765407600000,
          "temp": 17,
          "snowfall": 70,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely after 7pm. Mostly cloudy, with a low around 17. Northwest wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 27,
          "snowfall": 48,
          "snowAmount": "New snow accumulation of less than one inch possible",
          "shortForecast": "Chance Snow Showers",
          "detailedForecast": "A chance of snow showers. Mostly cloudy, with a high near 27. Northwest wind around 10 mph. Chance of precipitation is 50%. New snow accumulation of less than one inch possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Tonight",
          "timestamp": 1765321200000,
          "temp": 18,
          "snowfall": 66,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Areas Of Freezing Drizzle then Snow Likely",
          "detailedForecast": "Areas of freezing drizzle and a slight chance of snow showers before 7pm, then snow likely. Cloudy. Low around 18, with temperatures rising to around 21 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible. Little or no ice accumulation expected."
        },
        {
          "name": "Wednesday",
          "timestamp": 1765364400000,
          "temp": 26,
          "snowfall": 66,
          "snowAmount": "New snow accumulation of around one inch possible",
          "shortForecast": "Snow Likely then Slight Chance Snow Showers",
          "detailedForecast": "Snow likely before 10am, then a slight chance of snow showers. Cloudy. High near 26, with temperatures falling to around 19 in the afternoon. North wind 10 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 70%. New snow accumulation of around one inch possible."
        },
        {
          "name": "Wednesday Night",
          "timestamp": 1765407600000,
          "temp": 14,
          "snowfall": 76,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers",
          "detailedForecast": "Snow showers. Mostly cloudy, with a low around 14. Northwest wind around 10 mph. Chance of precipitation is 80%. New snow accumulation of 1 to 2 inches possible."
        },
        {
          "name": "Thursday",
          "timestamp": 1765450800000,
          "temp": 26,
          "snowfall": 59,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Snow Showers Likely",
          "detailedForecast": "Snow showers likely. Mostly cloudy, with a high near 26. Northwest wind around 10 mph. Chance of precipitation is 60%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Tue, Dec 9",
      "conditions": "From the park website: Bucks Run is currently closed.  Snow is currently being made for Bucks Run and construction will being in the coming weeks. The golf course trails, Coyote Run and Hawk Hills, along with Cedar Trace were rolled December 9, 2025.  No additional grooming has taken place."
    }
  },
  "nubsNob": {
    "date": "12/09/25: Will open on December 12",
    "liftsOpen": "N/A",
    "xcTrails": "Please access the XC trails from Valley road during snowmaking. The upper trails are groomed and in great shape.",
    "nightSkiing": "Begins Dec. 26",
    "comments": "Nub's Nob is closed today so that we can concentrate on snowmaking. We will be open daily beginning December 12. The Snow Crew is making rapid progress and we plan to have all of the frontside and southside runs open by December 13. Pintail Peak should open by December 20. Thanks for skiing at Nub's Nob.",
    "snowData": {
      "daily": "0\"",
      "threeDays": "3 days: 3\"",
      "sevenDays": "7 days: 12\"",
      "ytd": "YTD: 27\""
    }
  }
}