{
  "timestamp": "2025-12-27T13:08:47.086Z",
  "weather": {
    "shelbyTownship": {
      "name": "Shelby Township",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1766840400000,
          "temp": 35,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 35, with temperatures falling to around 33 in the afternoon. East wind 3 to 7 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1766876400000,
          "temp": 29,
          "snowfall": 39,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Chance Freezing Rain",
          "detailedForecast": "A chance of freezing rain between 1am and 2am, then a chance of rain. Mostly cloudy. Low around 29, with temperatures rising to around 33 overnight. Southeast wind around 7 mph. Chance of precipitation is 40%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday",
          "timestamp": 1766919600000,
          "temp": 52,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain. Cloudy. High near 52, with temperatures falling to around 46 in the afternoon. South southeast wind around 9 mph. Chance of precipitation is 100%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766962800000,
          "temp": 26,
          "snowfall": 100,
          "snowAmount": "",
          "shortForecast": "Rain",
          "detailedForecast": "Rain before 4am, then rain and snow likely. Cloudy, with a low around 26. South southwest wind 7 to 18 mph, with gusts as high as 37 mph. Chance of precipitation is 100%. New rainfall amounts between 1 and 2 inches possible."
        }
      ]
    },
    "nubsNob": {
      "name": "Nubs Nob",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1766840400000,
          "temp": 33,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy. High near 33, with temperatures falling to around 31 in the afternoon. Southeast wind 5 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1766876400000,
          "temp": 26,
          "snowfall": 44,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Chance Freezing Rain",
          "detailedForecast": "A chance of freezing rain after 1am. Mostly cloudy. Low around 26, with temperatures rising to around 29 overnight. Southeast wind 5 to 10 mph. Chance of precipitation is 40%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday",
          "timestamp": 1766919600000,
          "temp": 36,
          "snowfall": 88,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Freezing rain likely before 11am, then rain showers and freezing rain likely. Cloudy, with a high near 36. East wind 5 to 10 mph. Chance of precipitation is 90%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766962800000,
          "temp": 18,
          "snowfall": 93,
          "snowAmount": "New snow accumulation of 2 to 4 inches possible",
          "shortForecast": "Rain Showers then Snow Showers",
          "detailedForecast": "Rain showers before 1am, then snow showers. Cloudy, with a low around 18. Northeast wind 10 to 20 mph, with gusts as high as 35 mph. Chance of precipitation is 90%. New snow accumulation of 2 to 4 inches possible."
        }
      ]
    },
    "otsegoResort": {
      "name": "Otsego Resort",
      "forecast": [
        {
          "name": "Today",
          "timestamp": 1766840400000,
          "temp": 31,
          "snowfall": 0,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy",
          "detailedForecast": "Mostly cloudy, with a high near 31. Southeast wind 5 to 10 mph."
        },
        {
          "name": "Tonight",
          "timestamp": 1766876400000,
          "temp": 25,
          "snowfall": 49,
          "snowAmount": "",
          "shortForecast": "Mostly Cloudy then Chance Snow Showers",
          "detailedForecast": "A chance of snow showers between 1am and 4am, then a chance of freezing rain. Mostly cloudy. Low around 25, with temperatures rising to around 28 overnight. Southeast wind around 10 mph. Chance of precipitation is 50%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday",
          "timestamp": 1766919600000,
          "temp": 37,
          "snowfall": 90,
          "snowAmount": "",
          "shortForecast": "Rain Showers",
          "detailedForecast": "Freezing rain likely before 10am, then rain showers and freezing rain likely. Cloudy, with a high near 37. Southeast wind 5 to 10 mph. Chance of precipitation is 90%. Little or no ice accumulation expected."
        },
        {
          "name": "Sunday Night",
          "timestamp": 1766962800000,
          "temp": 18,
          "snowfall": 96,
          "snowAmount": "New snow accumulation of 1 to 2 inches possible",
          "shortForecast": "Rain Showers then Rain And Snow Showers",
          "detailedForecast": "Rain showers before 1am, then rain and snow showers. Cloudy, with a low around 18. Northeast wind 5 to 15 mph, with gusts as high as 30 mph. Chance of precipitation is 100%. New snow accumulation of 1 to 2 inches possible."
        }
      ]
    }
  },
  "metroparkConditions": {
    "StonyCreekMetropark": {
      "sections": [],
      "title": "Stony Creek Metropark"
    },
    "HuronMeadowsMetropark": {
      "sections": [],
      "title": "Huron Meadows Metropark"
    }
  },
  "nordicConditions": {
    "Huron Meadows Metropark (Brighton)": {
      "lastUpdated": "Wed, Dec 24",
      "conditions": "Buck's Run still has complete coverage! But you'll have to walk a bit to get to it: the clubhouse is closed as is the clubhouse parking lot. Classic tracks are very hard pack or ice but still deep enough to stay on the track. The skating lane is hard pack but several people were skating without any trouble. Me? Klister. But my Rex \"Oi\" just wasn't working very well, probably because of the rushed job of waxing. Great day to doublepole!"
    }
  },
  "nubsNob": {
    "date": "12/27/25",
    "liftsOpen": "All 8 chairlifts, Rope Tow and Conveyor.",
    "xcTrails": "Trails are fully open with a classic track. Snow depth is thin and some dirt spots will be encountered.",
    "nightSkiing": "5:30 - 9:00 p.m. tonight",
    "comments": "It looks like calm weather today with a light breeze. The temperature should hover around freezing. The grooming looks very good this morning. The lifts will spin from 9:00 a.m. to 9:00 p.m. with an hour break from 4:30 to 5:30 p.m. to groom for night skiing. The soup of the day is andouille sweet potato. Pintail Peak Lodge is open with food and an espresso bar. Myk Rise will play the Nub's Pub this afternoon. Make it a great day at Nub's Nob.",
    "snowData": {
      "daily": "Trace",
      "threeDays": "3 days: 0\"",
      "sevenDays": "7 days: 1\"",
      "ytd": "YTD: 48\""
    }
  }
}